{"_id": "q4aa0b116", "title": "", "text": "What is the redemption price for the 0.875% 2025 Notes and the 1.375% 2029 Notes if they are redeemed prior to the applicable Par Call Date?"}
{"_id": "q4aa0a48c", "title": "", "text": "What is the maturity date of the 0.875% 2025 Notes issued by Apple Inc.?"}
{"_id": "q4aa0aeb4", "title": "", "text": "What are the conditions under which the Company is not required to make any payment for any Tax imposed by any government or a political subdivision or taxing authority of or in any government or political subdivision?"}
{"_id": "q4aa05fa4", "title": "", "text": "What is the Company's investment policy and strategy focused on?"}
{"_id": "q4aa092f8", "title": "", "text": "What is the purpose of the Company's internal control over financial reporting?"}
{"_id": "q4aa06580", "title": "", "text": "What was the net income for Apple Inc. in 2020?"}
{"_id": "q4aa06cf6", "title": "", "text": "What is the Company's fiscal year and how does it align with calendar quarters?"}
{"_id": "q4aa0090a", "title": "", "text": "What risks may the COVID-19 pandemic pose to the Company's operational and financial performance?"}
{"_id": "q4aa07d2c", "title": "", "text": "What is the total net deferred tax assets as of September 24, 2022?"}
{"_id": "q4aa09e9c", "title": "", "text": "Who signed the Annual Report on Form 10-K on behalf of the Registrant on October 27, 2022?"}
{"_id": "q4aa097bc", "title": "", "text": "What is the Exhibit Number referenced in the Apple Inc. 2022 Form 10-K filing on page 57?"}
{"_id": "q4aa01b02", "title": "", "text": "What challenges has the COVID-19 pandemic posed to the Company in terms of production and digital content costs?"}
{"_id": "q4aa05e14", "title": "", "text": "What is the balance of the deemed repatriation tax payable imposed by the U.S. Tax Cuts and Jobs Act of 2017 as of September 24, 2022?"}
{"_id": "q4aa05b44", "title": "", "text": "What factors can impact the Company's future gross margins?"}
{"_id": "q4aa089e8", "title": "", "text": "What is the total unrecognized compensation cost related to outstanding RSUs and stock options as of September 24, 2022?"}
{"_id": "q4aa01c7e", "title": "", "text": "What could happen if the Company is unable to nurture its culture?"}
{"_id": "q4aa10404", "title": "", "text": "What is the minimum denomination for the 2022 Notes, the 2024 Notes, the 0.000% 2025 Notes, the 0.875% 2025 Notes, the 2026 Notes, the 2027 Notes, the 1.375% 2029 Notes and the 2031 Notes?"}
{"_id": "q4aa069c2", "title": "", "text": "What was the total shareholders' equity at the end of 2022, according to the Consolidated Statements of Shareholders' Equity?"}
{"_id": "q4aa072a0", "title": "", "text": "What is the proportion of net sales by disaggregated revenue source for each reportable segment in Note 11 for 2022, 2021 and 2020?"}
{"_id": "q4aa1a0c6", "title": "", "text": "What are the interest rates and due years for the notes included in the Officer's Certificate dated May 6, 2014?"}
{"_id": "q4aa01e4a", "title": "", "text": "What measures are taken by the Company to secure confidential information provided to or accessible by third parties?"}
{"_id": "q4aa082fe", "title": "", "text": "What was the weighted-average interest rate of the Company's Commercial Paper as of September 24, 2022 and September 25, 2021, respectively?"}
{"_id": "q4aa013c8", "title": "", "text": "What risks does the Company face in managing the transition to new and upgraded products and services?"}
{"_id": "q4aa078fe", "title": "", "text": "What is the total fair value of the Company's non-current marketable debt securities as of September 24, 2022?"}
{"_id": "q4aa0b634", "title": "", "text": "What is the definition of \"Comparable Government Bond\" in relation to the 0.000% 2025 Notes, the 0.875% 2025 Notes, the 1.375% 2029 Notes and the 2031 Notes?"}
{"_id": "q4aa08ee8", "title": "", "text": "What procedures did Ernst & Young LLP use to evaluate Apple Inc.'s assessment of which tax positions are more likely than not to be sustained?"}
{"_id": "q4aa061ca", "title": "", "text": "What is the maximum one-day loss in fair value of the Company's foreign currency derivative positions estimated with 95% confidence as of September 24, 2022?"}
{"_id": "q4aa0ad06", "title": "", "text": "What is the obligation to pay Additional Amounts not applicable to?"}
{"_id": "q4aa10b3e", "title": "", "text": "What is the purpose of the certification provided in Exhibit 31.1 of the Apple Inc. 10-K report for the year 2022?"}
{"_id": "q4aa001f8", "title": "", "text": "What are the main competitive factors that Apple Inc. must consider when introducing new products and services?"}
{"_id": "q4aa0a928", "title": "", "text": "What is the rate of conversion for payments in respect of the 2022 Notes, the 2024 Notes, the 0.000% 2025 Notes, the 0.875% 2025 Notes, the 2026 Notes, the 2027 Notes, the 1.375% 2029 Notes and the 2031 Notes?"}
{"_id": "q4aa1077e", "title": "", "text": "What is the date of the report referenced in the document?"}
{"_id": "q4aa07aac", "title": "", "text": "What is the total fair value of the Company's derivative assets and liabilities as of September 24, 2022?"}
{"_id": "q4a9ffea6", "title": "", "text": "What is the title of Item 7 in Part II of the Apple Inc. Form 10-K for the Fiscal Year Ended September 24, 2022?"}
{"_id": "q4aa09c08", "title": "", "text": "What is the Form of Restricted Stock Unit Award Agreement under 2022 Employee Stock Plan effective as of March 4, 2022?"}
{"_id": "q4aa00518", "title": "", "text": "What measures does the Company take to protect the safety and security of its team members, visitors and customers?"}
{"_id": "q4aa06710", "title": "", "text": "What was the total comprehensive income for Apple Inc. in 2020?"}
{"_id": "q4aa055e0", "title": "", "text": "What was the total net sales increase in 2022 compared to 2021?"}
{"_id": "q4aa05cac", "title": "", "text": "What was the total other income/(expense), net for 2020?"}
{"_id": "q4aa0473a", "title": "", "text": "What potential liabilities, increased costs, and other adverse effects on the Company's business may arise from its global operations being subject to complex and changing laws and regulations?"}
{"_id": "q4aa0992e", "title": "", "text": "What are the forms of global notes represented in the Officer's Certificate of the Registrant dated as of February 9, 2017?"}
{"_id": "q4aa00748", "title": "", "text": "What are the potential effects of adverse macroeconomic conditions on the Company's operations and performance?"}
{"_id": "q4aa0a720", "title": "", "text": "What is the interest rate of the 2027 Notes?"}
{"_id": "q4aa050fe", "title": "", "text": "What is the outcome of the lawsuit filed by Epic Games against the Company in the U.S. District Court for the Northern District of California?"}
{"_id": "q4aa06af8", "title": "", "text": "What was the total cash paid for income taxes, net in 2022?"}
{"_id": "q4aa0db5a", "title": "", "text": "What changes can be made to the Indentures and any series of Notes without the consent of any holders?"}
{"_id": "q4aa090b4", "title": "", "text": "What is the opinion of Ernst & Young LLP on Apple Inc.'s internal control over financial reporting as of September 24, 2022?"}
{"_id": "q4aa094d8", "title": "", "text": "What is Rule 10b5-1 Trading Plans?"}
{"_id": "q4aa19b44", "title": "", "text": "What are the costs excluded from segment operating income according to the provided context?"}
{"_id": "q4aa074da", "title": "", "text": "What is the total fair value of the Company's cash, cash equivalents and marketable securities as of September 24, 2022?"}
{"_id": "q4aa12f6a", "title": "", "text": "What standards were used to audit Apple Inc.'s financial statements for the period ended September 24, 2022?"}
{"_id": "q4aa00b08", "title": "", "text": "What risks does Apple Inc. face due to global climate change?"}
{"_id": "q4aa08b8c", "title": "", "text": "What percentage of the Company's net sales in 2022, 2021 and 2020 were from the U.S. and China?"}
{"_id": "q4aa19504", "title": "", "text": "What are the primary markets that Apple Inc. targets for its products and services?"}
{"_id": "q4aa07f02", "title": "", "text": "What was the total amount of gross unrecognized tax benefits as of September 24, 2022?"}
{"_id": "q4aa0767e", "title": "", "text": "What is the total marketable securities included in the State Aid Decision and other agreements as of September 24, 2022 and September 25, 2021?"}
{"_id": "q4aa0872c", "title": "", "text": "What were the total shares withheld for 2022, 2021, and 2020, respectively?"}
{"_id": "q4aa0005e", "title": "", "text": "What is the Company's line of personal computers based on its macOS operating system and what does it include?"}
{"_id": "q4a9ffba4", "title": "", "text": "What is the aggregate market value of the voting and non-voting stock held by non-affiliates of the Registrant, as of March 25, 2022?"}
{"_id": "q4aa0d862", "title": "", "text": "What is the minimum percentage of outstanding debt securities of a series required to request the trustee to institute proceedings in respect of an event of default under the 2013 Indenture?"}
{"_id": "q4aa04c12", "title": "", "text": "What potential risks could Apple Inc. face if investigations into its App Store business result in adverse findings?"}
{"_id": "q4aa11a20", "title": "", "text": "What are the two types of fair value estimates mentioned and their bases?\n"}
{"_id": "q4aa0843e", "title": "", "text": "What is the maximum number of shares authorized for issuance under the 2022 Employee Stock Plan?"}
{"_id": "q4aa01742", "title": "", "text": "What potential risks does the Company face in regards to third-party intellectual property?"}
{"_id": "q4aa11264", "title": "", "text": "What is the date of the certification of the Chief Executive Officer and Chief Financial Officer of Apple Inc. as stated in the document?"}
{"_id": "q4aa09aa0", "title": "", "text": "What are the forms of global notes included in the Officer's Certificate of the Registrant dated as of August 8, 2022?"}
{"_id": "q4aa0dd62", "title": "", "text": "What is the definition of \"U.S. government obligations\" with respect to the 2022 Notes, the 2024 Notes, the 0.000% 2025 Notes, the 0.875% 2025 Notes, the 2026 Notes, the 2027 Notes, the 1.375% 2029 Notes and the 2031 Notes?"}
{"_id": "q4aa08cf4", "title": "", "text": "What is the total amount of gross unrecognized tax benefits as of September 24, 2022?"}
{"_id": "q4aa01986", "title": "", "text": "What factors may influence third-party developers' decisions to develop and maintain software applications and services for the Company's products?"}
{"_id": "q4aa04dd4", "title": "", "text": "What are the potential changes to the Company's effective tax rates?"}
{"_id": "q4aa063be", "title": "", "text": "What is the index to the consolidated financial statements page in the document?"}
{"_id": "q4aa06878", "title": "", "text": "What is the total current assets of Apple Inc. as of September 24, 2022?"}
{"_id": "q4aa05464", "title": "", "text": "What was the cumulative total return of Apple Inc. on September 24, 2022?"}
{"_id": "q4aa105da", "title": "", "text": "What is the jurisdiction of incorporation of Apple South Asia (Thailand) Limited?"}
{"_id": "q4aa0967c", "title": "", "text": "What is the PCAOB Firm ID Number of Ernst & Young LLP?"}
{"_id": "q4aa07c0a", "title": "", "text": "What was the total foreign provision for income taxes in 2020?"}
{"_id": "q4aa011e8", "title": "", "text": "What risks does the Company face due to industrial accidents at its suppliers and contract manufacturers?"}
{"_id": "q4aa0aafe", "title": "", "text": "What is the covenant contained in all of the Notes regarding Additional Amounts?"}
{"_id": "q4aa05720", "title": "", "text": "What caused the increase in Mac net sales during 2022 compared to 2021?"}
{"_id": "q4aa175b0", "title": "", "text": "What are the three performance obligations regularly included in arrangements involving the sale of iPhone, Mac, iPad, and certain other products according to Apple Inc.'s revenue recognition policy?"}
{"_id": "q4aa12236", "title": "", "text": "What financial strategy did the Company use to manage interest rate and foreign currency risk on its notes?"}
{"_id": "q4aa0b864", "title": "", "text": "What are the conditions that must be satisfied for a consolidation, merger, or sale of assets to occur according to the Indentures?"}
{"_id": "q4aa18bf4", "title": "", "text": "What is the fiscal year end date for the annual report filed by Apple Inc. for the SEC?"}
{"_id": "q4aa0159e", "title": "", "text": "What risks does the Company face if suppliers decide to concentrate on the production of common components instead of components customized to meet the Company’s requirements?"}
{"_id": "q4aa085ba", "title": "", "text": "What is the maximum number of shares authorized for issuance under the Director Plan at the time the plan was last amended on November 9, 2021?"}
{"_id": "q4aa049ba", "title": "", "text": "What risks and costs may increase as the Company's products and services are introduced into specialized applications, including health and financial services?"}
{"_id": "q4aa1b5ac", "title": "", "text": "What actions can be taken with respect to the 2018 Indenture regarding the provisions of one or more series of debt securities?"}
{"_id": "q4aa06eae", "title": "", "text": "What is the Company's policy regarding unbilled consideration related to long-term service arrangements?"}
{"_id": "q4aa0a5c2", "title": "", "text": "What was the aggregate principal amount of the 2026 Notes outstanding as of October 14, 2022?"}
{"_id": "q4aa08042", "title": "", "text": "What were the fixed cash payments related to operating leases in 2020?"}
{"_id": "q4aa0a040", "title": "", "text": "What is the voting requirement for the election of directors in Apple Inc.?"}
{"_id": "q4aa0818c", "title": "", "text": "What is the total lease liabilities as of September 24, 2022?"}
{"_id": "q4aa07106", "title": "", "text": "What is the accounting treatment for derivative gains and losses based on intended use and hedge designation?"}
{"_id": "q4aa10ed6", "title": "", "text": "What is the responsibility of Luca Maestri and the other certifying officers with regards to the financial statements and other financial information included in the report?"}
{"_id": "q4aa058e2", "title": "", "text": "What was the net sales increase in the Americas segment during 2022 compared to 2021?"}
{"_id": "q4aa01fda", "title": "", "text": "What risks are associated with the Company's investment in new business strategies and acquisitions?"}
{"_id": "q4aa0a1d0", "title": "", "text": "What percentage of outstanding shares must vote against an amendment of the Bylaws or the Articles reducing the fixed number or the minimum number of directors to less than five in order for it to not be adopted?"}
{"_id": "q4aa0a34c", "title": "", "text": "What is the minimum percentage of shares required for a shareholder to nominate director nominees constituting up to 20% of the Company's Board of Directors?"}
{"_id": "q4aa05284", "title": "", "text": "What was the approximate dollar value of shares that may yet be purchased under the Program as of September 24, 2022?"}
{"_id": "q4aa0b3fa", "title": "", "text": "What is the \"Par Call Date\" for the 0.875% 2025 Notes?"}
