{"_id": "q1a73c1d4", "title": "", "text": "In which year was interest income greater than 7,000 thousands?"}
{"_id": "q1a72ef98", "title": "", "text": "What was the Net Income (Loss) in 2019?"}
{"_id": "q1a716380", "title": "", "text": "What was the percentage of Plan Assets for Other assets in 2019?"}
{"_id": "q1a73f97e", "title": "", "text": "What was the service revenue from Americas in 2019?"}
{"_id": "q1a731ee6", "title": "", "text": "What was the Customer support renewal rate for the quarter ended June 30, 2019?"}
{"_id": "q1a729624", "title": "", "text": "What is the change in Loans due from subsidiaries - current portion from 2018 to 2019?"}
{"_id": "q1a732468", "title": "", "text": "What is the change in Add: Voyage expenses from Years Ended December 31, 2018 to 2019?"}
{"_id": "q1a73f24e", "title": "", "text": "What is the change in Depreciation and amortization between 2018 and 2019?"}
{"_id": "q1a714760", "title": "", "text": "What was the percentage change in total pretax income between 2018 and 2019?"}
{"_id": "q1a72d620", "title": "", "text": "What are the respective maintenance revenue in 2018 and 2019?"}
{"_id": "q1a716fa6", "title": "", "text": "What was the percentage change in adjusted EBITDA between 2018 and 2019?"}
{"_id": "q1a729854", "title": "", "text": "What are the other costs associated with the closure of the Overland Park office apart from restructuring charges?"}
{"_id": "q1a738476", "title": "", "text": "What is the percentage change in the vessel operating expense between 2018 and 2019?"}
{"_id": "q1a7212bc", "title": "", "text": "What is the average restructuring costs for 2018 and 2019?"}
{"_id": "q1a73ceea", "title": "", "text": "What is the average net loss in 2017 and 2018?"}
{"_id": "q1a736734", "title": "", "text": "What is the percentage change in the non controlling interest share of loss from 2018 to 2019?"}
{"_id": "q1a71a980", "title": "", "text": "What is the percentage change in Net earnings from operations from 2018 to 2019?"}
{"_id": "q1a719cba", "title": "", "text": "How many categories of liabilities are there?"}
{"_id": "q1a71659c", "title": "", "text": "How many day terms do the trade receivables generally have?"}
{"_id": "q1a738908", "title": "", "text": "What was the change in the balance for 2019?"}
{"_id": "q1a734da8", "title": "", "text": "What was the percentage change in deferred value in 2019 from 2018?"}
{"_id": "q1a71b77c", "title": "", "text": "What was the increase in net cash provided by operating activities from 2018 to 2019?"}
{"_id": "q1a71ef26", "title": "", "text": "What was the federal NOL carryforwards?"}
{"_id": "q1a72004c", "title": "", "text": "How many years was there a positive net profit for the year excluding impairment recorded?"}
{"_id": "q1a724868", "title": "", "text": "What are the 4 assumptions shown in the table?"}
{"_id": "q1a713b80", "title": "", "text": "What was the change in stock-based compensation between 2018 and 2019?"}
{"_id": "q1a721ae6", "title": "", "text": "What percentage of the total revenue from all sources consists of total revenue from Network Solutions?"}
{"_id": "q1a728dd2", "title": "", "text": "What was the change in the average prices for Gold in 2019 from 2018?"}
{"_id": "q1a72559c", "title": "", "text": "What is the percentage change in capitalized interest in 2019?"}
{"_id": "q1a73aa1e", "title": "", "text": "Under the Amended and Restated 2004 Stock Incentive Plan, how many shares of common stock were available for future issuance as of September 29, 2019?"}
{"_id": "q1a72a7a4", "title": "", "text": "How many years did Trade receivables, net exceed $150 million?"}
{"_id": "q1a719ee0", "title": "", "text": "What is the US$ value for 2019 translated for?"}
{"_id": "q1a73e95c", "title": "", "text": "How many years did adjusted EBITDA exceed $4,000 million?"}
{"_id": "q1a72d922", "title": "", "text": "How many years did net financed service contracts exceed $2,000 million?"}
{"_id": "q1a722c02", "title": "", "text": "What was the respective cost of net revenue in 2019 and 2018?"}
{"_id": "q1a73887c", "title": "", "text": "When are multi-year agreement customers invoiced?"}
{"_id": "q1a711e3e", "title": "", "text": "What costs are associated under capital expenditure?"}
{"_id": "q1a73028a", "title": "", "text": "What was the weighted average estimated life of client relationships in years?"}
{"_id": "q1a734010", "title": "", "text": "How much difference in revenue in 2018 compared to 2017?"}
{"_id": "q1a71a1a6", "title": "", "text": "Which locations are responsible for driving the increase in sales in 2019?"}
{"_id": "q1a7333cc", "title": "", "text": "What is the inventory for 2019 and 2018 respectively?"}
{"_id": "q1a714508", "title": "", "text": "What was the change in the amount of Accruals?"}
{"_id": "q1a72decc", "title": "", "text": "What is Notes payable and long-term debt as a percentage of the total contractual obligations?"}
{"_id": "q1a7182c0", "title": "", "text": "What led to lower capital expenditures at Bell Media in 2019?"}
{"_id": "q1a72ff38", "title": "", "text": "What was the percentage change in Other in 2019 from 2018?"}
{"_id": "q1a730852", "title": "", "text": "What was the 2019 year-on-year percentage change in VAS revenues?"}
{"_id": "q1a73a7f8", "title": "", "text": "What was the percentage change in Trade accounts receivable, net, noncurrent in 2019 from 2018?"}
{"_id": "q1a72db5c", "title": "", "text": "What is the difference between the largest depreciation expense and the smallest depreciation expense?"}
{"_id": "q1a74019e", "title": "", "text": "What is the average number of devices sold from 2017-2019?"}
{"_id": "q1a72617c", "title": "", "text": "What was the change in the total compensation in 2019 from 2018?"}
{"_id": "q1a734524", "title": "", "text": "What was the Projected benefit obligation in 2018?"}
{"_id": "q1a71d1d0", "title": "", "text": "What are the Company’s senior notes?"}
{"_id": "q1a718324", "title": "", "text": "Which segment has the largest % change in capital intensity ratio?"}
{"_id": "q1a7200a6", "title": "", "text": "What was the percentage change in Net profit/(loss) for the year excluding impairment in 2019 from 2018?"}
{"_id": "q1a7229dc", "title": "", "text": "What is the Total change in research and development expenses from 2017 to 2019?"}
{"_id": "q1a71f98a", "title": "", "text": "What is the percentage change in net carrying value between 2018 and 2019?"}
{"_id": "q1a731946", "title": "", "text": "What is the Board and Systems business revenue in 2019?"}
{"_id": "q1a73eb78", "title": "", "text": "In which year was Dividend and interest income smallest?"}
{"_id": "q1a721c44", "title": "", "text": "What are the additional sources for additional liquidity?"}
{"_id": "q1a73aeb0", "title": "", "text": "When is it allowed to offset deferred tax assets and liabilities?"}
{"_id": "q1a71c9ba", "title": "", "text": "What is the average in total franchise costs for 2018 and 2019?"}
{"_id": "q1a72a088", "title": "", "text": "What is the percentage of Wireless subscribers out of the total subscribers for 2019? "}
{"_id": "q1a7375b2", "title": "", "text": "Where is the common stock traded under the symbol \"MEI.\"?"}
{"_id": "q1a723120", "title": "", "text": "What is the stock fluctuation between high and low in the first quarter of fiscal year 2019?"}
{"_id": "q1a73d318", "title": "", "text": "Who are the primary customers for the company?"}
{"_id": "q1a714e54", "title": "", "text": "What does the table show?"}
{"_id": "q1a71861c", "title": "", "text": "What are the respective goodwill at 2018 and 2019?"}
{"_id": "q1a72ecaa", "title": "", "text": "What was the change in accrued taxes between 2018 and 2019?"}
{"_id": "q1a734f42", "title": "", "text": "Which model is used for estimating the fair value of SSARs?"}
{"_id": "q1a73bf5e", "title": "", "text": "What is the change in Reserves and accruals between 2018 and 2019?"}
{"_id": "q1a739574", "title": "", "text": "What are the respective total accrued liabilities in 2018 and 2019?"}
{"_id": "q1a722e0a", "title": "", "text": "How much did NEXTDC paid for the rent and ancillary amounts to APDC?"}
{"_id": "q1a731450", "title": "", "text": "How much did the operating income grew in the September 2019 on a sequential and year-over-year basis?"}
{"_id": "q1a72c6e4", "title": "", "text": "What was the change in Valuation allowance in 2019 from 2018?"}
{"_id": "q1a726d02", "title": "", "text": "What is the proportion of gross carrying amount of  Non-amortizing intangible assets over the total gross carrying amount of intangible assets in 2018?"}
{"_id": "q1a73af14", "title": "", "text": "What does TWDV mean?"}
{"_id": "q1a7226ee", "title": "", "text": "What is the total charges for Fiscal year 2019?"}
{"_id": "q1a7144ae", "title": "", "text": "What are the components under Non-current?"}
{"_id": "q1a72937c", "title": "", "text": "What is the subtotal of the value added as a percentage of net sales dollars in fiscal year 2019?"}
{"_id": "q1a71dc3e", "title": "", "text": "What was the movement in the EMEA revenue?"}
{"_id": "q1a72b41a", "title": "", "text": "What was the change in the amount at 31 December?"}
{"_id": "q1a73a7c6", "title": "", "text": "What was the change in Trade accounts receivable, net, noncurrent in 2019 from 2018?"}
{"_id": "q1a72522c", "title": "", "text": "What is the year with Charges included in discontinued operations?"}
{"_id": "q1a733fde", "title": "", "text": "How was the cash for the Inotera Acquisition raised besides the sale of Micron common stock?"}
{"_id": "q1a7190f8", "title": "", "text": "What was the percentage change in Provision for income tax expense (benefit) between 2017 and 2018?"}
{"_id": "q1a713e82", "title": "", "text": "What is the change in Net Loss between December 31, 2018 and 2019?"}
{"_id": "q1a715958", "title": "", "text": "What was the amount of unrecognized stock-based compensation expense related to unvested employee stock options in 2019?"}
{"_id": "q1a72c356", "title": "", "text": "What is the increase / (decrease) in the total debt carrying value?"}
{"_id": "q1a734d80", "title": "", "text": "What was the change in deferred value in 2019 from 2018?"}
{"_id": "q1a73c224", "title": "", "text": "What was the interest income in 2019?"}
{"_id": "q1a73215c", "title": "", "text": "Which method is used for computing the basic and diluted earnings (loss) per common share?"}
{"_id": "q1a7246b0", "title": "", "text": "What is the percentage change in the income from operations from 2017 to 2018?"}
{"_id": "q1a7201f0", "title": "", "text": "What was the adjustment for the values for 2018?"}
{"_id": "q1a72105a", "title": "", "text": "What percent of total goodwill acquired during fiscal 2019 is the goodwill acquired from the purchase of Agiletics,Inc?"}
{"_id": "q1a721c6c", "title": "", "text": "What is the net cash from operating activities in 2019?"}
{"_id": "q1a72b582", "title": "", "text": "What was the Number of shares of common stock granted in 2018?"}
{"_id": "q1a730faa", "title": "", "text": "What was the income tax benefit in 2019 related to?"}
{"_id": "q1a714f3a", "title": "", "text": "Who has the highest compensation among all non-employee directors?"}
{"_id": "q1a71313a", "title": "", "text": "What was the change in gross profit between May 2019 and August 2019?"}
{"_id": "q1a733a48", "title": "", "text": "What was the revenue from AMER from Industrial/Commercial as a percentage of the total revenue from Industrial/Commercial?"}
{"_id": "q1a724ae8", "title": "", "text": "What is the total amount of deferred income in 2019?"}
{"_id": "q1a714684", "title": "", "text": "What was the domestic pretax income in 2019?"}
{"_id": "q1a72f31c", "title": "", "text": "What was the percentage change in Other liabilities in 2019 from 2018?"}
{"_id": "q1a72ceaa", "title": "", "text": "What is the total sum of the top 3 prepaid expenses in 2018?"}
{"_id": "q1a73a712", "title": "", "text": "Where is Trade accounts receivable, net, current included in?"}
{"_id": "q1a723756", "title": "", "text": "What is the increase/ (decrease) in Income tax expense (benefit) from 2018 to 2019?"}
{"_id": "q1a73b400", "title": "", "text": "What is the percentage of the number of outstanding shares at the end of the period from 2018 to 2019?"}
{"_id": "q1a715d04", "title": "", "text": "Why was the disallowance of the shorter deductibility period would not affect the annual effective tax rate but would accelerate the payment of cash to the taxing authority to an earlier period?"}
{"_id": "q1a731004", "title": "", "text": "What was the average income tax benefit for 2018 and 2019?"}
{"_id": "q1a7418fa", "title": "", "text": "What was the change in the total retail subscribers?"}
{"_id": "q1a721e4c", "title": "", "text": "What is the Gross accounts receivables for 2019 and 2018 respectively?"}
{"_id": "q1a72079a", "title": "", "text": "What was the change in PSP payments for the Group in 2019 from 2018?"}
{"_id": "q1a739fc4", "title": "", "text": "Which years does the table provide information for revenue by geographic region?"}
{"_id": "q1a712b04", "title": "", "text": "How much did the level 2 OFA change by from 2018 year end to 2019 year end?"}
{"_id": "q1a73b3a6", "title": "", "text": "What is the number of shares forfeited during the period in 2019?"}
{"_id": "q1a731482", "title": "", "text": "How much did the operating income grew in December 2018 a sequential and year-over-year basis?"}
{"_id": "q1a736e96", "title": "", "text": "What is the change in Interest income from 2018 to 2019?"}
{"_id": "q1a726aaa", "title": "", "text": "What is the value of revenue from professional services as a percentage of the 2018 total revenue?"}
{"_id": "q1a73d372", "title": "", "text": "What is the percentage of customers from Taiwan in 2019?"}
{"_id": "q1a7189aa", "title": "", "text": "What is the change in Trade payables from 2018 to 2019?"}
{"_id": "q1a71690c", "title": "", "text": "In which year was intangible assets negative?"}
{"_id": "q1a72e3ae", "title": "", "text": "Which year has the highest amount of Restricted Share Awards (“RSAs”)?"}
{"_id": "q1a7133c4", "title": "", "text": "What is the average deferral of revenues from 2017-2019?"}
{"_id": "q1a711452", "title": "", "text": "What is the percentage of adjustment to the balance of as reported prepaid expenses and other current assets?"}
{"_id": "q1a716146", "title": "", "text": "What is the average cash dividends declared per share for fiscal years 2017 to 2019?"}
{"_id": "q1a72506a", "title": "", "text": "What is the average number of potential common shares excluded from diluted net loss per share between 2017 and 2019?"}
{"_id": "q1a72a218", "title": "", "text": "What was the company's rank in 2019 conducted by the Taiwan Stock Exchange and Taipei Exchange?"}
{"_id": "q1a728396", "title": "", "text": "What was the percentage change in the total amortization of purchased intangible assets between 2018 and 2019?"}
{"_id": "q1a726154", "title": "", "text": "In which year was Share-based payments larger?"}
{"_id": "q1a72e386", "title": "", "text": "What is the average value of the Restricted Share Awards (“RSAs”) for fiscal years 2019, 2018 and 2017?"}
{"_id": "q1a73698c", "title": "", "text": "What was the percentage change in Other non-current assets between 2018 and 2019?"}
{"_id": "q1a723918", "title": "", "text": "Why did subscription revenue increase by $76.3 million between 2018 and 2017?"}
{"_id": "q1a71634e", "title": "", "text": "What was the target allocation for Equity Securities in 2020?"}
{"_id": "q1a73221a", "title": "", "text": "What was the average net income attributable to noncontrolling interest for 2017-2019?"}
{"_id": "q1a73bf0e", "title": "", "text": "How many components does the deferred tax assets consist of?"}
{"_id": "q1a72c37e", "title": "", "text": "The company's debt value increases by what amount if the interest rate decreases by 1% in 2019?"}
{"_id": "q1a73a9c4", "title": "", "text": "Which groups of people are generally issued with Nonvested restricted stock units (\"RSUs\")?"}
{"_id": "q1a740612", "title": "", "text": "How many percent of the total inventory purchases did Supplier A account for in the year 2019?"}
{"_id": "q1a713194", "title": "", "text": "What was the percentage change in net revenue between November 2018 and February 2019?"}
{"_id": "q1a720024", "title": "", "text": "What are the components under Reconciliation to net profit/(loss) for the year when calculating the Net profit/(loss) for the year excluding impairment?"}
{"_id": "q1a72ac68", "title": "", "text": "What was the Total sales in 2019?"}
{"_id": "q1a717ffa", "title": "", "text": "What are the respective APRU from off-net in 2017 and 2018 respectively?"}
{"_id": "q1a717dfc", "title": "", "text": "What was the change in the Shareholder distributions – dividends in 2019 from 2018?"}
{"_id": "q1a7146de", "title": "", "text": "What does the table represent?"}
{"_id": "q1a730956", "title": "", "text": "What is the year-on-year change in Online Advertising Business revenue?"}
{"_id": "q1a73bc34", "title": "", "text": "Which country is the FSRU terminal  situated at?"}
{"_id": "q1a713af4", "title": "", "text": "What was the Gross profit from continuing operations, as reported in 2019?"}
{"_id": "q1a74165c", "title": "", "text": "What is the average number of shares beneficially owned by Brian Kinion and Christopher Lien?"}
{"_id": "q1a71ae3a", "title": "", "text": "What was the average Contract for future issue of equity?"}
{"_id": "q1a73c724", "title": "", "text": "Which type of total operating revenues has the highest $ CHANGE?"}
{"_id": "q1a727054", "title": "", "text": "What was income tax obligations as a percentage of the total Contractual Obligations ?"}
{"_id": "q1a72cc98", "title": "", "text": "What was the average performance shares for 2017-2019?"}
{"_id": "q1a74066c", "title": "", "text": "What is the percentage change between inventory purchases from Supplier B from 2017 to 2018?"}
{"_id": "q1a72b35c", "title": "", "text": "Where are the government grants included within?"}
{"_id": "q1a71fdea", "title": "", "text": "What was the common stockholders, basic for Classes A and B Net income per weighted-average share attributable to VMware, Inc. common stockholders, basic for Classes A and B in Q2 2020?"}
{"_id": "q1a73d39a", "title": "", "text": "What is the increase / (decrease) in customers from Taiwan from 2018 to 2019?"}
{"_id": "q1a71965c", "title": "", "text": "What accounted for the decrease in the share of net earnings in Golar Partners?"}
{"_id": "q1a72027c", "title": "", "text": "In which year was the amount of financial assets larger?"}
{"_id": "q1a72772a", "title": "", "text": "What is the Sitting Fees for attending board/ committee meetings for O P Bhatt?"}
{"_id": "q1a72d8c8", "title": "", "text": "What was the net lease receivables in 2019?"}
{"_id": "q1a73088e", "title": "", "text": "What was the reason for the year-on-year change for revenues from FinTech and Business Services?"}
{"_id": "q1a7280b2", "title": "", "text": "What is the difference in long-term debt obligations between 'less than 1 year' and '1-3 years'?"}
{"_id": "q1a73a776", "title": "", "text": "What are the types of accounts in the Company's trade accounts receivable?"}
{"_id": "q1a71c014", "title": "", "text": "What is the value of customer A's accounts receivable as a percentage of the revenue derived from customer A in 2019?"}
{"_id": "q1a73b75c", "title": "", "text": "How many years did the Weighted-average interest rate exceed 3%?"}
{"_id": "q1a738e9e", "title": "", "text": "Which years does the table provide information for?"}
{"_id": "q1a7329b8", "title": "", "text": "What is the nominal difference of the total dividends paid in cash between 2018 and 2019?"}
{"_id": "q1a7269c4", "title": "", "text": "What are the 2017 and 2018 total revenue respectively?"}
{"_id": "q1a72ced2", "title": "", "text": "What is the % change in the prepaid services amount from 2018 to 2019?"}
{"_id": "q1a71bb32", "title": "", "text": "Does the company expect to incur additional restructuring expenses in future periods?"}
{"_id": "q1a735ec4", "title": "", "text": "What caused the decrease of total revenue for 2018 to 2019?"}
{"_id": "q1a716678", "title": "", "text": "What is the percentage change of past due but not impaired receivable that is over 2 months overdue from 2018 to 2019?"}
{"_id": "q1a712e6a", "title": "", "text": "What is the average FY19 individual payout amount?"}
{"_id": "q1a71f76e", "title": "", "text": "What was the percentage change in free cash flow?"}
{"_id": "q1a734560", "title": "", "text": "What was the Accumulated benefit obligation in 2019?"}
{"_id": "q1a7196b6", "title": "", "text": "What was the change in ownership interest in Golar Partners held from 2018 to 2019?"}
{"_id": "q1a73a014", "title": "", "text": "What was the change in the revenue from South America between 2017 and 2018?"}
{"_id": "q1a721316", "title": "", "text": "What is the percentage change of the total costs from 2018 to 2019?"}
{"_id": "q1a7412f6", "title": "", "text": "What was the amount of buildings and improvements in 2019?"}
{"_id": "q1a7383ea", "title": "", "text": "What are the respective vessel operating expense in 2018 and 2019?"}
{"_id": "q1a71d932", "title": "", "text": "What do wages and salaries include?"}
{"_id": "q1a72acfe", "title": "", "text": "In which year was the amount of Rest of World the largest?"}
{"_id": "q1a73c17a", "title": "", "text": "What is the change in Interest expense from, 2019 to 2018?"}
{"_id": "q1a718ca2", "title": "", "text": "What is the percentage change in the net income from 2018 to 2019?"}
{"_id": "q1a725948", "title": "", "text": "Which associate contributed the most significant amount to Singtel's group share of associates' post-tax profits for 2019?"}
{"_id": "q1a741350", "title": "", "text": "How many years did the amount of Machinery and equipment exceed $200,000 thousand?"}
{"_id": "q1a719f6c", "title": "", "text": "What was the change in Dividend Paid per Ordinary Share in € in 2016 from 2015?"}
{"_id": "q1a724f7a", "title": "", "text": "What are the respective number of convertible senior notes in 2017 and 2018?"}
{"_id": "q1a724976", "title": "", "text": "Between 2018 and 2019 year end, which year had lower expected volatility?"}
{"_id": "q1a73e574", "title": "", "text": "How are the other financial income and expenses from financial instruments assigned?"}
{"_id": "q1a7159bc", "title": "", "text": "How long is it expected to take for the unrecognized stock-based compensation expense related to unvested RSUs to be recognized?"}
{"_id": "q1a72412e", "title": "", "text": "What was the contribution of the 28nm and below technologies in 2019?"}
{"_id": "q1a71ab4c", "title": "", "text": "What are the types of provisions for post-employment benefits plans?"}
{"_id": "q1a735ef6", "title": "", "text": "What was the total revenue in 2019?"}
{"_id": "q1a73339a", "title": "", "text": "What are the employee benefits for 2019 and 2018 respectively?"}
{"_id": "q1a738f7a", "title": "", "text": "What was the total percentage change in the provision for income taxes between 2017 and 2019?"}
{"_id": "q1a7349d4", "title": "", "text": "How much was the increase in revenue?"}
{"_id": "q1a72fe3e", "title": "", "text": "What was the valuation allowance for certain deferred tax assets in 2019?"}
{"_id": "q1a720768", "title": "", "text": "In which year were the PSP payments for the Group larger?"}
{"_id": "q1a735ac8", "title": "", "text": "What is the total number of shares purchased in fiscal year 2018 and 2019 respectively?"}
{"_id": "q1a72128a", "title": "", "text": "How much did the costs of closed restaurants and other increased by from 2018 to 2019?"}
{"_id": "q1a7241e2", "title": "", "text": "What percentage of total was 90 nanometers in 2019?"}
{"_id": "q1a73efba", "title": "", "text": "In which year was Risk free rate of return more than 2.0%?"}
{"_id": "q1a7342e0", "title": "", "text": "What were the total operating expenses during fiscal years 2018 and 2019, respectively? "}
{"_id": "q1a73d67e", "title": "", "text": "What is the percentage change in the shares balance from 30 June 2018 to 30 June 2019?"}
{"_id": "q1a723c10", "title": "", "text": "What was the percentage change in the total income between 2018 and 2019?"}
{"_id": "q1a71555c", "title": "", "text": "What is the % change in total property and equipment from 2018 to 2019?"}
{"_id": "q1a718cd4", "title": "", "text": "What is the percentage change in the convertible notes from 2018 to 2019?"}
{"_id": "q1a72d35a", "title": "", "text": "In which year were the Dividend shares awarded larger?"}
{"_id": "q1a7410f8", "title": "", "text": "What is the non-equity incentive target amount for Robert Dooley and Eric Lerner respectively?"}
{"_id": "q1a731630", "title": "", "text": "How is deferred income recognised for contracts that exceed one year?"}
{"_id": "q1a72856c", "title": "", "text": "How is the market value calculated?"}
{"_id": "q1a71d73e", "title": "", "text": "What was the total amount amortized for the categories of cloud services and license support agreements and related relationships and other in 2018?"}
{"_id": "q1a71e63e", "title": "", "text": "What is the total other income in 2019 and 2018 respectively?"}
{"_id": "q1a735b4a", "title": "", "text": "What is the percentage change of the average price paid per share between fiscal year 2018 and 2019?"}
{"_id": "q1a727da6", "title": "", "text": "What was the Technology Development revenue in 2019 and 2018 respectively?"}
{"_id": "q1a71d9be", "title": "", "text": "In which year was the amount of personnel expenses larger?"}
{"_id": "q1a72b1cc", "title": "", "text": "In which year was Webzone larger?"}
{"_id": "q1a72cdf6", "title": "", "text": "What is the content of Note 4 about?"}
{"_id": "q1a726442", "title": "", "text": "How much was the valuation allowance recorded by the company on its deferred tax asset related to U.S. foreign tax credits in 2018?"}
{"_id": "q1a71e080", "title": "", "text": "What was the net cash provided by operating activities for the year ended in 2017?"}
{"_id": "q1a723e72", "title": "", "text": "What was the increase / (decrease) in the Cash flow from operating activities from 2018 to 2019?"}
{"_id": "q1a7171f4", "title": "", "text": "Who is the oldest executive officer in the company?"}
{"_id": "q1a72f0a6", "title": "", "text": "What was the percentage change in Earnings (loss) per share—basic between 2018 and 2019?"}
{"_id": "q1a718090", "title": "", "text": "What is the percentage change in off-net APRU between 2017 and 2018? "}
{"_id": "q1a731694", "title": "", "text": "What are the different contract lengths whereby revenue will be recognised by the Group when it satisfies the remaining performance obligations in the contracts?"}
{"_id": "q1a721082", "title": "", "text": "What is the average ending carrying amount of goodwill under the payment segment for 2018 and 2019?"}
{"_id": "q1a7215b4", "title": "", "text": "What is the percentage change in the software license revenue from 2018 to 2019?"}
{"_id": "q1a7312ca", "title": "", "text": "What was the percentage change in Notes receivable and other non-current assets between 2018 and 2019?"}
{"_id": "q1a72de4a", "title": "", "text": "What does Non-cancelable purchase order obligations consist of?"}
{"_id": "q1a72de18", "title": "", "text": "What does Future interest on notes payable and long-term debt consist of?"}
{"_id": "q1a73033e", "title": "", "text": "What was the difference in the gross carrying value between Trade Names and Non-compete agreements?"}
{"_id": "q1a718cfc", "title": "", "text": "In which year is the Diluted average shares outstanding is the highest?"}
{"_id": "q1a717fc8", "title": "", "text": "What are the respective APRU from on-net in 2017 and 2018 respectively?"}
{"_id": "q1a73a366", "title": "", "text": "What is the total amount of all other compensation by all the directors in the table?"}
{"_id": "q1a73aee2", "title": "", "text": "What are the 2 main items measured in this table?"}
{"_id": "q1a71cec4", "title": "", "text": "What was the Cash paid for interest in 2017?"}
{"_id": "q1a73c6f2", "title": "", "text": "What was the percentage change in External service revenues in 2019 compared to the previous year?"}
{"_id": "q1a722464", "title": "", "text": "What is the percentage constitution of the total claims payable among the total contractual obligations?"}
{"_id": "q1a720fce", "title": "", "text": "Which financial year's information is shown in the table?"}
{"_id": "q1a72f7a4", "title": "", "text": "What was the percentage increase in revenue from the EMEA and Americas regions in 2019 as compared to 2018?"}
{"_id": "q1a732c38", "title": "", "text": "What is the increase / (decrease) in the Noncurrent assets from 2018 to 2019?"}
{"_id": "q1a7226bc", "title": "", "text": "What Fiscal years are included in the table?"}
{"_id": "q1a712dac", "title": "", "text": "Were any FY19 EAIP payouts reduced by the Compensation Committee?"}
{"_id": "q1a720d6c", "title": "", "text": "What is the percentage change in research and development credits, net of uncertain tax positions between 2018 and 2019?"}
{"_id": "q1a7305e6", "title": "", "text": "What was the change in amortization expense between 2017 and 2018?"}
{"_id": "q1a71f962", "title": "", "text": "What is the change in net carrying value between 2018 and 2019?"}
{"_id": "q1a715502", "title": "", "text": "How many categories of items are there in property and equipment in both 2018 and 2019?"}
{"_id": "q1a73a2da", "title": "", "text": "When will the terms of the non-returning directors end?"}
{"_id": "q1a71765e", "title": "", "text": "What are the two forms of revenue generated from contracts with customers?"}
{"_id": "q1a738c3c", "title": "", "text": "What was the change in the Tax provision (benefit) at federal statutory rate from 2018 to 2019?"}
{"_id": "q1a72c090", "title": "", "text": "What caused the Net cash used in investing activities to increase?"}
{"_id": "q1a716ee8", "title": "", "text": "What was the net income in 2019?"}
{"_id": "q1a734ab0", "title": "", "text": "What is the average Operating income for fiscal 2018 and 2017?"}
{"_id": "q1a7370f8", "title": "", "text": "What was the change in revenue in Ireland in 2019 from 2018?"}
{"_id": "q1a73e8a8", "title": "", "text": "What was the net income in 2015?"}
{"_id": "q1a73f500", "title": "", "text": "What is the average annual Ending balance of unrecognized tax benefits? "}
{"_id": "q1a73841c", "title": "", "text": "What is the average voyage revenue in 2018 and 2019?"}
{"_id": "q1a723e4a", "title": "", "text": "What was the percentage change in Cash and cash equivalents, beginning of the year from 2018 to 2019?"}
{"_id": "q1a71f4d0", "title": "", "text": "What is the average Gross Profit for Fiscal Year Ended April 28, 2018 to April 29, 2017?"}
{"_id": "q1a7236ca", "title": "", "text": "What is EBITDA?"}
{"_id": "q1a731036", "title": "", "text": "In which year was income tax benefit lower than -10,000 thousands?"}
{"_id": "q1a723972", "title": "", "text": "What was Total Revenue in 2019?"}
{"_id": "q1a716b32", "title": "", "text": "What was the income tax benefit in 2018?"}
{"_id": "q1a72d0ee", "title": "", "text": "Which year has the lowest interest income?"}
{"_id": "q1a735b7c", "title": "", "text": "Which fiscal year has the highest total number of shares purchased?"}
{"_id": "q1a71e918", "title": "", "text": "How much was the amount capitalized related to the Company’s U.S. build-to-suit facility as of March 31, 2018?"}
{"_id": "q1a711416", "title": "", "text": "What are the balances (without Adoption of Topic 606, in millions) of inventories and other accrued liabilities, respectively?"}
{"_id": "q1a719f9e", "title": "", "text": "What was the percentage change in Dividend Paid per Ordinary Share in € in 2016 from 2015?"}
{"_id": "q1a71ec1a", "title": "", "text": "What is the change in Disposals during the year from 2018 to 2019?"}
{"_id": "q1a726a00", "title": "", "text": "What are the increase in revenue from subscription and returns as well as from professional service between 2017 and 2018?"}
{"_id": "q1a72216c", "title": "", "text": "What is the average research and development expense for 2017 and 2018?"}
{"_id": "q1a72277a", "title": "", "text": "What is the difference between the Acquisition-related costs for fiscal year 2019 and 2018?"}
{"_id": "q1a72d6ac", "title": "", "text": "What is the value of the maintenance related revenue as a percentage of the total software-related revenues in 2019?"}
{"_id": "q1a73f4d8", "title": "", "text": "What is the Beginning balance of unrecognized tax benefits expressed as a percentage of Ending balance of unrecognized tax benefits for 2019?"}
{"_id": "q1a7193fa", "title": "", "text": "What was the percentage increase in the PSAs granted from 2017 to 2019?"}
{"_id": "q1a729ade", "title": "", "text": "What is the average percentage of net revenues for the period December 31, 2019 and 2018?"}
{"_id": "q1a733cb4", "title": "", "text": "What was the percentage change in the Fair value of restricted stock units vested between 2018 and 2019?"}
{"_id": "q1a71b56a", "title": "", "text": "What was the change in compensation between 2018 and 2019?"}
{"_id": "q1a71986e", "title": "", "text": "What was the Cash and cash equivalents in 2019?"}
{"_id": "q1a7230c6", "title": "", "text": "When did the company regain compliance with OTCQB?"}
{"_id": "q1a720452", "title": "", "text": "What are the investing activities that resulted in cash inflows?"}
{"_id": "q1a7386c4", "title": "", "text": "What are leasehold improvements in 2019 as a percentage of the total property equipment before depreciation, amortization and fixed assets not in service?"}
{"_id": "q1a73ca30", "title": "", "text": "In fiscal year ended June 30, 2017, what is the percentage constitution of cash remuneration among the total compensation to the Board of directors?"}
{"_id": "q1a71549e", "title": "", "text": "What is the content of Note 5?"}
{"_id": "q1a726c12", "title": "", "text": "What do non-amortizing intangible assets comprise of?"}
{"_id": "q1a71de32", "title": "", "text": "What are the components factored in total inventories?"}
{"_id": "q1a740e82", "title": "", "text": "What was the average interest cost for 2017-2019?"}
{"_id": "q1a73eb46", "title": "", "text": "In which years was Dividend and interest income calculated?"}
{"_id": "q1a73b158", "title": "", "text": "What was the cost of internally-developed software in 2019?"}
{"_id": "q1a736766", "title": "", "text": "In which year is there a greater loss for the year?"}
{"_id": "q1a7364a0", "title": "", "text": "What is the net value of the unrealized gains and losses of the company's municipal bonds?"}
{"_id": "q1a739a9c", "title": "", "text": "How many gross receivables had a total that exceeded $4,000 million?"}
{"_id": "q1a715534", "title": "", "text": "What % of the total property and equipment does \"Equipment and software\" make up in 2019, before considering depreciation?"}
{"_id": "q1a71a926", "title": "", "text": "Which year had the lowest percentage difference in basic and diluted net earnings per share?"}
{"_id": "q1a72494e", "title": "", "text": "What is the average risk-free interest rate for 2018 and 2019?"}
{"_id": "q1a71e8e6", "title": "", "text": "How much was the amount capitalized related to the Company’s U.S. build-to-suit facility as of March 31, 2019?"}
{"_id": "q1a72f2ea", "title": "", "text": "What was the change in Other liabilities in 2019 from 2018?"}
{"_id": "q1a71d16c", "title": "", "text": "When did Roper enter into a five-year $2.5 billion unsecured credit facility? "}
{"_id": "q1a71e6c0", "title": "", "text": "What was the percentage change in total revenue between 2018 and 2019?"}
{"_id": "q1a733188", "title": "", "text": "What is the change in the risk-free interest rate between 2018 and 2019?"}
{"_id": "q1a72a970", "title": "", "text": "What does the loss from discounted operations represent?"}
{"_id": "q1a720c7c", "title": "", "text": "What is the company's valuation allowance in 2018?"}
{"_id": "q1a711844", "title": "", "text": "What was the percentage change in the total expenses between 2017 and 2018?"}
{"_id": "q1a712a82", "title": "", "text": "How much is the level 1 FVOCI as at 31 December 2019?"}
{"_id": "q1a72c11c", "title": "", "text": "What was the percentage increase / (decrease) in cash from Investing activities?"}
{"_id": "q1a741ba2", "title": "", "text": "What was the percentage change in Raw materials and supplies in 2019 from 2018?"}
{"_id": "q1a736298", "title": "", "text": "What is the average annual number of shares of restricted stock outstanding for both years ended June 30, 2018 and 2019?"}
{"_id": "q1a73c1fc", "title": "", "text": "What was the interest expense in 2019?"}
{"_id": "q1a7214e2", "title": "", "text": "What is the amount of long-term deferred revenue as at 2018?"}
{"_id": "q1a741120", "title": "", "text": "What is the total non-equity incentive target amounts of all 5 NEOs in 2019?"}
{"_id": "q1a71242e", "title": "", "text": "What do the provisions for uncertain tax positions relate to?"}
{"_id": "q1a7241ba", "title": "", "text": "What was the average of 40 nanometers?"}
{"_id": "q1a72f772", "title": "", "text": "What was the total revenue that came from the hardware and cloud and license businesses in 2018?"}
{"_id": "q1a740bc6", "title": "", "text": "What was the change in Net cash provided by (used in) operating activities between 2018 and 2019?"}
{"_id": "q1a735f50", "title": "", "text": "What is the proportion of net income over gross margin of the company in 2017?"}
{"_id": "q1a72bc30", "title": "", "text": " How much did depreciation decreased by in 2019?"}
{"_id": "q1a711bdc", "title": "", "text": "What is the average annual total assets for both Fiscal years?"}
{"_id": "q1a7217d0", "title": "", "text": "How is the surcharge mechanism structured?"}
{"_id": "q1a71b59c", "title": "", "text": "What was the percentage change in Gross deferred income tax assets between 2018 and 2019?"}
{"_id": "q1a732f1c", "title": "", "text": "What is the total value of outstanding options and warrants under the Amended and Restated 2010 Share Incentive Plan? "}
{"_id": "q1a7217f8", "title": "", "text": "In which years was the gross margin calculated?"}
{"_id": "q1a72446c", "title": "", "text": "What is the percentage change for consolidated Innovation center expenditure between FY 2018 and FY 2019?"}
{"_id": "q1a73fa0a", "title": "", "text": "How many years did service revenue from APJC exceed $1,500 million?"}
{"_id": "q1a7298e0", "title": "", "text": "What is the value of the 2017 restructuring charges as a percentage of the 2017 total goodwill impairment and restructuring charges?"}
{"_id": "q1a712794", "title": "", "text": "What is the 2019 actual group operating profit expressed as a ratio of the 2019 target group operating profit?"}
{"_id": "q1a71ada4", "title": "", "text": "What was the new stapled securities issued in 2019 and 2018?"}
{"_id": "q1a71c8e8", "title": "", "text": "What is the increase in franchise rental revenues in 2019?"}
{"_id": "q1a733138", "title": "", "text": "How many warrants did the company issue altogether?"}
{"_id": "q1a71ab7e", "title": "", "text": "In which year were the Provisions for post-employment benefits plans (employer’s commitments) larger?"}
{"_id": "q1a722950", "title": "", "text": "What years are compared in the table?"}
{"_id": "q1a73bcb6", "title": "", "text": "What was the percentage change in other non-current assets between 2018 and 2019?"}
{"_id": "q1a72c144", "title": "", "text": "What was the average of cash from Financing activities?"}
{"_id": "q1a7176b8", "title": "", "text": "How much did the total licensing revenue decreased from 2018 to 2019?"}
{"_id": "q1a730fdc", "title": "", "text": "What was the % of pre-tax loss in 2019 and 2018 respectively?"}
{"_id": "q1a73240e", "title": "", "text": "What does TCE revenues represent?"}
{"_id": "q1a733458", "title": "", "text": "Which year has the highest amount of total deferred tax asset?"}
{"_id": "q1a728058", "title": "", "text": "What is the total contractual obligations that has payments due in less than 1 year?"}
{"_id": "q1a740112", "title": "", "text": "What does 'Devices sold' represent?"}
{"_id": "q1a71b4e8", "title": "", "text": "How much was Net operating loss carryforwards in 2019?"}
{"_id": "q1a7189fa", "title": "", "text": "What is the change in GST and employment taxes payable from 2018 to 2019?"}
{"_id": "q1a7412ce", "title": "", "text": "Which years does the table provide information for the company's Property, plant and equipment?"}
{"_id": "q1a734786", "title": "", "text": "What percentage of total revenues does general and administrative expenses make up for each of the 3 financial year ends (in chronological order)?"}
{"_id": "q1a73e98e", "title": "", "text": "What was the percentage change in Interest expense between 2015 and 2016?"}
{"_id": "q1a736478", "title": "", "text": "What are the respective values of the company's unrealized gains from its municipal and corporate bonds?"}
{"_id": "q1a73b126", "title": "", "text": "What was the increase in the Research and development expense in 2019?"}
{"_id": "q1a718658", "title": "", "text": "What are the respective Net recognized amounts of identifiable assets acquired and liabilities assumed at 2018 and 2019?"}
{"_id": "q1a728512", "title": "", "text": "What is the proportion of the value of finished goods over total inventories in 2019?"}
{"_id": "q1a73141e", "title": "", "text": "How much did the operating income grew in the fourth quarter on a sequential and year-over-year basis?"}
{"_id": "q1a713b58", "title": "", "text": "What was the change in the Gross profit from continuing operations, as reported between 2018 and 2019?"}
{"_id": "q1a7375e4", "title": "", "text": "What is the change in First Quarter: High price from Fiscal Year Ended April 28, 2018 to Fiscal Year Ended April 27, 2019?"}
{"_id": "q1a72be74", "title": "", "text": "What is the 2019 vs 2018 percentage change in sales and marketing expenses?"}
{"_id": "q1a718c66", "title": "", "text": "What do the diluted shares outstanding not include?"}
{"_id": "q1a733480", "title": "", "text": "What is the difference in the value of inventory between 2018 and 2019?"}
{"_id": "q1a73beb4", "title": "", "text": "What is the net change in the total valuation allowance for the 12 months ended December 31, 2019?"}
{"_id": "q1a73931c", "title": "", "text": "What do non-current assets exclude?"}
{"_id": "q1a71f282", "title": "", "text": "What was the difference in operating income in 2019 between APAC and AMER?"}
{"_id": "q1a721e9c", "title": "", "text": "What is the Allowance for returns and doubtful accounts for 2019 and 2018 respectively?"}
{"_id": "q1a72b9b0", "title": "", "text": "What was the sum of the three highest carrying value (USD) in 2018?"}
{"_id": "q1a73951a", "title": "", "text": "What are the respective accrued interest in 2018 and 2019?"}
{"_id": "q1a7121a4", "title": "", "text": "What information does note 3 provide?"}
{"_id": "q1a71870c", "title": "", "text": "What is the percentage change in equipment notes payable between 2018 and 2019?"}
{"_id": "q1a714c74", "title": "", "text": "What is the average revenue from Europe in 2018 and 2019?"}
{"_id": "q1a719c24", "title": "", "text": " Which year does the information in the table relate to?"}
{"_id": "q1a7159e4", "title": "", "text": "What is the total stock-based compensation expense and unrecognized stock-based compensation expense in 2019?"}
{"_id": "q1a713eaa", "title": "", "text": "What is the change in Weighted average common shares, basic between December 31, 2018 and 2019?"}
{"_id": "q1a72bef6", "title": "", "text": "What is the average sales and marketing expenses for 2018 and 2019?"}
{"_id": "q1a72ce28", "title": "", "text": "Where are the impairment charges related to prepaid licenses and production tooling included under?"}
{"_id": "q1a73ff3c", "title": "", "text": "What is the percentage of depreciation and amortisation in EBITDA during F19?"}
{"_id": "q1a722b44", "title": "", "text": "What led to decrease in gross profit percentage for the year ended December 31, 2019?"}
{"_id": "q1a71683a", "title": "", "text": "What does the deferred income taxes reflect?"}
{"_id": "q1a71a8cc", "title": "", "text": "For what years is information on earnings per share available?"}
{"_id": "q1a712488", "title": "", "text": "What is the change in balance between 2018 and 2019 at January 1?"}
{"_id": "q1a71968e", "title": "", "text": "In which year was the share of net (losses)/earnings in other affiliates higher?"}
{"_id": "q1a720952", "title": "", "text": "How much was the Total compensation expense related to performance-based, service-based, and market-based RSUs for the year ended December 31, 2019?"}
{"_id": "q1a725efc", "title": "", "text": "What is the average current portion of deferred revenue in 2018 and 2019?"}
{"_id": "q1a7253b2", "title": "", "text": "What is the average Total charges for the 3 years?"}
{"_id": "q1a7126ae", "title": "", "text": "What do the figures in the table exclude?"}
{"_id": "q1a7395a6", "title": "", "text": "What is the total accrued liabilities in 2018 and 2019?"}
{"_id": "q1a731eb4", "title": "", "text": "When does each fiscal year end?"}
{"_id": "q1a73b9d2", "title": "", "text": "Which year had a larger amount of restricted stock and restricted stock unit awards granted?"}
{"_id": "q1a7198fa", "title": "", "text": "What was the change in restricted cash between 2018 and 2019?"}
{"_id": "q1a72f7d6", "title": "", "text": "Why was the total operating expense higher in fiscal 2019 as compared to fiscal 2018?"}
{"_id": "q1a71d46e", "title": "", "text": "Which years does the table provide information for the changes in the components of accumulated other comprehensive income (AOCI)?"}
{"_id": "q1a71f6b0", "title": "", "text": "What is the amount of tax paid in 2019?"}
{"_id": "q1a71a69c", "title": "", "text": "What was the change in the provision for doubtful receivables between 2018 and 2019?"}
{"_id": "q1a73a38e", "title": "", "text": "What is the average amount of total compensation for each non-returning director?"}
{"_id": "q1a7195f8", "title": "", "text": "In which years was the equity in net earnings of affiliates recorded for?"}
{"_id": "q1a71b13c", "title": "", "text": "What was the reason for the increase in General and administrative expenses?"}
{"_id": "q1a729dc2", "title": "", "text": "What is the ratio of total revenue in 2018 to 2017?"}
{"_id": "q1a71fb2e", "title": "", "text": "Why was there an increase in accrued revenue from 2018 to 2019?"}
{"_id": "q1a717e24", "title": "", "text": "What was the average total employee expenditure across 2018 and 2019?"}
{"_id": "q1a721f00", "title": "", "text": "How much of the note receivable related to the sale of a product line in 2005 has been received by the company so far?"}
{"_id": "q1a7418a0", "title": "", "text": "What was the percentage change in the retail satellite TV net customer losses from 2018 to 2019?"}
{"_id": "q1a718680", "title": "", "text": "What are the respective equipment notes payable at 2018 and 2019?"}
{"_id": "q1a721f5a", "title": "", "text": "What was the percentage change in Gross accounts receivables from 2018 to 2019?"}
{"_id": "q1a716416", "title": "", "text": "What was the difference between the target allocations of Debt Securities and Other assets in 2020?"}
{"_id": "q1a71c988", "title": "", "text": "What is the difference in the total franchise revenues between 2018 and 2019?"}
{"_id": "q1a72958e", "title": "", "text": "What is the schedule of repayment of the loan?"}
{"_id": "q1a715728", "title": "", "text": "What does sales related reserves represent?"}
{"_id": "q1a71f73c", "title": "", "text": "What was the change in free cash flow?"}
{"_id": "q1a71efb2", "title": "", "text": "In which year was AMT credit less than 10 thousands?"}
{"_id": "q1a72b226", "title": "", "text": "What was the percentage change in Webzone in 2019 from 2018?"}
{"_id": "q1a716934", "title": "", "text": "What was the change in the Other non-current deferred tax assets from 2018 to 2019?"}
{"_id": "q1a73d5c0", "title": "", "text": "What is the total ordinary shares balance on 30 June 2018?"}
{"_id": "q1a72a2fe", "title": "", "text": "What is the increase / (decrease) in the Others from 2017 to 2018?"}
{"_id": "q1a721550", "title": "", "text": "What is applied for incremental costs incurred in obtaining a contract?"}
{"_id": "q1a73406a", "title": "", "text": "What percentage of total Micron shareholders' equity contributing to total equity in 2019?"}
{"_id": "q1a73edf8", "title": "", "text": "What was the percentage change in Pro forma revenues between 2018 and 2019?"}
{"_id": "q1a720074", "title": "", "text": "What was the change in Net profit/(loss) for the year excluding impairment in 2019 from 2018?"}
{"_id": "q1a729822", "title": "", "text": "What are the restructuring charges incurred in 2018 and 2017 respectively?"}
{"_id": "q1a724386", "title": "", "text": "What does the table show?"}
{"_id": "q1a721cf8", "title": "", "text": "What is the percentage change in the cash and short-term marketable securities from 2018 to 2019?"}
{"_id": "q1a7351f4", "title": "", "text": "What was the change in the Proceeds from issuance of shares between 2017 and 2018?"}
{"_id": "q1a71e134", "title": "", "text": "What is the percentage change of net increase in cash, cash equivalents, and restricted cash from 2018 to 2019?"}
{"_id": "q1a73d624", "title": "", "text": "What are the dates that shares were issued?"}
{"_id": "q1a7316bc", "title": "", "text": "In which year was the revenue which the Group will recognise when it satisfies the remaining performance obligations in the contracts larger?"}
{"_id": "q1a72a6e6", "title": "", "text": "What were the billed trade receivables in 2019?"}
{"_id": "q1a734cf4", "title": "", "text": "In what situations can the tax rate fluctuate?"}
{"_id": "q1a7295ca", "title": "", "text": "What is the Loans due from subsidiaries - non-current portion for 2018 and 2019 respectively?"}
{"_id": "q1a73cf44", "title": "", "text": "What is the percentage change in the net loss between 2018 and 2019?"}
{"_id": "q1a72650a", "title": "", "text": "What is the percentage change in income from Foreign countries between 2018 and 2019?"}
{"_id": "q1a73f1f4", "title": "", "text": "What led to the increase in Depreciation and amortization expense?"}
{"_id": "q1a7157be", "title": "", "text": "How many years did Accrued expenses and other liabilities exceed $200 million?"}
{"_id": "q1a72e520", "title": "", "text": "What is the increase in amortization of intangible assets between 2018 and 2019"}
{"_id": "q1a727ce8", "title": "", "text": "What are the two reportable segments of operations?"}
{"_id": "q1a739150", "title": "", "text": "In which regions is information of the accumulated benefit obligation provided?"}
{"_id": "q1a734d4e", "title": "", "text": "In which year was the total deferred tax assets larger?"}
{"_id": "q1a711baa", "title": "", "text": "What are the Fiscal years included in the table?"}
{"_id": "q1a728b5c", "title": "", "text": "What was the revenue from Security in 2018?"}
{"_id": "q1a714440", "title": "", "text": "What was the amount of government grants included within payments received on account in 2018?"}
{"_id": "q1a71d554", "title": "", "text": "What was the percentage change in the total balance between 2017 and 2018?"}
{"_id": "q1a73690a", "title": "", "text": "What was the amount of Other assets in 2018?"}
{"_id": "q1a713784", "title": "", "text": "What was the total Other purchase obligations and commitments?"}
{"_id": "q1a71a958", "title": "", "text": "What is the change in Net earnings from operations from 2018 to 2019?"}
{"_id": "q1a73a334", "title": "", "text": "Which non-returning director has the lowest amount of total compensation?"}
{"_id": "q1a71546c", "title": "", "text": "Which years information are included in this note on net property and equipment?"}
{"_id": "q1a72a4b6", "title": "", "text": "Which assets had non-material adjusted carrying values?"}
{"_id": "q1a73cc7e", "title": "", "text": "What is the difference in warranty reserve from beginning to end of 2017"}
{"_id": "q1a7141b6", "title": "", "text": "What was the percentage change in share of net earnings in other affiliates between 2018 and 2017?"}
{"_id": "q1a728364", "title": "", "text": "What was the change in the Amortization of purchased intangible assets between 2017 and 2018?"}
{"_id": "q1a714738", "title": "", "text": "What was the change in domestic pretax income between 2018 and 2017?"}
{"_id": "q1a72c0ea", "title": "", "text": "What was the increase / (decrease) in cash from operating activities from 2018 to 2019?"}
{"_id": "q1a73e628", "title": "", "text": "What was the change in Other financial income in  2018/2019 from 2017/2018?"}
{"_id": "q1a73433a", "title": "", "text": "What is the proportion of investor relations and consultants over the total operating expense in 2019?"}
{"_id": "q1a737a4e", "title": "", "text": "What is the average total operating expenses for 2017 and 2018?"}
{"_id": "q1a731504", "title": "", "text": "What is the increase/ (decrease) in Operating income from the period December 31, 2018 to 2019?"}
{"_id": "q1a73ce90", "title": "", "text": "What are the respective net loss in 2018 and 2019?"}
{"_id": "q1a71cb72", "title": "", "text": "What is the cost of living indexation rate applicable to?"}
{"_id": "q1a73e34e", "title": "", "text": "What is the percentage change in segment operating income from Activision between 2018 and 2019?"}
{"_id": "q1a72775c", "title": "", "text": "What is the amount of total commission as a percentage of the Ceiling as per Section 198 of the Companies Act?"}
{"_id": "q1a7223d8", "title": "", "text": "What is the total operating leases due for payment?"}
{"_id": "q1a729a20", "title": "", "text": "How much was the net income in the fourth quarter, 2019?"}
{"_id": "q1a73709e", "title": "", "text": "What are the geographic areas in the table making up the total revenue?"}
{"_id": "q1a728080", "title": "", "text": "What do the contributions beyond fiscal 2019 depend on?"}
{"_id": "q1a72b9d8", "title": "", "text": "For South African Credit Facility, Colombian Credit Facility and Brazil Credit Facility, which credit facility has the greatest Carrying Value (USD) at 2019?"}
{"_id": "q1a734312", "title": "", "text": "What is the percentage change in salaries, wages, and benefits expense in 2019 compared to 2018?"}
{"_id": "q1a711484", "title": "", "text": "What is the percentage change of the balance of inventories after being adjusted?"}
{"_id": "q1a715d5e", "title": "", "text": "What is the percentage change in the deferred tax assets of accrued expenses as well as federal credits of 2019 compared to 2018?"}
{"_id": "q1a72a02e", "title": "", "text": "What is the difference in the number of BCE retail subscribers between Wireless and High-speed Internet in 2018?"}
{"_id": "q1a7308c0", "title": "", "text": "What was the reason for the year-on-year change for revenues from the Online Advertising Business?"}
{"_id": "q1a72b3e8", "title": "", "text": "In which year was the amount at 1 January larger?"}
{"_id": "q1a7330d4", "title": "", "text": "How does the company derive the dividend yield?"}
{"_id": "q1a73b7b6", "title": "", "text": "What was the percentage change in the Standby letters of credit between 2018 and 2019?"}
{"_id": "q1a71da18", "title": "", "text": "What was the percentage change in personnel expenses in 2018/2019 from 2017/2018?"}
{"_id": "q1a73ca08", "title": "", "text": "What is the difference in cash remuneration to Board of directors between fiscal years ended June 30, 2018 and 2019?"}
{"_id": "q1a73c9ae", "title": "", "text": "What is the share-based payments for the Board of directors in fiscal years ended June 30, 2017, 2018 and 2019 respectively?"}
{"_id": "q1a73ac94", "title": "", "text": "What was the change in inventories of work in progress between 2018 and 2019?"}
{"_id": "q1a7206dc", "title": "", "text": "What is the Share Incentive Plan ('SIP')?"}
{"_id": "q1a720484", "title": "", "text": "What is the net change in cash and cash equivalents in 2019?"}
{"_id": "q1a73ba22", "title": "", "text": "What is the percentage change in the number of non-vested shares in 2019 from 2018?"}
{"_id": "q1a730b04", "title": "", "text": "What are the company's respective land value in 2018 and 2019?"}
{"_id": "q1a737616", "title": "", "text": "What is the change in Second Quarter: High price from Fiscal Year Ended April 28, 2018 to Fiscal Year Ended April 27, 2019?"}
{"_id": "q1a739d44", "title": "", "text": "What are the time periods for the obligations for the company?"}
{"_id": "q1a740b6c", "title": "", "text": "What was the Net cash (used in) provided by investing activities in 2018?"}
{"_id": "q1a73d0ac", "title": "", "text": "What was the cash and cash equivalents in 2018?"}
{"_id": "q1a73e2f4", "title": "", "text": "What was the segment operating income of Blizzard in 2018?"}
{"_id": "q1a729d04", "title": "", "text": "What does the table show?"}
{"_id": "q1a71a6c4", "title": "", "text": "What was the percentage change in net accounts receivables between 2018 and 2019?"}
{"_id": "q1a741634", "title": "", "text": "What is the average number of shares owned by L. Gordon Crovitz and Donald P. Hutchison? "}
{"_id": "q1a72219e", "title": "", "text": "In which year was research and development expense less than 40,000 thousands?"}
{"_id": "q1a7297f0", "title": "", "text": "What are the goodwill impairment charges recorded respectively in 2017 and 2018?"}
{"_id": "q1a71dcc0", "title": "", "text": "What was the increase / (decrease) in the Asia Pacific revenue from 2018 to 2019?"}
{"_id": "q1a73d0de", "title": "", "text": "What was total liquidity in 2018?"}
{"_id": "q1a71e440", "title": "", "text": "What was the the percentage change in the high price per share in the second quarter between 2018 and 2019?"}
{"_id": "q1a7272de", "title": "", "text": "What is the total fair value of money market funds as at June 30, 2019"}
{"_id": "q1a73cc4c", "title": "", "text": "What is the percentage change in provisions made to warranty reserve during the period from 2018 to 2019?"}
{"_id": "q1a72bca8", "title": "", "text": "What is the company's total cost of revenues in 2018 and 2019?"}
{"_id": "q1a73e934", "title": "", "text": "How many years did net income exceed $1,000 million?"}
{"_id": "q1a7246d8", "title": "", "text": "What is the difference between the net income per share between basic and diluted shares in 2018?"}
{"_id": "q1a717d3e", "title": "", "text": "What does shareholder distributions - dividends in the table represent?"}
{"_id": "q1a719f12", "title": "", "text": "In which years is the Annual Dividends Paid and Proposed provided?"}
{"_id": "q1a737120", "title": "", "text": "What was the percentage change in revenue in Ireland in 2019 from 2018?"}
{"_id": "q1a728544", "title": "", "text": "What is the average value of raw materials and finished goods in 2018?"}
{"_id": "q1a7239cc", "title": "", "text": "What was the change in Professional services revenue between 2018 and 2019?"}
{"_id": "q1a728896", "title": "", "text": "What led to increase in media revenue in 2018?"}
{"_id": "q1a73db1a", "title": "", "text": "Which IFRS standard(s) did the Group adopt?"}
{"_id": "q1a72cc70", "title": "", "text": "What was the increase / (decrease) in the performance shares from 2018 to 2019?"}
{"_id": "q1a717da2", "title": "", "text": "What are the components in the table during the analysis of the relative importance of spend on pay?"}
{"_id": "q1a7163a8", "title": "", "text": "Which years did the percentage of plan assets for Debt Securities exceed 80% for 2018 and 2019?"}
{"_id": "q1a7316ee", "title": "", "text": "What was the change in the amount for contracts within one year?"}
{"_id": "q1a730c08", "title": "", "text": "What is the difference in the company's net owned property and equipment between 2018 and 2019?"}
{"_id": "q1a720f9c", "title": "", "text": "What information does the table show?"}
{"_id": "q1a71a444", "title": "", "text": "How many years did net sales exceed $200,000 thousand?"}
{"_id": "q1a718c3e", "title": "", "text": "How is the diluted net income per share computed?"}
{"_id": "q1a72ad62", "title": "", "text": "What was the percentage change in Rest of World in 2019 from 2018?"}
{"_id": "q1a71dc66", "title": "", "text": "What was the average total revenue?"}
{"_id": "q1a721f28", "title": "", "text": "What is the change in net Receivables between 2018 and 2019?"}
{"_id": "q1a71834c", "title": "", "text": "What are the capital expenditures for Bell Media in 2018 and 2019?"}
{"_id": "q1a71abce", "title": "", "text": "What was the percentage change in Provisions for post-employment benefits plans (employer’s commitments) in FY2019 from FY2018?"}
{"_id": "q1a739f92", "title": "", "text": "What was the total revenue in 2017?"}
{"_id": "q1a730b36", "title": "", "text": "What are the company's respective warehouse equipment value in 2018 and 2019?"}
{"_id": "q1a71bce0", "title": "", "text": "What was the Expected long-term return on plan assets assumption used in calculating net periodic benefit cost based on?"}
{"_id": "q1a72243c", "title": "", "text": "What does the table provide data for?"}
{"_id": "q1a7230f8", "title": "", "text": "What is the closing price in March, 2020"}
{"_id": "q1a71e940", "title": "", "text": "How much was the amount capitalized related to the Company’s  U.K. build-to-suit facility as of March 31, 2018?"}
{"_id": "q1a721ece", "title": "", "text": "What is the net receivables for 2019 and 2018 respectively?"}
{"_id": "q1a71a3e0", "title": "", "text": "How much did segment operating income change between 2017 and 2018?"}
{"_id": "q1a734038", "title": "", "text": "What is the gross profit margin of the company in 2015?"}
{"_id": "q1a715192", "title": "", "text": "How is Basic earnings per share, or EPS calculated?"}
{"_id": "q1a728d78", "title": "", "text": "What are the raw materials used in the manufacturing of products?"}
{"_id": "q1a7345e2", "title": "", "text": "What was the percentage change in the fair value of plan assets between 2018 and 2019?"}
{"_id": "q1a74160c", "title": "", "text": "What are the number of shares beneficially owned by Daina Middleton and Wister Walcott respectively?"}
{"_id": "q1a73af3c", "title": "", "text": "How many factors were there that gave rise to Deferred tax assets in 2018?"}
{"_id": "q1a7319a0", "title": "", "text": "Which product sales segment had the smallest percentage change from 2018 to 2019?"}
{"_id": "q1a731298", "title": "", "text": "What was long-term prepaid ground rent as a percentage of notes receivable and other non-current assets in 2018?"}
{"_id": "q1a7248f4", "title": "", "text": "What is the average expected volatility for 2018 and 2019?"}
{"_id": "q1a7165ce", "title": "", "text": "How are debts which are known to be uncollectable written off?"}
{"_id": "q1a713e50", "title": "", "text": "How much was the restricted stock awards excluded from the computation of diluted earnings per share for the fiscal year ended 2018?"}
{"_id": "q1a736ec8", "title": "", "text": "What is the change in Other components of net periodic benefit cost from 2018 to 2019?"}
{"_id": "q1a737a76", "title": "", "text": "What is the change in the average total operating expenses between 2017-2018 and 2018-2019?"}
{"_id": "q1a713306", "title": "", "text": "What is the definition of deferred revenues?"}
{"_id": "q1a714922", "title": "", "text": "What was the valuation of the leased equipment as part of the finance lease agreements that the company entered on December 31, 2019?"}
{"_id": "q1a72bc80", "title": "", "text": "What is the company's average cost of revenues in 2018 and 2019?"}
{"_id": "q1a73954c", "title": "", "text": "What are the respective accrued expense in 2018 and 2019?"}
{"_id": "q1a71a3a4", "title": "", "text": "How much did net sales change between 2017 and 2018?"}
{"_id": "q1a732c60", "title": "", "text": "What is the average Long-term debt?"}
{"_id": "q1a714c1a", "title": "", "text": "What is the respective revenue from North America in 2018 and 2019?"}
{"_id": "q1a7202d6", "title": "", "text": "What was the percentage change in Other in FY2019 from FY2018?"}
{"_id": "q1a72833c", "title": "", "text": "What was the change in cost of sales between 2017 and 2018?"}
{"_id": "q1a72525e", "title": "", "text": "What is the Total charges for Year 2019?"}
{"_id": "q1a736bf8", "title": "", "text": "What is the percentage change of net derivative gains (losses) allocated to Grocery & Snacks from the fiscal year 2017 to 2018?"}
{"_id": "q1a72900c", "title": "", "text": "What is the change in Land and improvements from 2018 to 2019?"}
{"_id": "q1a725ce0", "title": "", "text": "What is the change in costs of Online Advertising revenue between the fourth quarter of 2018 and 2019?"}
{"_id": "q1a734fd8", "title": "", "text": "What is the average year-on-year change in Weighted average grant date fair value from 2017 to 2019? "}
{"_id": "q1a739380", "title": "", "text": "Where are the operating segments for non-current assets in the table?"}
{"_id": "q1a73b96e", "title": "", "text": "How was the award fair value calculated for wards having both service and market conditions?"}
{"_id": "q1a72d300", "title": "", "text": "What does the charge for the year include?"}
{"_id": "q1a71cbfe", "title": "", "text": "Based on the post-employment benefit obligations, which year recorded a longer life expectancy at age 65?"}
{"_id": "q1a71d4d2", "title": "", "text": "What was the Minimum Pension Liability balance in 2018?"}
{"_id": "q1a736b9e", "title": "", "text": "What is the cumulative amount of net derivative gains from economic hedges that had been recognized in general corporate expenses but not yet allocated to reporting segments?"}
{"_id": "q1a7243e0", "title": "", "text": "Where do the R&D centers operate in India?"}
{"_id": "q1a7410c6", "title": "", "text": "What is the non-equity incentive target amount for Barry Litwin and Thomas Clark respectively?"}
{"_id": "q1a715264", "title": "", "text": "What was the respective Weighted average common shares outstanding—basic in 2019, 2018 and 2017?"}
{"_id": "q1a736216", "title": "", "text": "What is the total number of shares as of June 30, 2018 and 2019 respectively?"}
{"_id": "q1a7123e8", "title": "", "text": "Which periods are state income tax returns subject to examination?"}
{"_id": "q1a71d202", "title": "", "text": "What is the percentage change in total long-term debt in 2019 compared to 2018?"}
{"_id": "q1a718c0c", "title": "", "text": "How is the basic net income per share computed?"}
{"_id": "q1a73733c", "title": "", "text": "Why did currency translation losses increase?"}
{"_id": "q1a71273a", "title": "", "text": "How many remuneration key performance indicators used Annual Incentive Plan as the remuneration measure?"}
{"_id": "q1a73ac08", "title": "", "text": "What were the inventories of work in progress in 2018?"}
{"_id": "q1a72dddc", "title": "", "text": "Which periods does the table provide information for total contractual obligations as of August 31, 2019?"}
{"_id": "q1a71578c", "title": "", "text": "Which years does the table provide information for the company's accrued liabilities?"}
{"_id": "q1a728f80", "title": "", "text": "What does the table represent?"}
{"_id": "q1a732eea", "title": "", "text": "What proportion of the Number of Shares to be Issued Upon Exercise of Outstanding Options, Warrants and Rights are shares from the 2001 share incentive plan?"}
{"_id": "q1a717dca", "title": "", "text": "In which year was Total employee expenditure larger?"}
{"_id": "q1a72bbfe", "title": "", "text": "What is the cost of revenues for 2019 and 2018 respectively?"}
{"_id": "q1a73a30c", "title": "", "text": "What does \"All Other Compensation\" include payments related to?"}
{"_id": "q1a713810", "title": "", "text": "What was the total contractual obligations due more than 5 years as a percentage of total contractual obligations?"}
{"_id": "q1a740eaa", "title": "", "text": "What was the average net actuarial loss for 2017-2019?"}
{"_id": "q1a71cbd6", "title": "", "text": "Within which areas is an annual increase in healthcare costs assumed? "}
{"_id": "q1a725380", "title": "", "text": "What is the Restructuring charges for 2019 expressed as a percentage of Total charges for the year?"}
{"_id": "q1a7368e2", "title": "", "text": "What were the deferred tax assets in 2019?"}
{"_id": "q1a7311d0", "title": "", "text": "What were note receivables in 2019?"}
{"_id": "q1a73cec2", "title": "", "text": "What are the respective basic weighted average common shares outstanding in 2018 and 2019?"}
{"_id": "q1a7364d2", "title": "", "text": "What is the value of the amortized costs of  the municipal bonds as a percentage of the total amortized cost?"}
{"_id": "q1a71d52c", "title": "", "text": "How many years did the balance Unrealized Holding Gains Available-for-sale Securities exceed $1 million? "}
{"_id": "q1a737c9c", "title": "", "text": "What was the Sales to foreign and domestic distributors in 2019?"}
{"_id": "q1a73c74c", "title": "", "text": "What is the Total Bell Wireless revenues in 2018 and 2019?"}
{"_id": "q1a7373e6", "title": "", "text": "What is the value of total assets, if you were only given the values of total liabilities and total equity in 2019."}
{"_id": "q1a71792e", "title": "", "text": "What was the change in software services between 2017 and 2018?"}
{"_id": "q1a723b5c", "title": "", "text": "What was the domestic income before income taxes in 2019?"}
{"_id": "q1a7259a2", "title": "", "text": "Was the change in group share of associates' profits from 2018 to 2019 more significant pre-tax or post-tax?"}
{"_id": "q1a715db8", "title": "", "text": "What is the total net deferred taxes for assets and liabilities from 2018 to 2019?"}
{"_id": "q1a72fb0a", "title": "", "text": "What was the interest expense on bonds and realized loss on CCSs in 2019?"}
{"_id": "q1a72b97e", "title": "", "text": "What was the change in the carrying value (USD) of South African Credit Facility between 2019 and 2018?"}
{"_id": "q1a73060e", "title": "", "text": "What was the percentage change in impairment losses between 2017 and 2018?"}
{"_id": "q1a7408e2", "title": "", "text": "What is the increase / (decrease) in the total debt?"}
{"_id": "q1a7321c0", "title": "", "text": "What is the excluded potential common shares for 2018?"}
{"_id": "q1a71add6", "title": "", "text": "What was the Issued and paid up capital in 2019?"}
{"_id": "q1a7137de", "title": "", "text": "What was the total Term Loan Facility as a percentage of total contractual obligations?"}
{"_id": "q1a731b8a", "title": "", "text": "What was the amount of Repurchases in 2018?"}
{"_id": "q1a722752", "title": "", "text": "What is the difference between the total charges for fiscal year 2019 to 2018?"}
{"_id": "q1a73ce5e", "title": "", "text": "What are the respective net loss in 2017 and 2018?"}
{"_id": "q1a7209c0", "title": "", "text": "How are the expenses recognized for RSUs with performance criteria?"}
{"_id": "q1a7152b4", "title": "", "text": "What was the basic net loss per share in 2019?"}
{"_id": "q1a72d0c6", "title": "", "text": "What was the reason for the change in other income from 2018 to 2019?"}
{"_id": "q1a736450", "title": "", "text": "What are the respective values of the company's fair value municipal and corporate bonds?"}
{"_id": "q1a72d94a", "title": "", "text": "What was the percentage change in the net total between 2018 and 2019?"}
{"_id": "q1a721c12", "title": "", "text": "What caused the increase in cash flows during the year ended December 31, 2019?"}
{"_id": "q1a71b7ae", "title": "", "text": "Which was the year that performed the worst in terms of net operating cash?"}
{"_id": "q1a7151c4", "title": "", "text": "What is the average Numerator: Net loss for the year ended December 31, 2019 to 2018?"}
{"_id": "q1a73cb98", "title": "", "text": "What are 3 factors that can affect warranty obligation?"}
{"_id": "q1a73e376", "title": "", "text": "What is the difference in segment operating income between Activision and Blizzard in 2017?"}
{"_id": "q1a71de00", "title": "", "text": "How are inventories stated?"}
{"_id": "q1a71bd9e", "title": "", "text": "What was the percentage change in the net periodic benefit cost rate of compensation increase between 2017 and 2018?"}
{"_id": "q1a73249a", "title": "", "text": "What is the change in Shipping revenues from Years Ended December 31, 2018 to 2019?"}
{"_id": "q1a71e04e", "title": "", "text": "How much decrease in receivables of operating activities due to a lower level of net sales in 2019?"}
{"_id": "q1a741db4", "title": "", "text": "How is Diluted earnings per share computed?"}
{"_id": "q1a72e660", "title": "", "text": "What proportion of the total cost does the acquisition related cost form part of in 2019?"}
{"_id": "q1a714e86", "title": "", "text": "How does a non-employee director receive his/her restricted stock unit award or option grant?"}
{"_id": "q1a7267a8", "title": "", "text": "What is the average total bookings for 2018 and 2019?"}
{"_id": "q1a712e38", "title": "", "text": "What is the NEOs' average salary?"}
{"_id": "q1a73f4a6", "title": "", "text": "What is the difference between the Ending balance of unrecognized tax benefits of 2019 against 2017?"}
{"_id": "q1a725f2e", "title": "", "text": "What is the percentage change in the payroll and benefits in 2018 and 2019?"}
{"_id": "q1a734754", "title": "", "text": "How much is the general and administrative expenses for the 3 financial years shown in the table (in chronological order)?"}
{"_id": "q1a71ebf2", "title": "", "text": "What is the change in Item reclassified from freehold investment property from 2018 to 2019?"}
{"_id": "q1a71a41c", "title": "", "text": "What was the amount of net sales in 2017?"}
{"_id": "q1a726802", "title": "", "text": "What is the change in the average total bookings between 2017-2018, and 2018-2019?"}
{"_id": "q1a71ef58", "title": "", "text": "What was the lease liability in 2019 and 2018?"}
{"_id": "q1a73b78e", "title": "", "text": "What was the change in Balance outstanding between 2018 and 2019?"}
{"_id": "q1a73b1bc", "title": "", "text": "What was the average Research and development expense for 2018 and 2019?"}
{"_id": "q1a716178", "title": "", "text": "What is the change in operating income between fiscal years 2019 and 2018?"}
{"_id": "q1a71b51a", "title": "", "text": "How much was Net operating loss carryforwards in 2018?"}
{"_id": "q1a73f9d8", "title": "", "text": "What was the change in service revenue from EMEA between 2017 and 2018?"}
{"_id": "q1a737396", "title": "", "text": "What is the % change in total equity from 2018 to 2019?"}
{"_id": "q1a729a84", "title": "", "text": "How much was the net income in the third quarter, 2019?"}
{"_id": "q1a7240fc", "title": "", "text": "In which year were the 65-nanometer technology introduced by the company?"}
{"_id": "q1a721528", "title": "", "text": "What are the types of revenue in the table?"}
{"_id": "q1a72be9c", "title": "", "text": "Between year ended 2018 and 2019, which year had a higher sales and marketing expense?"}
{"_id": "q1a726a50", "title": "", "text": "What is the total revenue earned in both 2017 and 2018?"}
{"_id": "q1a73515e", "title": "", "text": "Which years does the table provide information for activity related to the purchase rights issued under the ESPP?"}
{"_id": "q1a71baa6", "title": "", "text": "What was the total amount spent on restructuring expenses across 2018 and 2019?"}
{"_id": "q1a7224be", "title": "", "text": "What is the total purchasing obligations due?"}
{"_id": "q1a716f42", "title": "", "text": "How many years did the total adjustments exceed $50,000 thousand?"}
{"_id": "q1a72f07e", "title": "", "text": "What was the change in Weighted average number of shares—basic between 2017 and 2018?"}
{"_id": "q1a7165f6", "title": "", "text": "What is the percentage change in total past due but not impaired receivables from 2018 to 2019?"}
{"_id": "q1a734a2e", "title": "", "text": "What was the variance in percent for Operating income from fiscal 2017 to fiscal 2018?"}
{"_id": "q1a73911e", "title": "", "text": "In which years is information of the accumulated benefit obligation provided?"}
{"_id": "q1a7198c8", "title": "", "text": "What was the change in Cash and cash equivalents between 2017 and 2018?"}
{"_id": "q1a72778e", "title": "", "text": "Which independent director had the highest commission amount?"}
{"_id": "q1a7219f6", "title": "", "text": "What was Subscriber Solutions & Experience formerly reported as by the company?"}
{"_id": "q1a72c9b4", "title": "", "text": "What was the Unlevered free cash flow in 2019?"}
{"_id": "q1a741b20", "title": "", "text": "In which years was inventories calculated?"}
{"_id": "q1a71b16e", "title": "", "text": "What was the reason for the increase in Finance costs?"}
{"_id": "q1a737a1c", "title": "", "text": "What is the average total operating expenses for 2018 and 2019?"}
{"_id": "q1a725c36", "title": "", "text": "What was the percentage increase in cost of FinTech and Business Services revenue between the fourth quarter of 2018 and 2019?"}
{"_id": "q1a73fa3c", "title": "", "text": "What was the percentage change in total service revenue between 2017 and 2018?"}
{"_id": "q1a71575a", "title": "", "text": "What were the income taxes payable in 2019?"}
{"_id": "q1a72fb64", "title": "", "text": "What was the change in lease charge from 2018 to 2019?"}
{"_id": "q1a7232ba", "title": "", "text": "How is inventories, including wireless devices and merchandise for resale measured?"}
{"_id": "q1a72317a", "title": "", "text": "What is the average stock price in the first quarter of 2020? "}
{"_id": "q1a73d12e", "title": "", "text": "What was the change in total liquidity between 2018 and 2019?"}
{"_id": "q1a721ab4", "title": "", "text": "What is the difference in total revenue between Subscriber Solutions & Experience and Traditional & Other Products?"}
{"_id": "q1a738714", "title": "", "text": "What was the change in fixed assets not yet in service from 2018 to 2019?"}
{"_id": "q1a733a20", "title": "", "text": "What was the percentage constituent of total external revenue to segment revenue?"}
{"_id": "q1a73a514", "title": "", "text": "What would have been the effect of dilutive securities for 2019 and 2018 respectively?"}
{"_id": "q1a726712", "title": "", "text": "What is the total bookings for each financial year listed, in chronological order?"}
{"_id": "q1a732e2c", "title": "", "text": "What is the company's Number of Shares to be Issued Upon Exercise of Outstanding Options?"}
{"_id": "q1a73d3c2", "title": "", "text": "What is the average customers from Singapore?"}
{"_id": "q1a719378", "title": "", "text": "What were the RSAs granted in 2019?"}
{"_id": "q1a73fc26", "title": "", "text": "What is the total FY19 NEOs' annual salary?"}
{"_id": "q1a7117ae", "title": "", "text": "What was the sales and marketing expense in 2017?"}
{"_id": "q1a721852", "title": "", "text": "What was the change in the amount of surcharge revenue from 2018 to 2019?"}
{"_id": "q1a71721c", "title": "", "text": "What is the average age of the company's Vice Presidents?"}
{"_id": "q1a73f21c", "title": "", "text": "What is the change in Personnel costs, including teammate benefits between 2018 and 2019?"}
{"_id": "q1a715a3e", "title": "", "text": "What was the percentage change in the amount of RSUs in 2019 from 2018?"}
{"_id": "q1a73fee2", "title": "", "text": "What drove the sales growth to improve in the second half?"}
{"_id": "q1a72ecdc", "title": "", "text": "What was the percentage change in the total accrued expenses between 2018 and 2019?"}
{"_id": "q1a729408", "title": "", "text": "What is the average contribution from minimally prepared chicken from fiscal years 2017 to 2019 as a percentage of net sales dollars?"}
{"_id": "q1a7220e0", "title": "", "text": "What was the increase in the research and development in 2018?"}
{"_id": "q1a73eba0", "title": "", "text": "What was the change in Dividend and interest income in 2018 from 2017?"}
{"_id": "q1a7126e0", "title": "", "text": "What was the maximum group operating profit in 2019? "}
{"_id": "q1a72eb60", "title": "", "text": "What was the accrued interest in 2018?"}
{"_id": "q1a719346", "title": "", "text": "What is the authorized common stock for issuance under the plan?"}
{"_id": "q1a71ab1a", "title": "", "text": "What are the benefits under the different plans based on?"}
{"_id": "q1a73763e", "title": "", "text": "In which quarter of 2019 was the high price greater than $40.00?"}
{"_id": "q1a71b8da", "title": "", "text": "Why was the net cash used for financing activities in 2019 $2.95 billion?"}
{"_id": "q1a7395ce", "title": "", "text": "What is the average total accrued liabilities in 2018 and 2019?"}
{"_id": "q1a739af6", "title": "", "text": "What was the total for lease receivables as a percentage of the total of all gross receivables?"}
{"_id": "q1a737990", "title": "", "text": "Which financial years' information is shown in the table?"}
{"_id": "q1a739fec", "title": "", "text": "How many years did total revenue exceed $500,000 thousand?"}
{"_id": "q1a71de64", "title": "", "text": "In which years was Inventories calculated?"}
{"_id": "q1a728bb6", "title": "", "text": "How many years did revenue from Other products exceed $1,000 million?"}
{"_id": "q1a71ae08", "title": "", "text": "What was the increase / (decrease) in the Issued and paid up capital from 2018 to 2019?"}
{"_id": "q1a729b06", "title": "", "text": "What is the increase/ (decrease) in Net income attributable to parent company from the period December 31, 2018 to 2019?"}
{"_id": "q1a738c64", "title": "", "text": "What was the average Permanent differences value for 2018 and 2019?"}
{"_id": "q1a741e68", "title": "", "text": "What is the average annual Basic earnings per share attributable to OpenText? "}
{"_id": "q1a71aba6", "title": "", "text": "What was the change in Provisions for post-employment benefits plans (employer’s commitments) in FY2019 from FY2018?"}
{"_id": "q1a7114b6", "title": "", "text": "What is the ratio of total current assets balance, as reported, to total current liabilities balance, as reported?"}
{"_id": "q1a738c96", "title": "", "text": "What was the percentage change in the Foreign rate differential from 2018 to 2019?"}
{"_id": "q1a71f3ea", "title": "", "text": "How much was the Medical segment gross profit in fiscal 2018 and 2017 respectively?"}
{"_id": "q1a71c046", "title": "", "text": "What is the difference in revenue earned from customer A and customer B in 2019?"}
{"_id": "q1a73ed9e", "title": "", "text": "What was the change in the Diluted net income attributable to American Tower Corporation common stockholders between 2018 and 2019?"}
{"_id": "q1a713df6", "title": "", "text": "How much was the incremental shares at December 31, 2019 and 2018 respectively?"}
{"_id": "q1a74040a", "title": "", "text": "What was the change in prepaid taxes from 2018 to 2019?"}
{"_id": "q1a72aefc", "title": "", "text": "What did tax related liabilities primarily include?"}
{"_id": "q1a716eb6", "title": "", "text": "Why did the company exclude certain expenses from their calculation of Adjusted EBITDA?"}
{"_id": "q1a7293d6", "title": "", "text": "What is the change in the contribution from minimally prepared chicken between fiscal years 2018 and 2019 as a percentage of net sales dollars?"}
{"_id": "q1a724ba6", "title": "", "text": "What was the percentage change in Current deferred income?"}
{"_id": "q1a721cc6", "title": "", "text": "What is the percentage change in the net cash from operation activities from 2017 to 2018?"}
{"_id": "q1a715a0c", "title": "", "text": "What was the change in the amount of stock options in 2019 from 2018?"}
{"_id": "q1a7361e4", "title": "", "text": "What does the table show?"}
{"_id": "q1a740856", "title": "", "text": "What are the financial covenants to be maintained as per the credit agreement?"}
{"_id": "q1a72d648", "title": "", "text": "What is the average software-as-a-service related revenue in 2018 and 2019?"}
{"_id": "q1a7117e0", "title": "", "text": "What was the change in the research and development expense between 2017 and 2018?"}
{"_id": "q1a73e90c", "title": "", "text": "What was the interest expense in 2019?"}
{"_id": "q1a7264e2", "title": "", "text": "What is the change in income from Foreign countries between 2018 and 2019?"}
{"_id": "q1a725ed4", "title": "", "text": "What is the total operating accruals in 2018 and 2019?"}
{"_id": "q1a733160", "title": "", "text": "What is the percentage change in exercise price between 2018 and 2019?"}
{"_id": "q1a720a1a", "title": "", "text": "What is the change in Weighted-Average Grant Date Fair Value of Nonvested shares of RSUs from year ended December 31, 2018 to 2019?"}
{"_id": "q1a729322", "title": "", "text": "What does the Registrant do?"}
{"_id": "q1a71f67e", "title": "", "text": "What is the free cash flow in 2019?"}
{"_id": "q1a71fdb8", "title": "", "text": "What was the net income attributable to VMware, Inc. in Q3 2020?"}
{"_id": "q1a72c9e6", "title": "", "text": "What components are factored in when calculating the unlevered free cash flow from the net cash flow from operating activities?"}
{"_id": "q1a724e26", "title": "", "text": "What was the average financing activities for 2018 and 2019?"}
{"_id": "q1a720740", "title": "", "text": "What are the components making up the total share-based payment charge?"}
{"_id": "q1a72efd4", "title": "", "text": "What years does the table provide data for?"}
{"_id": "q1a741e0e", "title": "", "text": "What is the difference of Basic earnings per share attributable to OpenText for fiscal year 2019 and 2018?"}
{"_id": "q1a7121fe", "title": "", "text": "In which year was the weighted average number of shares largest?"}
{"_id": "q1a72ec28", "title": "", "text": "What was the accrued running costs in 2018?"}
{"_id": "q1a73bee6", "title": "", "text": "What were the amount of pre-tax losses in 2018?"}
{"_id": "q1a737670", "title": "", "text": "What was the high price in 2019 first and second quarter respectively?"}
{"_id": "q1a740bee", "title": "", "text": "What was the change in Net (decrease) increase in cash and cash equivalents between 2017 and 2018?"}
{"_id": "q1a714c4c", "title": "", "text": "What is the average revenue from Asia Pacific in 2018 and 2019?"}
{"_id": "q1a73db7e", "title": "", "text": "What are the components factored in when calculating operating profit?"}
{"_id": "q1a72b65e", "title": "", "text": "What was the percentage change in Fair value of common stock vested in 2019 from 2018?"}
{"_id": "q1a71f25a", "title": "", "text": "How many years did the operating income from EMEA exceed $3 million?"}
{"_id": "q1a717168", "title": "", "text": "Where can the remaining information required under Item 10 concerning the executive officers of Loral as of March 12, 2020 be found?"}
{"_id": "q1a73b216", "title": "", "text": "What is the change in the % of revenue from 2018 to 2019?"}
{"_id": "q1a722112", "title": "", "text": "What was the research and development in 2018 and 2017?"}
{"_id": "q1a73af96", "title": "", "text": "Which factor contributed the most significantly to deferred tax assets?"}
{"_id": "q1a71ba4c", "title": "", "text": "How much was the average restructuring expenses in 2018 and 2019?"}
{"_id": "q1a73c6ca", "title": "", "text": "What drove the change in Bell Wireless operating revenues in 2019?"}
{"_id": "q1a72964c", "title": "", "text": "What is the percentage change in Loans due from subsidiaries - current portion from 2018 to 2019?"}
{"_id": "q1a71bf92", "title": "", "text": "Which are the  customers from which the Company derived revenues in excess of 10% of total revenues for the years ended years ended September 30, 2018 and 2019?"}
{"_id": "q1a736e14", "title": "", "text": "What was the pension and benefit charges in 2019?"}
{"_id": "q1a735258", "title": "", "text": "What was the percentage change in the Proceeds from issuance of shares between 2018 and 2019?"}
{"_id": "q1a713ac2", "title": "", "text": "What was the stock-based compensation in 2019?"}
{"_id": "q1a715200", "title": "", "text": "What is the average Denominator: Weighted average common shares outstanding—basic for the year ended December 31, 2019 to 2018?"}
{"_id": "q1a719314", "title": "", "text": "What is the number of shares to be increased under the shareholders approved amendment?"}
{"_id": "q1a723314", "title": "", "text": "What is included in the Cost of equipment sales and merchandise for resale?"}
{"_id": "q1a73c1a2", "title": "", "text": "What is the change in Interest income from, 2019 to 2018?"}
{"_id": "q1a73f424", "title": "", "text": "Where does the majority of the unrecognized tax benefit relate to?"}
{"_id": "q1a7173b6", "title": "", "text": "What was the total assets from APAC in 2019?"}
{"_id": "q1a731c0c", "title": "", "text": "How many years did the Balance at end of period exceed 30,000,000 ?"}
{"_id": "q1a7207c2", "title": "", "text": "What was the percentage change in PSP payments for the Group in 2019 from 2018?"}
{"_id": "q1a72e75a", "title": "", "text": "What is included in the acquisition related costs?"}
{"_id": "q1a716f1a", "title": "", "text": "What was the amount of amortization and depreciation expense in 2018?"}
{"_id": "q1a71983c", "title": "", "text": "What does Cash and Cash Equivalents include?"}
{"_id": "q1a71a1ce", "title": "", "text": "How many items had a % change that is less than 50%?"}
{"_id": "q1a740b9e", "title": "", "text": "What was the Net cash used in financing activities in 2019?"}
{"_id": "q1a727d4c", "title": "", "text": "What is the average Products and Licensing revenue for December 31, 2018 and 2019?"}
{"_id": "q1a719634", "title": "", "text": "What does the share of net earnings in other affiliates represent?"}
{"_id": "q1a74168e", "title": "", "text": "What is the average number of shares beneficially owned by Daina Middleton and Wister Walcott?"}
{"_id": "q1a71d22a", "title": "", "text": "What is the ratio of senior notes due 2020 and 2021 to total debt in 2019?"}
{"_id": "q1a71712c", "title": "", "text": "What are the respective age of the executive officers?"}
{"_id": "q1a726776", "title": "", "text": "Which financial years are listed in the table? (in chronological order)"}
{"_id": "q1a714ee0", "title": "", "text": "What is the ratio of Darcy Antonellis’ total compensation to David C. Habiger’s total compensation?"}
{"_id": "q1a729066", "title": "", "text": "What is the percentage difference from 2018 to 2019 for Property and equipment, net values expressed as a percentage to Accumulated depreciation and amortization?"}
{"_id": "q1a72dad0", "title": "", "text": "What are the estimated useful lives of the assets?"}
{"_id": "q1a72a524", "title": "", "text": "In which year was Property and equipment, net largest?"}
{"_id": "q1a713338", "title": "", "text": "What is the anticipated duration of useful life for the deferred software and deferred subscription-based service performance obligations to be recognised?"}
{"_id": "q1a71f930", "title": "", "text": "What is the percentage change in net carrying amount before unamortized debt issuance costs between 2018 and 2019?"}
{"_id": "q1a73f9b0", "title": "", "text": "What was the service revenue from EMEA in 2018?"}
{"_id": "q1a71b542", "title": "", "text": "What was the change in tax credits between 2018 and 2019?"}
{"_id": "q1a714986", "title": "", "text": "What was the amount of Land in 2018?"}
{"_id": "q1a714706", "title": "", "text": "What was the change in foreign pretax income between 2018 and 2019?"}
{"_id": "q1a72810c", "title": "", "text": "What is the difference in the total benefit obligations and total capital lease obligations?"}
{"_id": "q1a71f200", "title": "", "text": "What was the operating income from APAC in 2019?"}
{"_id": "q1a712460", "title": "", "text": "What does the company classify interest and penalties on uncertain tax positions as?"}
{"_id": "q1a725916", "title": "", "text": "Which associate's results was disclosed to be part of the line item \"Other associates\"?"}
{"_id": "q1a73e5ce", "title": "", "text": "What are the components that appear under Other financial income and Other financial expenses?"}
{"_id": "q1a71eb98", "title": "", "text": "Which agreement was entered by the group on 28 June 2019?"}
{"_id": "q1a73b6c6", "title": "", "text": "How did the company convert the revolving credit facility's variable rate of interest into a fixed rate on a portion of the debt?"}
{"_id": "q1a71b812", "title": "", "text": "What were the main components of net cash used for investing activities?"}
{"_id": "q1a729d90", "title": "", "text": "What is the percentage change of adjusted revenue from 2016 to 2017?"}
{"_id": "q1a73556e", "title": "", "text": "What was the revenue in the Year Ended December 31, 2019?"}
{"_id": "q1a73f014", "title": "", "text": "What was the change in Weighted average grant date stock price from 2017 to 2018?"}
{"_id": "q1a718068", "title": "", "text": "What is the percentage change in on-net APRU between 2017 and 2018? "}
{"_id": "q1a722c2a", "title": "", "text": "What was the respective gross profit in 2019 and 2018?"}
{"_id": "q1a726fa0", "title": "", "text": "What was the total purchase obligations?"}
{"_id": "q1a71b7e0", "title": "", "text": "How much was the difference in net increase(decrease) in cash and cash equivalents from 2017 to 2018? "}
{"_id": "q1a73d106", "title": "", "text": "What was the change in availability under revolving credit facility between 2018 and 2019?"}
{"_id": "q1a73ed12", "title": "", "text": "What do the pro forma results exclude?"}
{"_id": "q1a72ac9a", "title": "", "text": "What was the  Total foreign countries sales in 2018?"}
{"_id": "q1a739768", "title": "", "text": "How did the company determine the adequacy for their allowance for credit loss?"}
{"_id": "q1a7221c6", "title": "", "text": "What is the change in the % of revenue?"}
{"_id": "q1a725538", "title": "", "text": "What is the amount of capitalized interest in 2018?"}
{"_id": "q1a725c5e", "title": "", "text": "What was the percentage change in cost of Online Advertising revenue between the fourth quarter of 2018 and 2019?"}
{"_id": "q1a72a4f2", "title": "", "text": "What are the types of impairment losses under Americas in the Consolidated Statements of Operations?"}
{"_id": "q1a7130a4", "title": "", "text": "What were the acquisition and integration charges related to the company's collaboration with JJMD in Q4 Fiscal year 2019?"}
{"_id": "q1a727702", "title": "", "text": "What is the Sitting Fees for attending board/ committee meetings for V Thyagarajan?"}
{"_id": "q1a71f4f8", "title": "", "text": "What is the average Loss from Operations for Fiscal Year Ended April 28, 2018 to April 29, 2017?"}
{"_id": "q1a731c34", "title": "", "text": "What was the percentage change in the Restricted stock unit issuances between 2018 and 2019?"}
{"_id": "q1a71a142", "title": "", "text": "What is the percentage increase in CTS sales in 2019?"}
{"_id": "q1a732634", "title": "", "text": "Where is the Company's property, plant and equipment located?"}
{"_id": "q1a72aa60", "title": "", "text": "What was the average Income tax effect on discontinued operations between 2017-2019?"}
{"_id": "q1a73f19a", "title": "", "text": "How much did Selling and administrative expenses increased in 2019 compared to 2018?"}
{"_id": "q1a72feac", "title": "", "text": "In which years were components of Teradyne’s deferred tax assets (liabilities) provided?"}
{"_id": "q1a71aae8", "title": "", "text": "How are Provisions for post-employment benefits plans recognised?"}
{"_id": "q1a7236fc", "title": "", "text": "What is the increase/ (decrease) in Net income (loss) from 2018 to 2019?"}
{"_id": "q1a73fba4", "title": "", "text": "What does NEO stand for?"}
{"_id": "q1a712adc", "title": "", "text": "How much did the level 1 FVOCI change by from 2018 year end to 2019 year end?"}
{"_id": "q1a730f64", "title": "", "text": "What was the respective income tax benefits in 2019 and 2018?"}
{"_id": "q1a72b38e", "title": "", "text": "What are the government grants received for?"}
{"_id": "q1a7329ea", "title": "", "text": "What is the average cents per share during the current year interim for 2018 and 2019?"}
{"_id": "q1a7113c6", "title": "", "text": "How much was the cumulative-effect adjustment to the opening balance of fiscal 2019 retained earnings?"}
{"_id": "q1a71bdd0", "title": "", "text": "What was the percentage change in the projected benefit obligation discount rate between 2018 and 2019?"}
{"_id": "q1a725ea2", "title": "", "text": "What are the respective payroll and benefits in 2018 and 2019?"}
{"_id": "q1a7261ae", "title": "", "text": "What was the percentage change in the total compensation in 2019 from 2018?"}
{"_id": "q1a71a61a", "title": "", "text": "What was the provision for doubtful receivables in 2018?"}
{"_id": "q1a72179e", "title": "", "text": "What was the amount of gross profit in 2019?"}
{"_id": "q1a7319d2", "title": "", "text": "What is the percentage of Altium Nexus in total product sales in 2018?"}
{"_id": "q1a73f76c", "title": "", "text": "What was the percentage change in the total net property, plant and equipment between 2018 and 2019?"}
{"_id": "q1a717438", "title": "", "text": "What was the change in the total assets from APAC between 2018 and 2019?"}
{"_id": "q1a7182f2", "title": "", "text": "What is the $ change in the capital expenditures for Bell Wireless?"}
{"_id": "q1a73fbd6", "title": "", "text": "Who are the NEOs in this company?"}
{"_id": "q1a72e11a", "title": "", "text": "What was the revenue from Asia and Pacific Rim in 2018?"}
{"_id": "q1a729d36", "title": "", "text": "What is the largest cost of revenue item in Adjusted Revenue?"}
{"_id": "q1a733c00", "title": "", "text": "What was the Tax benefit for stock compensation expense in 2019?"}
{"_id": "q1a736c2a", "title": "", "text": "What are the total net derivative losses allocated to Foodservice in the fiscal year 2018 and 2019?"}
{"_id": "q1a71719a", "title": "", "text": "What are the respective ages of the company's current Vice Presidents?"}
{"_id": "q1a730370", "title": "", "text": "What was the difference in the weighted average estimated life between computer software and client relationships in years?"}
{"_id": "q1a717adc", "title": "", "text": "What does the table show?"}
{"_id": "q1a73a744", "title": "", "text": "Where is Trade accounts receivable, net, noncurrent included in?"}
{"_id": "q1a719d14", "title": "", "text": "Which type of non-cash change has the largest impact in terms of the categories of liabilities that it affects?"}
{"_id": "q1a74037e", "title": "", "text": "What are the prepaid taxes in 2019?"}
{"_id": "q1a71bfba", "title": "", "text": "What is the total accounts receivable and long term receivable from Customer B as of September 30, 2019?"}
{"_id": "q1a71336a", "title": "", "text": "What is the beginning balance as of December 31, 2019?"}
{"_id": "q1a73aa46", "title": "", "text": "What is the average stock options from 2017-2019?"}
{"_id": "q1a71580e", "title": "", "text": "What was the percentage change in total accrued liabilities between 2018 and 2019?"}
{"_id": "q1a714bb6", "title": "", "text": "What is the respective revenue from Asia Pacific in 2018 and 2019?"}
{"_id": "q1a72d094", "title": "", "text": "What accounts for the change in interest expense from 2017 to 2018?"}
{"_id": "q1a7323aa", "title": "", "text": "How much did the shipping revenues decreased during the year ended December 31, 2019 compared to 2018?"}
{"_id": "q1a72ea5c", "title": "", "text": "Which years does the table provide information for Accrued expenses and other liabilities?"}
{"_id": "q1a7178fc", "title": "", "text": "What were the data and analytic services in 2017?"}
{"_id": "q1a7193a0", "title": "", "text": "What was the increase / (decrease) in the RSAs granted from 2018 to 2019?"}
{"_id": "q1a73b9a0", "title": "", "text": "What are the types of activity involving restricted stock and restricted stock unit awards?"}
{"_id": "q1a73efec", "title": "", "text": "What was the change in the Expected volatility from 2017 to 2018?"}
{"_id": "q1a71fbe2", "title": "", "text": "What was the average accrued revenue between 2018 and 2019?"}
{"_id": "q1a73623e", "title": "", "text": "What is the amount for  Balance as of June 30, 2017?"}
{"_id": "q1a72a2d6", "title": "", "text": "What is the average of consumer in the 3 years?"}
{"_id": "q1a71fe80", "title": "", "text": "What was the change in the total revenue between Q3 and Q4  2020?"}
{"_id": "q1a71fe44", "title": "", "text": "How many quarters did Net income attributable to VMware, Inc. exceed $1,000 million in 2020?"}
{"_id": "q1a71ae6c", "title": "", "text": "In which year was Total contributed equity less than 100,000 thousands?"}
{"_id": "q1a72a47a", "title": "", "text": "How are certain assets measured under certain conditions?"}
{"_id": "q1a72f830", "title": "", "text": "When was the financial year end in 2019 and 2018?"}
{"_id": "q1a73260c", "title": "", "text": "What is the net book value of property, plant and equipment as of September 30, 2019?"}
{"_id": "q1a72d382", "title": "", "text": "What was the change in Dividend shares awarded in 2019 from 2018?"}
{"_id": "q1a72a57e", "title": "", "text": "What was the percentage change in Property and equipment, net in 2018 from 2017?"}
{"_id": "q1a72ca68", "title": "", "text": "What was the percentage change in adjusted operating profit in 2019 from 2018?"}
{"_id": "q1a72cc48", "title": "", "text": "What was the average restricted stock for 2017-2019?"}
{"_id": "q1a724b74", "title": "", "text": "What was the change in Current deferred income?"}
{"_id": "q1a719922", "title": "", "text": "What was the percentage change in Total cash, cash equivalents and restricted cash between 2018 and 2019?"}
{"_id": "q1a729a52", "title": "", "text": "What did the net income in the fourth quarter, 2019, represent?"}
{"_id": "q1a71fbba", "title": "", "text": "What was the 2019 percentage change in accrued revenue?"}
{"_id": "q1a72dbb6", "title": "", "text": "How much did the computer hardware, at cost change in 2019 compared to 2018?"}
{"_id": "q1a734d26", "title": "", "text": "What are the components are related to the Deferred income tax liabilities?"}
{"_id": "q1a741aee", "title": "", "text": "What was the effect of reductions in LIFO-valued inventories?"}
{"_id": "q1a71d996", "title": "", "text": "What are the components comprising personnel expenses in the table?"}
{"_id": "q1a73578a", "title": "", "text": "What is the difference in the operating income between 2015 and 2016?"}
{"_id": "q1a714954", "title": "", "text": "Which years does the table provide information for the company's property and equipment?"}
{"_id": "q1a711f10", "title": "", "text": "What was the average cable expenditure?"}
{"_id": "q1a73f456", "title": "", "text": "How much would the company's income tax provision decrease if recognized as of December 31, 2019?"}
{"_id": "q1a7209e8", "title": "", "text": "What is the change in the Number of Nonvested shares of RSUs from December 31, 2018 to 2019?"}
{"_id": "q1a71b1c8", "title": "", "text": "What was the profit margin for the fourth quarter of 2018?"}
{"_id": "q1a71e3aa", "title": "", "text": "What was the low price per share in the third quarter of 2018?"}
{"_id": "q1a72859e", "title": "", "text": "What does the Company use to reduce the inventory cost basis?"}
{"_id": "q1a73ac3a", "title": "", "text": "What were the inventories of Parts and raw materials in 2019?"}
{"_id": "q1a72aa2e", "title": "", "text": "What is the average Gain on sale of Netsmart between 2017-2019?"}
{"_id": "q1a7260be", "title": "", "text": "What did Key Management comprise of?"}
{"_id": "q1a718946", "title": "", "text": "When are Other payables and accruals paid?"}
{"_id": "q1a73d8ae", "title": "", "text": "What is the increase / (decrease) in Audit Fees in NT$ from 2018 to 2019?"}
{"_id": "q1a740e28", "title": "", "text": "What was the pre-tax curtailment gain in 2018?"}
{"_id": "q1a737fc6", "title": "", "text": "What is the change in Personnel-related items from 2018 to 2019?"}
{"_id": "q1a714c9c", "title": "", "text": "What is the average revenue from North America in 2018 and 2019?"}
{"_id": "q1a740dce", "title": "", "text": "What is the service cost for 2019?"}
{"_id": "q1a728fb2", "title": "", "text": "What is the change upon adoption of ASU 2016-02?"}
{"_id": "q1a731be4", "title": "", "text": "What was the change in the Balance at beginning of the year between 2018 and 2019?"}
{"_id": "q1a71dc0c", "title": "", "text": "What was the movement in Americas revenue?"}
{"_id": "q1a741ddc", "title": "", "text": "When is Common Share equivalents are excluded from the computation of diluted earnings per share excluded?"}
{"_id": "q1a72ff06", "title": "", "text": "What was the change in Other in 2019 from 2018?"}
{"_id": "q1a71cf46", "title": "", "text": "What was the percentage change in Purchases of property and equipment under finance leases, perpetual easements and capital leases between 2018 and 2019?"}
{"_id": "q1a725e7a", "title": "", "text": "What are the respective current portion of deferred revenue in 2018 and 2019?"}
{"_id": "q1a719eae", "title": "", "text": "What are the US$ values for 2015 to 2018 translated for?"}
{"_id": "q1a71bb00", "title": "", "text": "How much was the total estimated restructuring costs associated with the 2019 restructuring plan, and how much remained as of May 31, 2019?"}
{"_id": "q1a72182a", "title": "", "text": "In which year was the gross margin larger?"}
{"_id": "q1a7298ae", "title": "", "text": "What is the total goodwill impairment and restructuring charges in 2017 and 2018?"}
{"_id": "q1a72467e", "title": "", "text": "What is the percentage change in net sales from 2017 to 2018?"}
{"_id": "q1a733bd8", "title": "", "text": "What was the Tax benefit for stock compensation expense classified as within the Consolidated Statements of Operations?"}
{"_id": "q1a7140b2", "title": "", "text": "In which years was the equity in net earnings of affiliates recorded for?"}
{"_id": "q1a739d6c", "title": "", "text": "What are the components of total contractual obligations that are more than 100,000?"}
{"_id": "q1a72ca40", "title": "", "text": "What was the change in adjusted operating profit in 2019 from 2018?"}
{"_id": "q1a711b3c", "title": "", "text": "What does the table show?"}
{"_id": "q1a72db34", "title": "", "text": "What kind of computer software costs are immediately expensed?"}
{"_id": "q1a72d120", "title": "", "text": "What was the percentage change in interest expense from 2018 to 2019?"}
{"_id": "q1a72d148", "title": "", "text": "What was the change in other, net from 2018 to 2019?"}
{"_id": "q1a714eae", "title": "", "text": "How much are the total compensations for Richard S. Hill and Christopher A. Seams, respectively?"}
{"_id": "q1a73436c", "title": "", "text": "What is the ratio of integration incentives expense in 2019 to 2018?"}
{"_id": "q1a73d340", "title": "", "text": "Top ten customers account for what percentage of total operating revenues in 2019?"}
{"_id": "q1a7336a6", "title": "", "text": "What does the company's liability for uncertain tax positions refer to?"}
{"_id": "q1a72d5bc", "title": "", "text": "What are the respective software-as-a-service related revenue in 2018 and 2019?"}
{"_id": "q1a726122", "title": "", "text": "What are the types of key management compensation in the table?"}
{"_id": "q1a716b64", "title": "", "text": "What was the income tax benefit in 2019?"}
{"_id": "q1a71debe", "title": "", "text": "What was the change in Finished goods from 2018 to 2019?"}
{"_id": "q1a72e0b6", "title": "", "text": "What were revenues by geographic area based on?"}
{"_id": "q1a71eef4", "title": "", "text": "What was the valuation allowance in 2019 and 2018?"}
{"_id": "q1a719076", "title": "", "text": "What was the Change in foreign operations tax exposure reserves in 2019?"}
{"_id": "q1a73f28a", "title": "", "text": "What is the average Personnel costs, including teammate benefits for 2018 and 2019?"}
{"_id": "q1a7280da", "title": "", "text": "What is the percentage constitution of total operating lease obligations among the total contractual obligations? "}
{"_id": "q1a7144d6", "title": "", "text": "In which year was the amount of Accruals larger?"}
{"_id": "q1a71a4a8", "title": "", "text": "What was the percentage change in the segment operating income (loss) between 2017 and 2018?"}
{"_id": "q1a71b1fa", "title": "", "text": "What percentage of fourth quarter 2019 revenue is the cost of revenue?"}
{"_id": "q1a7319fa", "title": "", "text": "What is the percentage of \"Other\" in total product sales in 2019?"}
{"_id": "q1a72a9de", "title": "", "text": "What was the Gain on sale of Netsmart in 2018?"}
{"_id": "q1a72f808", "title": "", "text": "What was the reason Oracle gave to explain the constant currency decreases in its hardware revenues in fiscal 2019 relative to fiscal 2018?"}
{"_id": "q1a71ce6a", "title": "", "text": "What was the Acquisition of Commercialization Rights related to?"}
{"_id": "q1a735190", "title": "", "text": "What were the shares issued under the ESPP in 2019?"}
{"_id": "q1a736c52", "title": "", "text": "What is the ratio of net derivative gains in segment operating profit in the fiscal year 2017 to expected operating result gains in the fiscal year 2020?"}
{"_id": "q1a73b93c", "title": "", "text": "What type of granted shares was excluded from the table?"}
{"_id": "q1a7267d0", "title": "", "text": "What is the average total bookings for 2017 and 2018?"}
{"_id": "q1a72b8f2", "title": "", "text": "What was the maturity date of the South African Credit Facility?"}
{"_id": "q1a717b40", "title": "", "text": "What is the long term position loans payable for 2018?"}
{"_id": "q1a71177c", "title": "", "text": "What was the research and development expense in 2019?"}
{"_id": "q1a71def0", "title": "", "text": "What was the percentage change in Finished goods from 2018 to 2019?"}
{"_id": "q1a739dc6", "title": "", "text": "What is the component that has the highest obligation for the company in 1-5 years?"}
{"_id": "q1a724d40", "title": "", "text": "What was the cash flow from operating activities in fiscal 2019?"}
{"_id": "q1a727360", "title": "", "text": "What is the average total fair value of long-lived assets held for sale for 2018 and 2019?"}
{"_id": "q1a7160ec", "title": "", "text": "What is the operating income for fiscal years 2019 and 2018 respectively?"}
{"_id": "q1a72ce50", "title": "", "text": "Where is there more information about the restructuring expenses?"}
{"_id": "q1a732c92", "title": "", "text": "What is the percentage increase / (decrease) in the Noncurrent liabilities (excluding debt) from 2018 to 2019?"}
{"_id": "q1a7175dc", "title": "", "text": "What are the two license agreements for the currently marketed products?"}
{"_id": "q1a741d82", "title": "", "text": "How is Basic earnings per share computed?"}
{"_id": "q1a715232", "title": "", "text": "In which year was the net loss less -10,000?"}
{"_id": "q1a71eb66", "title": "", "text": "Which agreement was entered by the group on 21 December 2018?"}
{"_id": "q1a72443a", "title": "", "text": "What is the change in consolidated Capital Expenditure on R&D and innovation between FY 2018 and FY 2019?"}
{"_id": "q1a73db4c", "title": "", "text": "What have the values in the 2018 column been restated for?"}
{"_id": "q1a72bbcc", "title": "", "text": "How much did the cost of revenues decreased by?"}
{"_id": "q1a7204de", "title": "", "text": "What is the percentage change in the cash flows from financing activities from 2018 to 2019?"}
{"_id": "q1a71a228", "title": "", "text": "What is the average annual operating income in 2018 and 2019?"}
{"_id": "q1a740356", "title": "", "text": "Where are prepayments included?"}
{"_id": "q1a7418d2", "title": "", "text": "What resulted in the change in the retail IPTV net subscriber activations in 2019?"}
{"_id": "q1a722982", "title": "", "text": "What is the change of expenses for facilities from fiscal year 2017 to 2019? "}
{"_id": "q1a73375a", "title": "", "text": "What is the value of the company's 2023-2024 purchase obligations as a percentage of its total payment due in the 2023-2024 period?"}
{"_id": "q1a731068", "title": "", "text": "What is the change in the % of pre-tax loss from 2018 to 2019?"}
{"_id": "q1a722e96", "title": "", "text": "What was the most significant expense in FY18?"}
{"_id": "q1a73a9f6", "title": "", "text": "As of September 2019, what is the number of outstanding RSUs?"}
{"_id": "q1a7305b4", "title": "", "text": "How many years did depreciation expense exceed $2,000 thousand?"}
{"_id": "q1a7202ae", "title": "", "text": "What was the change in Other in FY2019 from FY2018?"}
{"_id": "q1a720222", "title": "", "text": "What do the non-current assets according to segment reporting only include?"}
{"_id": "q1a7403d8", "title": "", "text": "In which year was Prepaid maintenance and other services larger?"}
{"_id": "q1a71cf1e", "title": "", "text": "How many years did the cash paid for income taxes exceed $150 million?"}
{"_id": "q1a71bf56", "title": "", "text": "What is the value of the accounts receivable due from Customer A in 2019?"}
{"_id": "q1a723de6", "title": "", "text": "What was the increase in cash flow from operating activities in 2019?"}
{"_id": "q1a72f01a", "title": "", "text": "What was the Weighted average number of shares—basic in 2018?"}
{"_id": "q1a73120c", "title": "", "text": "Why did long-term prepaid ground rent decrease?"}
{"_id": "q1a7245f2", "title": "", "text": "What is the approximate legal, professional, and other costs incurred?"}
{"_id": "q1a726ca8", "title": "", "text": "What is the ratio of amortization expense to accumulated amortization in the fiscal year 2019?"}
{"_id": "q1a71e698", "title": "", "text": "What was the percentage change in interest income between 2018 and 2019?"}
{"_id": "q1a73051e", "title": "", "text": "Which years does the table show?"}
{"_id": "q1a7330ac", "title": "", "text": "How does the company derive the risk-free interest rate?"}
{"_id": "q1a73f6ea", "title": "", "text": "Which years does the table provide information for Property, plant and equipment?"}
{"_id": "q1a734cc2", "title": "", "text": "Why is the tax rate likely to stabilize over the medium-term?"}
{"_id": "q1a72fb32", "title": "", "text": "Which year has the highest interest income?"}
{"_id": "q1a725c04", "title": "", "text": "What was the percentage increase in cost of VAS revenues between the fourth quarter of 2018 and 2019?"}
{"_id": "q1a730b7c", "title": "", "text": "What are the company's respective vehicles value in 2018 and 2019?"}
{"_id": "q1a7314b4", "title": "", "text": "What is the average Operating income for the period December 31, 2019 and 2018?"}
{"_id": "q1a730bd6", "title": "", "text": "What is the percentage change in the company's land value between September 2018 and September 2019?"}
{"_id": "q1a712230", "title": "", "text": "What was the change in the Weighted average number of shares outstanding incl. dilutive effect of share options from 2018 to 2019?"}
{"_id": "q1a728b02", "title": "", "text": "Which years does the table provide information for the company's groups of similar products and services?"}
{"_id": "q1a738ed0", "title": "", "text": "What was the Current Federal provision for income tax in 2019?"}
{"_id": "q1a73e31c", "title": "", "text": "What do intersegment revenues reflect?"}
{"_id": "q1a72c662", "title": "", "text": "What was the  Federal statutory tax expense  in 2018?"}
{"_id": "q1a71e0da", "title": "", "text": "What is the sum of net cash provided by operating activities from 2017 to 2019?"}
{"_id": "q1a738930", "title": "", "text": "What was the average balance at the end of the period over the 3 year period from 2017 to 2019?"}
{"_id": "q1a7149b8", "title": "", "text": "How many years did furniture, fixtures and other equipment exceed $10 million?"}
{"_id": "q1a72de72", "title": "", "text": "How many contractual obligations had a total payments due that exceeded $500,000 thousand?"}
{"_id": "q1a724188", "title": "", "text": "What is the increase / (decrease) in 28 nanometers from 2018 to 2019?"}
{"_id": "q1a72e174", "title": "", "text": "What is the revenue from Canada in 2019 as a percentage of the total revenue in 2019?"}
{"_id": "q1a71e378", "title": "", "text": "What was high price per share in the first quarter of 2019?"}
{"_id": "q1a713162", "title": "", "text": "What was the change in basic earnings per share attributable to the stockholders of Jabil Inc. between May 2019 and August 2019?"}
{"_id": "q1a740e50", "title": "", "text": "What was the service cost increase / (decrease) from 2018 to 2019?"}
{"_id": "q1a734a88", "title": "", "text": "What is the average net revenue for fiscal 2018 and fiscal 2017?"}
{"_id": "q1a73df0c", "title": "", "text": "What is the change in Gross profit from 2019 to 2018?"}
{"_id": "q1a7373be", "title": "", "text": "What is the average share capital across the 2 years?"}
{"_id": "q1a731662", "title": "", "text": "What does the information in the table represent?"}
{"_id": "q1a71ebca", "title": "", "text": "What was the result of the agreement signed on 28 June 2019?"}
{"_id": "q1a72b924", "title": "", "text": "What was the carrying value (USD) of the Columbian Credit Facility in 2019?"}
{"_id": "q1a728daa", "title": "", "text": "In which year was the average prices for Silver larger?"}
{"_id": "q1a71f1ce", "title": "", "text": "What was the increase in operating income from AMER between 2018 and 2019?"}
{"_id": "q1a74117a", "title": "", "text": "What percentage of Barry Litwin's target amount under the 2019 plan is Robert Dooley's target amount?"}
{"_id": "q1a73c148", "title": "", "text": "What led to increase in income tax expense in 2019?"}
{"_id": "q1a73df66", "title": "", "text": "What was the net loss in 2016?"}
{"_id": "q1a72372e", "title": "", "text": "What is the increase/ (decrease) in Interest expense, net of interest income from 2018 to 2019?"}
{"_id": "q1a717bf4", "title": "", "text": "In which year is the equipment notes payable higher?"}
{"_id": "q1a732bac", "title": "", "text": "What caused the increase in the noncurrent assets?"}
{"_id": "q1a731b58", "title": "", "text": "Which years does the table provide information for a roll forward of common shares outstanding?"}
{"_id": "q1a72c716", "title": "", "text": "What was the percentage change in Valuation allowance in 2019 from 2018?"}
{"_id": "q1a71d19e", "title": "", "text": "What public offerings were completed on August 26, 2019?"}
{"_id": "q1a741328", "title": "", "text": "What was the amount of Machinery and equipment in 2018?"}
{"_id": "q1a7173e8", "title": "", "text": "What was the total assets in 2018?"}
{"_id": "q1a721582", "title": "", "text": "What is the percentage change in the revenue from 2018 to 2019?"}
{"_id": "q1a720d3a", "title": "", "text": "What is the total net deferred taxes between 2018 to 2019?"}
{"_id": "q1a738444", "title": "", "text": "What is the value of the voyage expenses in 2019 as a percentage of the voyage revenue in 2019?"}
{"_id": "q1a725c86", "title": "", "text": "What is the change in costs of VAS revenue between the fourth quarter of 2018 and 2019?"}
{"_id": "q1a741b7a", "title": "", "text": "What was the change in Raw materials and supplies in 2019 from 2018?"}
{"_id": "q1a726744", "title": "", "text": "What is the total number of customers at each listed period end, in chronological order?"}
{"_id": "q1a72f25e", "title": "", "text": "In which years were the total restructuring reserves calculated for?"}
{"_id": "q1a72489a", "title": "", "text": "What assumptions does the Black-Scholes option valuation model comprise of?"}
{"_id": "q1a73f956", "title": "", "text": "Why did service revenue increase?"}
{"_id": "q1a72bece", "title": "", "text": "Between year ended 2017 and 2018, which year had a higher sales and marketing expense?"}
{"_id": "q1a73d908", "title": "", "text": "What is the percentage increase / (decrease) in Tax fees from 2018 to 2019?"}
{"_id": "q1a71a476", "title": "", "text": "What was the change in the percentage to net sales for segment operating income (loss) between 2017 and 2018?"}
{"_id": "q1a733994", "title": "", "text": "What was the total revenue from the Healthcare/Life Sciences segment?"}
{"_id": "q1a735b22", "title": "", "text": "What is the change in the total number of shares purchased between fiscal years 2018 and 2019?"}
{"_id": "q1a71d25c", "title": "", "text": "What is the average total debt from 2018 to 2019?"}
{"_id": "q1a71b1a0", "title": "", "text": "What was the profit margin for the fourth quarter of 2019?"}
{"_id": "q1a72a54c", "title": "", "text": "What was the change in Property and equipment, net in 2018 from 2017?"}
{"_id": "q1a7160b0", "title": "", "text": "What is the net sales for fiscal years 2019 and 2018 respectively?"}
{"_id": "q1a728864", "title": "", "text": "What led to increase in cable revenue in 2018?"}
{"_id": "q1a71686c", "title": "", "text": "What was the gross federal net operating loss in 2019?"}
{"_id": "q1a716894", "title": "", "text": "What was the Federal and foreign net operating losses and credits in 2019 and 2018 respectively?"}
{"_id": "q1a721a8c", "title": "", "text": "What is the difference in total revenue between network solutions and services & support?"}
{"_id": "q1a728fe4", "title": "", "text": "What is the Accumulated depreciation and amortization for year 2019?"}
{"_id": "q1a732a12", "title": "", "text": "What is the percentage constitution of the prior year special in the total dividends paid during the period of 2019?"}
{"_id": "q1a738ba6", "title": "", "text": "What was the income tax benefit in 2019?"}
{"_id": "q1a724dcc", "title": "", "text": "What was the increase / (decrease) in operating activities from 2018 to 2019?"}
{"_id": "q1a7408ba", "title": "", "text": "What was the company's financial covenants position in 2019?"}
{"_id": "q1a72d670", "title": "", "text": "What is the average maintenance revenue in 2018 and 2019?"}
{"_id": "q1a7189d2", "title": "", "text": "What is the change in Accrued expenses from 2018 to 2019?"}
{"_id": "q1a727a4a", "title": "", "text": "What was Revenue in 2017?"}
{"_id": "q1a73e650", "title": "", "text": "What was the percentage change in Other financial income in 2018/2019 from 2017/2018?"}
{"_id": "q1a724dfe", "title": "", "text": "What was the average investing activities for 2018 and 2019?"}
{"_id": "q1a73bc02", "title": "", "text": "In which years was the other non-current assets recorded for?"}
{"_id": "q1a712172", "title": "", "text": "Why have RSUs been omitted when calculating diluted earnings per share for 2018 and 2017?"}
{"_id": "q1a731f40", "title": "", "text": "For Fiscal year 2019, excluding the increase in other miscellaneous costs of $0.4 million, what is the Cost of Customer Support Revenues for fiscal year 2019 in thousands(1,000s)?"}
{"_id": "q1a717b72", "title": "", "text": "What is the percentage change in the equipment notes payable from 2018 to 2019?"}
{"_id": "q1a728832", "title": "", "text": "What led to increase in Wireless revenue in 2018?"}
{"_id": "q1a741954", "title": "", "text": "What is the percentage of Satellite subscribers out of the total retail subscribers in 2019?"}
{"_id": "q1a7366da", "title": "", "text": "What is the revenue in 2019?"}
{"_id": "q1a720d12", "title": "", "text": "What is the increase in valuation allowance between 2018 and 2019?"}
{"_id": "q1a71a5e8", "title": "", "text": "Which years does the table provide information for accounts receivable?"}
{"_id": "q1a71e346", "title": "", "text": "Which fiscal years does the table provide information for the price range per share of common stock?"}
{"_id": "q1a71cc30", "title": "", "text": "What is the percentage change in the Cost of living indexation rate for post-employment benefit obligations?"}
{"_id": "q1a717988", "title": "", "text": "What was the percentage change in total related party revenues between 2018 and 2019?"}
{"_id": "q1a71e9e0", "title": "", "text": "What is the change in Property and equipment, net in South Africa from Year Ending March 31, 2018 to 2019?"}
{"_id": "q1a736266", "title": "", "text": "What is the difference in the number of shares between June 30, 2018 and 2019?"}
{"_id": "q1a736b6c", "title": "", "text": "What does the table show?"}
{"_id": "q1a73dbb0", "title": "", "text": "In which year was Operating profit larger?"}
{"_id": "q1a71d766", "title": "", "text": "How much less did the company spend on \"developed technology\" in 2018 than 2019?"}
{"_id": "q1a722b6c", "title": "", "text": "What is the average Cost of net revenue, for the Years Ended December 31, 2019 to 2018?"}
{"_id": "q1a72b3c0", "title": "", "text": "What variables are considered on top of the value at 1 January when calculating the value at 31 December for government grants that are included within trade and other payables?"}
{"_id": "q1a72b1f4", "title": "", "text": "What was the change in Webzone in 2019 from 2018?"}
{"_id": "q1a7255c4", "title": "", "text": "What is the total amount of capitalized interest in 2018 and 2019?"}
{"_id": "q1a73190a", "title": "", "text": "What are the segments of product sales?"}
{"_id": "q1a71d4a0", "title": "", "text": "What was the total Other comprehensive loss before reclassifications in 2017?"}
{"_id": "q1a72accc", "title": "", "text": "In which years was the amount of Sales to unaffiliated customers calculated?"}
{"_id": "q1a72e2fa", "title": "", "text": "What is the Restricted Share Awards (“RSAs”) for fiscal years 2019, 2018 and 2017 respectively?"}
{"_id": "q1a71746a", "title": "", "text": "What was the percentage change in the total assets from Corporate and eliminations between 2018 and 2019?"}
{"_id": "q1a73550a", "title": "", "text": "Where was the selected financial data for each of the five years ended December 31, 2019 derived from?"}
{"_id": "q1a7391aa", "title": "", "text": "What was the change in the accumulated benefit obligation for foreign defined benefit pension plans in 2019 from 2018?"}
{"_id": "q1a73df34", "title": "", "text": "In which years was revenue under 500,000 thousands?"}
{"_id": "q1a711e7a", "title": "", "text": "What caused the increase in capital expenditures related to wireless?"}
{"_id": "q1a734812", "title": "", "text": "What is the average general and administrative expenses for 2017 and 2018?"}
{"_id": "q1a738692", "title": "", "text": "How much were software in 2019?"}
{"_id": "q1a737c6a", "title": "", "text": "What was the percentage of Direct sales to contract manufacturers and consignment warehouses in 2019, 2018 and 2017 respectively?"}
{"_id": "q1a737d50", "title": "", "text": "What was the average revenue from Avnet Logistics between 2017-2019?"}
{"_id": "q1a71cc58", "title": "", "text": "For post-employment benefit obligations, what is the percentage change in the life expectancy at age 65 in 2019?"}
{"_id": "q1a71d798", "title": "", "text": "Which note can investors refer to for additional information regarding Oracle's intangible assets and related amortization?"}
{"_id": "q1a74197c", "title": "", "text": "What is the percentage of IPTV subscribers out of the total retail subscribers in 2019?"}
{"_id": "q1a71762c", "title": "", "text": "When is revenue recognized?"}
{"_id": "q1a720420", "title": "", "text": "What is the cause of the lower cash flow from operating activities in 2019 as compared to 2018?"}
{"_id": "q1a71f480", "title": "", "text": "What is the average Net Sales for Fiscal Year Ended April 28, 2018 to April 29, 2017?"}
{"_id": "q1a73c986", "title": "", "text": "What is the cash remuneration for the Board of directors in fiscal years ended June 30, 2017, 2018 and 2019 respectively?"}
{"_id": "q1a73d084", "title": "", "text": "What was the cash and cash equivalents in 2019?"}
{"_id": "q1a7405e0", "title": "", "text": "How is the inventory purchased?"}
{"_id": "q1a720a42", "title": "", "text": "What is the average Number of Nonvested shares of RSUs for December 31, 2018 to 2019?"}
{"_id": "q1a727306", "title": "", "text": "What is the total fair value of money market funds as at June 30, 2018?"}
{"_id": "q1a72c694", "title": "", "text": "In which years was the U.S. Federal statutory rate provided?"}
{"_id": "q1a737efe", "title": "", "text": "What does \"Other\" include in the table?"}
{"_id": "q1a72a9ac", "title": "", "text": "What was the Loss from discontinued operations in 2019?"}
{"_id": "q1a727d7e", "title": "", "text": "In which year was Products and Licensing revenue less than 25,000,000?"}
{"_id": "q1a716b96", "title": "", "text": "What was the Effective tax rate in 2019 and 2018 respectively?"}
{"_id": "q1a72de9a", "title": "", "text": "What was the difference between total operating lease obligations and total capital lease obligations?"}
{"_id": "q1a714530", "title": "", "text": "What was the percentage change in the amount of Accruals?"}
{"_id": "q1a71f8d6", "title": "", "text": "What was the principal amount in 2019?"}
{"_id": "q1a71cba4", "title": "", "text": "What is the weighted average duration of the post-employment benefit obligation?"}
{"_id": "q1a712d7a", "title": "", "text": "Who did not recieve a FY19 EAIP payout?"}
{"_id": "q1a734fa6", "title": "", "text": "What was the risk free interest rate in 2018?"}
{"_id": "q1a71a1f6", "title": "", "text": "What is the change in Adjusted EBITDA from 2018 to 2019?"}
{"_id": "q1a736932", "title": "", "text": "What was the change in deferred tax assets between 2018 and 2019?"}
{"_id": "q1a7279b4", "title": "", "text": "What was revenue growth rate in 2019?"}
{"_id": "q1a7379f4", "title": "", "text": "What financial items does operating expenses consist of?"}
{"_id": "q1a72b5dc", "title": "", "text": "For which years was  information regarding shares of common stock granted and vested provided?"}
{"_id": "q1a73058c", "title": "", "text": "What was the amortization expense in 2019?"}
{"_id": "q1a72c05e", "title": "", "text": "What caused the net cash provided by operating activities to decrease?"}
{"_id": "q1a739d12", "title": "", "text": "What is the Total short-term lines of credit at the end of 2019?"}
{"_id": "q1a729ffc", "title": "", "text": "Which year did Bell welcome the industry's highest number of new subscribers across the growth services of retail Internet, IPTV and wireless?"}
{"_id": "q1a717956", "title": "", "text": "What was the change in data and analytic services between 2017 and 2019?"}
{"_id": "q1a7323dc", "title": "", "text": "What led to decrease in shipping revenues?"}
{"_id": "q1a725e48", "title": "", "text": "What are the respective operating accruals in 2018 and 2019?"}
{"_id": "q1a71de96", "title": "", "text": "In which year was Purchased parts and assemblies larger?"}
{"_id": "q1a7146ac", "title": "", "text": "What was the foreign pretax income in 2018?"}
{"_id": "q1a727338", "title": "", "text": "Between 2018 and 2019 year end, which year has a higher total fair value of money market funds?"}
{"_id": "q1a730924", "title": "", "text": "What is the year-on-year change in FinTech and Business Services revenue?"}
{"_id": "q1a712a14", "title": "", "text": "How is the fair value of financial instruments that are not traded in active markets determined?"}
{"_id": "q1a7258ee", "title": "", "text": "What is BTL's losses mainly comprised of?"}
{"_id": "q1a717bcc", "title": "", "text": "What is the percentage of loan for the acquisition of an excavator that is outstanding?"}
{"_id": "q1a72f736", "title": "", "text": "How much more revenue came from the Americas as compared to Asia Pacific in 2019?"}
{"_id": "q1a73d8d6", "title": "", "text": "What is the average Audit-related Fees?"}
{"_id": "q1a7215dc", "title": "", "text": "What is the percentage change in long-term deferred revenue from 2018 to 2019?"}
{"_id": "q1a7137b6", "title": "", "text": "What was the difference in the total between operating lease obligations and Other purchase obligations and commitments?"}
{"_id": "q1a726fc8", "title": "", "text": "What was the total debt obligations?"}
{"_id": "q1a73f6b8", "title": "", "text": "What was the Building and building improvements in 2018?"}
{"_id": "q1a722b9e", "title": "", "text": "What is the average % of net revenue for cost of net revenue for the Years Ended December 31, 2019 to 2018?"}
{"_id": "q1a7157e6", "title": "", "text": "What was the change in income taxes payable between 2018 and 2019?"}
{"_id": "q1a7386ec", "title": "", "text": "How much do the top 3 property and equipment add up to in 2018?"}
{"_id": "q1a737fee", "title": "", "text": "What is the component that contributes the most to total accrued expenses and other payables?"}
{"_id": "q1a729354", "title": "", "text": "How is processed chicken first salable as?"}
{"_id": "q1a732198", "title": "", "text": "What is the excluded potential common shares for 2019?"}
{"_id": "q1a728be8", "title": "", "text": "What was the percentage change in total product revenue between 2018 and 2019?"}
{"_id": "q1a73e600", "title": "", "text": "In which year was Other financial income larger?"}
{"_id": "q1a71415c", "title": "", "text": "In which year was the share of net earnings in Golar Partners higher?"}
{"_id": "q1a735f28", "title": "", "text": "What drove the increase in revenue for both DRAM and NAND from 2017 to 2018?"}
{"_id": "q1a738f2a", "title": "", "text": "How many years did current foreign provision for income tax exceed $40 million?"}
{"_id": "q1a73a546", "title": "", "text": "What is the number of exercisable shares excluded for 2019 and 2018 respectively?"}
{"_id": "q1a72967e", "title": "", "text": "Which year had the higher  Total  loans due from subsidiaries?"}
{"_id": "q1a717b9a", "title": "", "text": "What is the percentage change in the subtotal loans payable from 2018 to 2019?"}
{"_id": "q1a724ab6", "title": "", "text": "What does the Group's deferred income balances relate to?"}
{"_id": "q1a735f78", "title": "", "text": "How does the percentage change of gross margin from 2018 to 2019?"}
{"_id": "q1a72a24a", "title": "", "text": "What does the primary business of the company include?"}
{"_id": "q1a72c2ca", "title": "", "text": "The carrying value of the long term debt is held at which value?"}
{"_id": "q1a73c954", "title": "", "text": "Who are considered to be the key management personnel of the Group?"}
{"_id": "q1a73d886", "title": "", "text": "Who approves the audit and non-audit services performed by Ernst & Young?"}
{"_id": "q1a73b374", "title": "", "text": "What is the number of shares granted during the period in 2018?"}
{"_id": "q1a7406bc", "title": "", "text": "What is the percentage change between Accounts Payable to Supplier A from 2018 to 2019?"}
{"_id": "q1a72b60e", "title": "", "text": "In which year was the Weighted average grant-date fair value per common stock the smallest?"}
{"_id": "q1a72ce82", "title": "", "text": "Which are the top 2 prepaid expenses for 2019?"}
{"_id": "q1a73ef92", "title": "", "text": "What was the Expected volatility in 2018 and 2017 respectively?"}
{"_id": "q1a71f9bc", "title": "", "text": "What was the effective interest rate of the liability component? "}
{"_id": "q1a711740", "title": "", "text": "Which years does the table provide information for R&D, sales and marketing, and G&A expenses?"}
{"_id": "q1a724160", "title": "", "text": "What was the percentage of 14 nanometers and under in 2017?"}
{"_id": "q1a721230", "title": "", "text": "Why did the restructuring costs decreased from 2018 to 2019?"}
{"_id": "q1a721c9e", "title": "", "text": "What is the percentage of the cash and cash equivalents at December 31, 2019 held in jurisdictions outside the U.S.?"}
{"_id": "q1a737f30", "title": "", "text": "What does the table show?"}
{"_id": "q1a735af0", "title": "", "text": "What is the expiration date of Lifeway's share repurchase program?"}
{"_id": "q1a738f02", "title": "", "text": "What was the Current State provision for income tax in 2017?"}
{"_id": "q1a71f232", "title": "", "text": "Which years does the table provide information for operating income by reportable segment?"}
{"_id": "q1a71ba74", "title": "", "text": "What was the difference in restructuring expenses in 2019 and 2018?"}
{"_id": "q1a72fad8", "title": "", "text": "What was the loss arising on bond repurchases at a premium in 2019?"}
{"_id": "q1a7282d8", "title": "", "text": "Which years does the table provide information for the amortization of purchased intangible assets?"}
{"_id": "q1a718914", "title": "", "text": "When are trade payables paid?"}
{"_id": "q1a71d9f0", "title": "", "text": "What was the change in personnel expenses in 2018/2019 from 2017/2018?"}
{"_id": "q1a731978", "title": "", "text": "What is the percentage change in the total product sales from 2018 to 2019?"}
{"_id": "q1a736ef0", "title": "", "text": "What is the change in Early debt extinguishment costs from 2018 to 2019?"}
{"_id": "q1a732666", "title": "", "text": "What is the percentage change in the United States sales from 2018 to 2019?"}
{"_id": "q1a71efda", "title": "", "text": "What is the average Accrued expenses from 2018 to 2019?"}
{"_id": "q1a73574e", "title": "", "text": "What is the company’s return on assets in 2017?"}
{"_id": "q1a72af38", "title": "", "text": "Why were accruals and other liabilities adjusted?"}
{"_id": "q1a736676", "title": "", "text": "What is the net liabilities in 2019?"}
{"_id": "q1a7333fe", "title": "", "text": "What is the accounts receivable for 2019 and 2018 respectively?"}
{"_id": "q1a7347b8", "title": "", "text": "What is the general and administrative expenses for year ended 2019 ?"}
{"_id": "q1a728b8e", "title": "", "text": "What was the change in total products and services between 2017 and 2018?"}
{"_id": "q1a7204b6", "title": "", "text": "What is the percentage change in the cash flows from operating activities from 2018 to 2019?"}
{"_id": "q1a7308f2", "title": "", "text": "What is the year-on-year change in VAS Business revenue?"}
{"_id": "q1a73feba", "title": "", "text": "On a normalised basis, how much did ROFE increase between F18 and F19?"}
{"_id": "q1a729dea", "title": "", "text": "Which year has the least amount of transaction-based cost?"}
{"_id": "q1a72b636", "title": "", "text": "What was the change in Fair value of common stock vested in 2019 from 2018?"}
{"_id": "q1a7401c6", "title": "", "text": "What is the change in the number of active users between 2018 and 2019?"}
{"_id": "q1a73292c", "title": "", "text": "What is the tax rate that all dividends are franked at?"}
{"_id": "q1a735226", "title": "", "text": "How many years did Shares issued under the ESPP exceed $2 million?"}
{"_id": "q1a73d5e8", "title": "", "text": "What is the number of Shares issued on feburary 2018? "}
{"_id": "q1a741922", "title": "", "text": "What is the change in the number of IPTV retail subscribers in 2019?"}
{"_id": "q1a7403b0", "title": "", "text": "What are the components making up total prepayments in the table?"}
{"_id": "q1a7370d0", "title": "", "text": "In which year was revenue in the UK larger?"}
{"_id": "q1a71909e", "title": "", "text": "What was the change in the Amount computed using the statutory rate between 2018 and 2019?"}
{"_id": "q1a72e714", "title": "", "text": "What caused the increase in amortization of intangible assets in 2019?"}
{"_id": "q1a738f52", "title": "", "text": "What was the change in total current provision for income tax between 2017 and 2018?"}
{"_id": "q1a71418e", "title": "", "text": "What was the change in ownership interest held in Golar Partners?"}
{"_id": "q1a722e64", "title": "", "text": "What was the percentage change in finance costs between 2018 and 2019?"}
{"_id": "q1a719ce2", "title": "", "text": "How many types of non-cash changes are there?"}
{"_id": "q1a71276c", "title": "", "text": "What was the difference between the 2019 actual group cash generation compared with the 2019 target group cash generation?"}
{"_id": "q1a7366a8", "title": "", "text": "What is the net liabilities in 2018?"}
{"_id": "q1a717d70", "title": "", "text": "What does total employee expenditure in the table include?"}
{"_id": "q1a7345b0", "title": "", "text": "What was the change in the Projected benefit obligation between 2018 and 2019?"}
{"_id": "q1a73224c", "title": "", "text": "What is the percentage increase / (decrease) in the earnings allocated to participating securities from 2018 to 2019?"}
{"_id": "q1a72e7c8", "title": "", "text": "In which year was primarily driven by ASTRO Acquisition"}
{"_id": "q1a729d68", "title": "", "text": "What factors are taken into account to calculate the adjusted revenue?"}
{"_id": "q1a73f47e", "title": "", "text": "What years are included in the table that relates to our unrecognized tax benefits and the effect on our effective income tax rate if recognized:"}
{"_id": "q1a713b26", "title": "", "text": "What does the non-GAAP results exclude?"}
{"_id": "q1a73d6a6", "title": "", "text": "What is the change in share balance from June 2018 to June 2019?"}
{"_id": "q1a740144", "title": "", "text": "How does the company grow their community of users?"}
{"_id": "q1a73fe88", "title": "", "text": "How much is the ROFE in F19?"}
{"_id": "q1a72a77c", "title": "", "text": "What was the change in trade receivables between 2018 and 2019?"}
{"_id": "q1a734a56", "title": "", "text": "What is the total net revenue for fiscal 2017 and fiscal 2018?"}
{"_id": "q1a7344f2", "title": "", "text": "Which years does the table provide information for the projected benefit obligation, accumulated benefit obligation and fair value of plan assets for the company's Pension Plans?"}
{"_id": "q1a73eb1e", "title": "", "text": "What was the amount of  Net unrealized holding gains (losses)  in 2018?"}
{"_id": "q1a731266", "title": "", "text": "What was the change in Other miscellaneous assets between 2018 and 2019?"}
{"_id": "q1a7124e2", "title": "", "text": "What is the percentage change in balance at January 1 and December 31 in 2017?"}
{"_id": "q1a71f2b4", "title": "", "text": "What was the percentage change in the total operating income between 2018 and 2019?"}
{"_id": "q1a71a642", "title": "", "text": "What was the net accounts receivable in 2019?"}
{"_id": "q1a71ef80", "title": "", "text": "What was the change in the lease liability from 2018 to 2019?"}
{"_id": "q1a7355a0", "title": "", "text": "What is the percentage change in revenues from 2018 to 2019?"}
{"_id": "q1a73cbf2", "title": "", "text": "What is warranty liability a component of?"}
{"_id": "q1a7302d0", "title": "", "text": "What was the total gross carrying value?"}
{"_id": "q1a72a718", "title": "", "text": "What were the unbilled trade receivables in 2018?"}
{"_id": "q1a72a272", "title": "", "text": "What does the company sell?"}
{"_id": "q1a71bd76", "title": "", "text": "What was the percentage change in the net periodic benefit cost discount rate between 2018 and 2019?"}
{"_id": "q1a73ed76", "title": "", "text": "What was the Basic net income attributable to American Tower Corporation common stockholders in 2018?"}
{"_id": "q1a7362c0", "title": "", "text": "What is the percentage change of the total number shares between June 30, 2018 and 2019?"}
{"_id": "q1a726f64", "title": "", "text": "What does the company's debt obligations consist of?"}
{"_id": "q1a7282a6", "title": "", "text": "Why did amortization of purchased intangible assets decrease?"}
{"_id": "q1a7171c2", "title": "", "text": "What is the average age of the company's executive officers?"}
{"_id": "q1a727b1c", "title": "", "text": "What was the change in Constant currency revenue between 2018 and 2019?"}
{"_id": "q1a7401f8", "title": "", "text": "What is the percentage change of devices sold from 2018 to 2019?"}
{"_id": "q1a712aaa", "title": "", "text": "How much did the level 1 FVPL change by from 2018 year end to 2019 year end?"}
{"_id": "q1a738962", "title": "", "text": "What was the % change in the balance, beginning of the period from 2018 to 2019?"}
{"_id": "q1a732c10", "title": "", "text": "What caused the increase in the Noncurrent liabilities?"}
{"_id": "q1a716f74", "title": "", "text": "What was the change in the litigation expense between 2017 and 2018?"}
{"_id": "q1a72afec", "title": "", "text": "What was the percentage change in Accruals and other liabilities between 2018 and 2019?"}
{"_id": "q1a7326c0", "title": "", "text": "What is the percentage change in total net sales from 2018 to 2019?"}
{"_id": "q1a720510", "title": "", "text": "What is the percentage change in the net change in cash and cash equivalents from 2018 to 2019?"}
{"_id": "q1a73fbfe", "title": "", "text": "Who was named an executive officer during FY19?"}
{"_id": "q1a74016c", "title": "", "text": "How many devices were sold in 2019?"}
{"_id": "q1a71f908", "title": "", "text": "What was the net carrying amount before unamortized debt issuance costs in 2018?"}
{"_id": "q1a71ec4c", "title": "", "text": "What is the change in Other intangible assets Amortisation 2018 to 2019?"}
{"_id": "q1a7284b8", "title": "", "text": "What are the components of inventories?"}
{"_id": "q1a72d332", "title": "", "text": "In which years was the number of options outstanding at 31 March calculated?"}
{"_id": "q1a72afc4", "title": "", "text": "What was the change in the Distributions payable between 2018 and 2019?"}
{"_id": "q1a7390e2", "title": "", "text": "What was the  accumulated benefit obligation for the United States defined benefit pension plans in 2019?"}
{"_id": "q1a728918", "title": "", "text": "What is the increase/ (decrease) in media revenue from 2017 to 2018?"}
{"_id": "q1a737d28", "title": "", "text": "What was the change in the revenues from Sanmina from 2018 to 2019?"}
{"_id": "q1a71e99a", "title": "", "text": "What is the change in Property and equipment, net in United Kingdom from Year Ending March 31, 2018 to 2019?"}
{"_id": "q1a71ffc0", "title": "", "text": "What is net profit excluding impairment?"}
{"_id": "q1a73f690", "title": "", "text": "What was the depreciation expense attributed to property, plant and equipment in 2019?"}
{"_id": "q1a71bfec", "title": "", "text": "What is the percentage change in revenue earned from customer B between 2018 and 2019?"}
{"_id": "q1a725038", "title": "", "text": "What is the total number of shares of common stock issuable under equity incentive plans outstanding between 2017 to 2019?"}
{"_id": "q1a72fede", "title": "", "text": "In which year was Other larger?"}
{"_id": "q1a739d9e", "title": "", "text": "What is  Purchase obligations expressed as a percentage of  Total contractual obligations?"}
{"_id": "q1a72fe84", "title": "", "text": "What was the  Tax credits in 2019?"}
{"_id": "q1a715d90", "title": "", "text": "What is the proportion of the goodwill, trademarks, and other intangible assets, as well as investment in unconsolidated subsidiaries over total liabilities in 2018?"}
{"_id": "q1a722ebe", "title": "", "text": "What was the sum of all expenses in FY19?"}
{"_id": "q1a733962", "title": "", "text": "Which geographic reportable segments does the table provide information for the Company's revenue?"}
{"_id": "q1a724da4", "title": "", "text": "What was the cash provision in 2017?"}
{"_id": "q1a718978", "title": "", "text": "What is the value of trade payables in 2019?"}
{"_id": "q1a71cef6", "title": "", "text": "What was the change in Cash paid for interest between 2018 and 2019?"}
{"_id": "q1a72c6bc", "title": "", "text": "In which year was the U.S. Federal statutory rate largest?"}
{"_id": "q1a721884", "title": "", "text": "What was the percentage change in the amount of surcharge revenue from 2018 to 2019?"}
{"_id": "q1a735a96", "title": "", "text": "When did Lifeway publicly announce their share repurchase program?"}
{"_id": "q1a727392", "title": "", "text": "What is the change in total fair value of long-lived assets held for sale between 2018 and 2019?"}
{"_id": "q1a738638", "title": "", "text": "What was the depreciation expense in fiscal year 2019?"}
{"_id": "q1a735546", "title": "", "text": "How should the selected financial data be read in conjunction with?"}
{"_id": "q1a723b8e", "title": "", "text": "What was the total income in 2017?"}
{"_id": "q1a72fb8c", "title": "", "text": "What was the percentage change in total financial costs from 2017 to 2019?"}
{"_id": "q1a72a7cc", "title": "", "text": "What was the percentage change in the net trade receivables between 2018 and 2019?"}
{"_id": "q1a72d5ee", "title": "", "text": "What are the respective software and hardware related revenue in 2018 and 2019?"}
{"_id": "q1a733c82", "title": "", "text": "How many years did the Tax benefit for stock compensation expense exceed $1,000 thousand?"}
{"_id": "q1a7212e4", "title": "", "text": "What is the difference in accelerated depreciation between 2018 and 2019?"}
{"_id": "q1a71f6e2", "title": "", "text": "What are the components factored in when calculating the net cash inflow from operating activities?"}
{"_id": "q1a72e14c", "title": "", "text": "What was the change in revenue from South America between 2017 and 2018?"}
{"_id": "q1a740694", "title": "", "text": "What is the percentage change between inventory purchases from Supplier A from 2017 to 2018?"}
{"_id": "q1a7391d2", "title": "", "text": "What was the percentage change in the accumulated benefit obligation for foreign defined benefit pension plans in 2019 from 2018?"}
{"_id": "q1a715d36", "title": "", "text": "How much were the assets of inventory during fiscal 2018 and 2019, respectively?"}
{"_id": "q1a72b442", "title": "", "text": "What was the percentage change in the amount at 31 December?"}
{"_id": "q1a724624", "title": "", "text": "What is the net income per basic share for pro forma year ended September 30, 2018?"}
{"_id": "q1a716bf0", "title": "", "text": "What was the change in the Effective tax rate from 2018 to 2019?"}
{"_id": "q1a73a5a0", "title": "", "text": "What is the average diluted EPS Shares outstanding for 2018 and 2019?"}
{"_id": "q1a72556a", "title": "", "text": "What is the change in capitalized interest in 2019?"}
{"_id": "q1a73439e", "title": "", "text": "Why did the board compensation decreased slightly from 2018 to 2019?"}
{"_id": "q1a733674", "title": "", "text": "What does purchase obligations refer to?"}
{"_id": "q1a712e10", "title": "", "text": "What is the NEOs' total salary?"}
{"_id": "q1a7264b0", "title": "", "text": "What was the income from Foreign countries in 2019?"}
{"_id": "q1a73dc0a", "title": "", "text": "What was the percentage change in profit before taxation in 2019 from 2018?"}
{"_id": "q1a73b9fa", "title": "", "text": "What is the sum of the total fair value of restricted stock vested during 2019, 2018 and 2017?"}
{"_id": "q1a73ef2e", "title": "", "text": "What was the unrecognized compensation cost in 2020?"}
{"_id": "q1a7248cc", "title": "", "text": "What is the expected volatility as at December 31, 2019?"}
{"_id": "q1a726c4e", "title": "", "text": "What was the impairment charges for Grocery & Snacks  during fiscal 2019?"}
{"_id": "q1a72c2fc", "title": "", "text": "What is the difference in the carrying value and the fair value of Notes Payable in 2019?"}
{"_id": "q1a72e1b0", "title": "", "text": "How much does the top 3 revenues in 2018 add up to?"}
{"_id": "q1a736e3c", "title": "", "text": "What was the pension and benefit credits in 2018?"}
{"_id": "q1a71828e", "title": "", "text": "What is the % change in the capital intensity ratio for BCE?"}
{"_id": "q1a73fc80", "title": "", "text": "What is the percentage increase in Mr Kapuria's salary from his promotion?"}
{"_id": "q1a73a79e", "title": "", "text": "In which year was the Trade accounts receivable, net, current larger?"}
{"_id": "q1a7368b0", "title": "", "text": "What was the fair value of the company's equity interest in LNTL?"}
{"_id": "q1a72e354", "title": "", "text": "What is the amount of Convertible notes for fiscal year 2019?"}
{"_id": "q1a73dee4", "title": "", "text": "What is the change in Revenues from 2019 to 2018?"}
{"_id": "q1a739790", "title": "", "text": "What does the company's credit risk rating of 7 and higher refer to?"}
{"_id": "q1a733f84", "title": "", "text": "How much of the remaining interests in Inotera that the company acquire in 2016?"}
{"_id": "q1a74063a", "title": "", "text": "How many percent of the total inventory purchases did Supplier C account for in the year 2019?"}
{"_id": "q1a731f9a", "title": "", "text": "What is the Customer Support Revenues of Americas expressed as a percentage of GAAP-based Customer Support Gross Profit for Fiscal year 2019?"}
{"_id": "q1a73b428", "title": "", "text": "In which year is the number of outstanding shares at the end of the period higher?"}
{"_id": "q1a7293ae", "title": "", "text": "What is the average value added from fresh vacuum-sealed registrant processed chicken as a percentage of net sales dollars for fiscal years 2018 and 2019?"}
{"_id": "q1a7395f6", "title": "", "text": "What is the percentage change in total accrued liabilities in 2018 and 2019?"}
{"_id": "q1a71e972", "title": "", "text": "What is the change in Property and equipment, net in United States from Year Ending March 31, 2018 to 2019?"}
{"_id": "q1a72b140", "title": "", "text": "What is the allocation of goodwill to the appropriate CGU based on?"}
{"_id": "q1a73866a", "title": "", "text": "How much were leasehold improvements in 2019?"}
{"_id": "q1a71fb88", "title": "", "text": "How much was the accrued revenue for 2018?"}
{"_id": "q1a73acee", "title": "", "text": "How were the company's inventories valued?"}
{"_id": "q1a73f1c2", "title": "", "text": "How much basis points as a percentage of net sale did Selling and administrative expenses increased in 2019 compared to 2018?"}
{"_id": "q1a738386", "title": "", "text": "What are the respective voyage revenues in 2018 and 2019?"}
{"_id": "q1a72830a", "title": "", "text": "What was the cost of sales in 2019?"}
{"_id": "q1a7295f2", "title": "", "text": "What does the table show?"}
{"_id": "q1a723698", "title": "", "text": "What is the Net income (loss) for 2019?"}
{"_id": "q1a72291e", "title": "", "text": "What is the research and development labour resources as of fiscal year 2019?"}
{"_id": "q1a7229aa", "title": "", "text": "What is the difference between the Change between Fiscal increase for 2019 and 2018 and 2018 and 2017 for Payroll and payroll-related benefits?"}
{"_id": "q1a741b52", "title": "", "text": "In which year was Raw materials and supplies larger?"}
{"_id": "q1a733700", "title": "", "text": "What is the company's total operating lease obligations between 2020 to 2022?"}
{"_id": "q1a721028", "title": "", "text": "How much goodwill was acquired during fiscal 2019, excluding the goodwill acquired from the purchase of BOLTS Technologies, Inc.?"}
{"_id": "q1a711ede", "title": "", "text": "What was the increase / (decrease) in wireless capital expenditure from 2018 to 2019?"}
{"_id": "q1a724d72", "title": "", "text": "What was Net cash provided by (used in) operating activities in 2017?"}
{"_id": "q1a721262", "title": "", "text": "How much did restructuring costs decreased by from 2018 to 2019?"}
{"_id": "q1a72c0c2", "title": "", "text": "What caused the The year-to-year increase in cash flow from financing activities?"}
{"_id": "q1a71bace", "title": "", "text": "What is included in restructuring expenses?"}
{"_id": "q1a73d160", "title": "", "text": "What was the percentage change in cash and cash equivalents between 2018 and 2019?"}
{"_id": "q1a73b18a", "title": "", "text": "What was the % of revenue for Research and Development expense in 2019 and 2018?"}
{"_id": "q1a7277b6", "title": "", "text": "What is the amount of total Sitting Fees as a percentage of Total Managerial Remuneration?"}
{"_id": "q1a7321f2", "title": "", "text": "What was the increase / (decrease) in the net income (loss) from 2018 to 2019?"}
{"_id": "q1a731234", "title": "", "text": "What was the long-term prepaid ground rent in 2018?"}
{"_id": "q1a738be2", "title": "", "text": "What drove the income tax benefit?"}
{"_id": "q1a72b19a", "title": "", "text": "What were the components making up the total carrying value of CGUs in the table?"}
{"_id": "q1a72394a", "title": "", "text": "What was subscription revenue in 2019?"}
{"_id": "q1a7254ca", "title": "", "text": "What was the average rate used to calculate capitalized interest in 2018?"}
{"_id": "q1a7379c2", "title": "", "text": "What financial items does revenue consist of?"}
{"_id": "q1a737cf6", "title": "", "text": "In which year was Flextronics Technology less than 20.0%?"}
{"_id": "q1a73bbd0", "title": "", "text": "What does \"Other non-current assets\" in 2018 mainly represent?"}
{"_id": "q1a741e36", "title": "", "text": "What is the Effect of dilutive securities expressed as a percentage of Excluded as anti-dilutive for fiscal year 2019?"}
{"_id": "q1a72a2a4", "title": "", "text": "What is the increase / (decrease) in the communication figures from 2018 to 2019?"}
{"_id": "q1a714a12", "title": "", "text": "What was the percentage change in the net property and equipment between 2018 and 2019?"}
{"_id": "q1a714f08", "title": "", "text": "What is the average fee earned or paid in cash compensation for all non-employee directors?"}
{"_id": "q1a73cf12", "title": "", "text": "What is the average net loss in 2018 and 2019?"}
{"_id": "q1a71fc14", "title": "", "text": "How much was the difference in unearned revenue and accrued revenue in 2019?"}
{"_id": "q1a71fff2", "title": "", "text": "Why does the Company report net profit excluding impairment?"}
{"_id": "q1a731716", "title": "", "text": "What was the percentage change in the amount for contracts within one year?"}
{"_id": "q1a733426", "title": "", "text": "What is the average value of employee benefits for 2018 and 2019?"}
{"_id": "q1a732e68", "title": "", "text": "What is the number of restricted share units covered by the 2001 share incentive plan?"}
{"_id": "q1a732ec2", "title": "", "text": "What proportion of the total Number of Shares Remaining Available for Future Issuance Under Equity Compensation Plans are the Amended and Restated 2010 Share Incentive Plan?"}
{"_id": "q1a7239f4", "title": "", "text": "What is the change in Total Revenue between 2017 and 2018 as a percentage?"}
{"_id": "q1a7393d0", "title": "", "text": "What was the non-current assets of United Kingdom as a percentage of the total amount in Europe, Middle East and Africa in 2019?"}
{"_id": "q1a72af6a", "title": "", "text": "Which years does the table show?"}
{"_id": "q1a73e3a8", "title": "", "text": "What is the percentage change in total segment net revenues between 2018 and 2019?"}
{"_id": "q1a7243b8", "title": "", "text": "What body certifies the R&D centers?"}
{"_id": "q1a71d70c", "title": "", "text": "How much was the average total amortization of intangible assets in 2018 and 2019?"}
{"_id": "q1a72399a", "title": "", "text": "What was the change in Subscription Revenue between 2018 and 2019?"}
{"_id": "q1a7161a0", "title": "", "text": "What is the average basic earnings per share for fiscal years 2017 to 2019?"}
{"_id": "q1a73deb2", "title": "", "text": "How much income tax benefit are included in net income of fiscal 2018?"}
{"_id": "q1a7415da", "title": "", "text": "What are the number of shares beneficially owned by Brian Kinion and Christopher Lien respectively?"}
{"_id": "q1a731f18", "title": "", "text": "What is Cost of Customer support revenues is comprised primarily of?"}
{"_id": "q1a715cc8", "title": "", "text": "How much was the liability for gross unrecognized tax benefits during fiscal 2019?"}
{"_id": "q1a72c630", "title": "", "text": "What was the U.S. Federal statutory rate in 2019?"}
{"_id": "q1a72ec6e", "title": "", "text": "How many years did professional fees exceed $1,000 thousand?"}
{"_id": "q1a73736e", "title": "", "text": "What is currency translation reserve made up of?"}
{"_id": "q1a73b702", "title": "", "text": "What was the amortization expense for the twelve months ended December 31, 2019 in 2018?"}
{"_id": "q1a71a174", "title": "", "text": "What resulted in the increase in the amortization of purchased intangibles included in the CTS operating results?"}
{"_id": "q1a71b4b6", "title": "", "text": "How much did the company decrease its valuation allowance by in 2019?"}
{"_id": "q1a72a74a", "title": "", "text": "What were the trade receivables in 2019?"}
{"_id": "q1a72d8a0", "title": "", "text": "What do the company's financing arrangements include?"}
{"_id": "q1a71bd44", "title": "", "text": "What was the rate of compensation increase in 2019?"}
{"_id": "q1a7186b2", "title": "", "text": "What is the percentage change in goodwill between 2018 and 2019?"}
{"_id": "q1a73a5c8", "title": "", "text": "What is the difference in Basic EPS Shares outstanding between 2018 and 2019?"}
{"_id": "q1a7388ae", "title": "", "text": "How does the company determine the allowance for doubtful accounts?"}
{"_id": "q1a71c92e", "title": "", "text": "How much additional rental revenue was contributed by the refranchising strategy in 2019?"}
{"_id": "q1a73b1e4", "title": "", "text": "In which year was Research and development expenses less than 50,000 thousands?"}
{"_id": "q1a72d062", "title": "", "text": "How much did interest expense change from 2018 to 2019?"}
{"_id": "q1a73d82c", "title": "", "text": "What constitutes Audit fee?"}
{"_id": "q1a7397c2", "title": "", "text": "What was the total gross receivables for credit ratings 1 to 4 in 2019?"}
{"_id": "q1a71e10c", "title": "", "text": "What is the ratio of net cash provided by operating activities over net cash used in investing activities in 2019?"}
{"_id": "q1a731f72", "title": "", "text": "What is the mean annual GAAP-based Customer Support Gross Profit? "}
{"_id": "q1a711b6e", "title": "", "text": "What is the total assets as of June 30, 2019?"}
{"_id": "q1a711f42", "title": "", "text": "What was the percentage increase / (decrease) in capital expenditure from 2018 to 2019?"}
{"_id": "q1a713720", "title": "", "text": "What did operating lease obligations include?"}
{"_id": "q1a7130e0", "title": "", "text": "What was the net income in August 2019?"}
{"_id": "q1a729886", "title": "", "text": "What is the percentage change in goodwill impairment between 2017 and 2018?"}
{"_id": "q1a71412a", "title": "", "text": "What was the impairment charge in 2018?"}
{"_id": "q1a733106", "title": "", "text": "How does the company calculate the volatility of the derivatives?"}
{"_id": "q1a7413aa", "title": "", "text": "What was the percentage change in the the total net property, plant and equipment between 2018 and 2019?"}
{"_id": "q1a73ebc8", "title": "", "text": "What was the percentage change in Dividend and interest income in 2018 from 2017?"}
{"_id": "q1a71c9e2", "title": "", "text": "What is the percentage constitution of franchise rental revenues among the total franchise revenues in 2019?"}
{"_id": "q1a740914", "title": "", "text": "What is the average current maturities?"}
{"_id": "q1a7254fc", "title": "", "text": "What does the average rate used to calculate capitalized interest represent?"}
{"_id": "q1a7276d0", "title": "", "text": "What is the Sitting Fees for attending board/ committee meetings for Aman Mehta?"}
{"_id": "q1a73f71c", "title": "", "text": "What was the change in Machinery and equipment between 2018 and 2019?"}
{"_id": "q1a734588", "title": "", "text": "How many years did the Accumulated benefit obligation exceed $3,000 thousand?"}
{"_id": "q1a71e3dc", "title": "", "text": "In the first quarter of 2018, what was the difference between the high and low price per share?"}
{"_id": "q1a72268a", "title": "", "text": "What does Special charges (recoveries) include?"}
{"_id": "q1a72e796", "title": "", "text": "What is the average of total Amortization of intangibles between 2017 to 2019?"}
{"_id": "q1a71ce9c", "title": "", "text": "What was the Debt financed acquisition of communication sites in 2018?"}
{"_id": "q1a722720", "title": "", "text": "What is the average annual total charges?"}
{"_id": "q1a73edd0", "title": "", "text": "What was the change in Pro forma net income attributable to American Tower Corporation common stockholders between 2018 and 2019?"}
{"_id": "q1a73aaaa", "title": "", "text": "In 2019, what is the percentage constitution of nonvested stock units among the total share-based compensation expense?"}
{"_id": "q1a738c0a", "title": "", "text": "What was the value of minority interest in 2019?"}
{"_id": "q1a716966", "title": "", "text": "What was the average Deferred compensation for 2018 and 2019?"}
{"_id": "q1a71a8fe", "title": "", "text": "What is the  Net earnings from operations in 2018?"}
{"_id": "q1a73703a", "title": "", "text": "What is the result of the Group serving a large number of customers?"}
{"_id": "q1a727dd8", "title": "", "text": "What was the Products and Licensing revenue in 2019 and 2018 respectively?"}
{"_id": "q1a7339c6", "title": "", "text": "What was the revenue from AMER for Aerospace/Defense?"}
{"_id": "q1a740432", "title": "", "text": "What was the percentage change in prepaid taxes from 2018 to 2019?"}
{"_id": "q1a73a03c", "title": "", "text": "What was the percentage change in the revenue from Other regions between 2018 and 2019?"}
{"_id": "q1a73d854", "title": "", "text": "What is included in Tax fees?"}
{"_id": "q1a718036", "title": "", "text": "What are the respective average price per megabit in 2017 and 2018 respectively?"}
{"_id": "q1a72903e", "title": "", "text": "What is the Property and equipment, net value expressed as a percentage to  Property and equipment, gross value for 2019?"}
{"_id": "q1a721a64", "title": "", "text": "What was the revenue from Traditional & Other Products for Network Solutions?"}
{"_id": "q1a73dbd8", "title": "", "text": "What was the change in profit before taxation in 2019 from 2018?"}
{"_id": "q1a71dc98", "title": "", "text": "What percentage of total revenue was Americas Revenue in 2019?"}
{"_id": "q1a71fd86", "title": "", "text": "What was the total revenue in Q1 2020?"}
{"_id": "q1a733c32", "title": "", "text": "What was the Intrinsic value of SARS exercised in 2017?"}
{"_id": "q1a727b4e", "title": "", "text": "What is the change in revenue growth between 2019 and 2018?"}
{"_id": "q1a724412", "title": "", "text": "What is the change in consolidated total R&D expenditure from FY 2018 to FY 2019?"}
{"_id": "q1a7190d0", "title": "", "text": "What was the change in the Effect of prior year adjustments between 2017 and 2019?"}
{"_id": "q1a716bc8", "title": "", "text": "What was the average Provision for (benefit from) income taxes for 2018 and 2019?"}
{"_id": "q1a7349fc", "title": "", "text": "What was the variance in percent for Net revenues from fiscal 2017 to fiscal 2018?"}
{"_id": "q1a729ab6", "title": "", "text": "What is the average Net income attributable to parent company for the period December 31, 2019 and 2018?"}
{"_id": "q1a72cbee", "title": "", "text": "What is the Restricted stock in 2019?"}
{"_id": "q1a727ae0", "title": "", "text": "What was the change in Revenue between 2017 and 2018?"}
{"_id": "q1a73cc24", "title": "", "text": "What is the difference in warranty reserve from beginning to end of period 2019?"}
{"_id": "q1a72e3e0", "title": "", "text": "What is the change in the Restricted Share Awards (“RSAs”) between 2018 and 2019?"}
{"_id": "q1a723ea4", "title": "", "text": "What was the average Cash flow from investing activities between 2018 and 2019?"}
{"_id": "q1a723152", "title": "", "text": "What is the percentage difference between the first and fourth quarter high in fiscal year 2019?"}
{"_id": "q1a71d7f2", "title": "", "text": "Why did amortization of intangible assets increase in fiscal 2019 relative to fiscal 2018?"}
{"_id": "q1a7415a8", "title": "", "text": "What are the number of shares beneficially owned by L. Gordon Crovitz and Donald P. Hutchison respectively?"}
{"_id": "q1a724fac", "title": "", "text": "What are the respective number of convertible senior notes in 2018 and 2019?"}
{"_id": "q1a716114", "title": "", "text": "What data does the table contain?"}
{"_id": "q1a7288f0", "title": "", "text": "What is the increase/ (decrease) in cable revenue from 2017 to 2018?"}
{"_id": "q1a735032", "title": "", "text": "What was the increase / (decrease) in the Weighted average grant date fair value from 2018 to 2019?"}
{"_id": "q1a73ff6e", "title": "", "text": "What is the average sales per square metre for both F18 and F19?"}
{"_id": "q1a72f2c2", "title": "", "text": "In which year was Other liabilities larger?"}
{"_id": "q1a728d46", "title": "", "text": "What was purchased in fiscal 2019?"}
{"_id": "q1a72098e", "title": "", "text": "How are the expenses recognized for RSUs with time-based service conditions?"}
{"_id": "q1a71447c", "title": "", "text": "What was the amount of government grants included within other payables in 2018?"}
{"_id": "q1a72801c", "title": "", "text": "Who is covered under the noncontributory defined benefit pension plan?"}
{"_id": "q1a711812", "title": "", "text": "How many years did general and administrative expense exceed $2,000 million?"}
{"_id": "q1a72faa6", "title": "", "text": "In which year was the financial income and costs recorded for?"}
{"_id": "q1a740c20", "title": "", "text": "What was the total percentage change in Effect of exchange rate changes on cash and cash equivalents between 2017 and 2019?"}
{"_id": "q1a73e5a6", "title": "", "text": "What was the total comprehensive income from currency effects and measurement results from hedging transactions and hedging relationships?"}
{"_id": "q1a71631c", "title": "", "text": "Which years does the table provide information for the projected benefit obligation, accumulated benefit obligation and fair value of plan assets for the company's Pension Plans?"}
{"_id": "q1a740b3a", "title": "", "text": "What years does the table provide data for Net cash provided by (used in) operating activities?"}
{"_id": "q1a724fde", "title": "", "text": "What are the respective number of shares of common stock issuable under equity incentive plans outstanding in 2018 and 2019?"}
{"_id": "q1a737f94", "title": "", "text": "What is the percentage change in Total accrued expenses and other payables from 2018 to 2019?"}
{"_id": "q1a71d7ca", "title": "", "text": "Where did the company acquire its intangible assets?"}
{"_id": "q1a7232ec", "title": "", "text": "How is lower of cost determined?"}
{"_id": "q1a739178", "title": "", "text": "In which year was the accumulated benefit obligation for foreign defined benefit pension plans larger?"}
{"_id": "q1a728b34", "title": "", "text": "What was the revenue from Applications in 2019?"}
{"_id": "q1a72bc58", "title": "", "text": " What is the company's average gross profit in 2018 and 2019?"}
{"_id": "q1a733c5a", "title": "", "text": "What was the change in the Intrinsic value of SARS exercised between 2017 and 2018?"}
{"_id": "q1a73934e", "title": "", "text": "What do the non-current assets under America in 2019 include?"}
{"_id": "q1a711272", "title": "", "text": "What method did the company use when Topic 606 in fiscal 2019 was adopted?"}
{"_id": "q1a71e404", "title": "", "text": "In 2019, how many quarters did the high share price exceed $85.00?"}
{"_id": "q1a723350", "title": "", "text": "What is the increase/ (decrease) in Wireless devices and accessories from 2018 to 2019?"}
{"_id": "q1a7393f8", "title": "", "text": "What was the percentage change in non-current assets in Asia Pacific?"}
{"_id": "q1a72f222", "title": "", "text": "What was the amount of Other liabilities in 2019?"}
{"_id": "q1a72aa06", "title": "", "text": "What was the change in the Loss from discontinued operations from 2017 to 2018?"}
{"_id": "q1a7149e0", "title": "", "text": "What was the change in leasehold improvements between 2018 and 2019?"}
{"_id": "q1a73ac6c", "title": "", "text": "What was the change in inventories of finished goods between 2018 and 2019?"}
{"_id": "q1a73c77e", "title": "", "text": "What is the percentage of the total operating service revenues out of the Total Bell Wireless revenues in 2019?"}
{"_id": "q1a711c04", "title": "", "text": "What is the percentage change of total assets from fiscal year 2018 to 2019?"}
{"_id": "q1a741378", "title": "", "text": "What was the change in the amount of Buildings and Improvements between 2018 and 2019?"}
{"_id": "q1a72ca0e", "title": "", "text": "In which year was the Net cash flow from operating activities larger?"}
{"_id": "q1a720cb8", "title": "", "text": "What is the company's valuation allowance in 2019?"}
{"_id": "q1a717384", "title": "", "text": "What was the total assets from AMER in 2018?"}
{"_id": "q1a732440", "title": "", "text": "What is the change in Time charter equivalent revenues from Years Ended December 31, 2018 to 2019?"}
{"_id": "q1a73a578", "title": "", "text": "What is the diluted EPS Shares outstanding for 2019 and 2018 respectively?"}
{"_id": "q1a73bc5c", "title": "", "text": "In which year was the oil derivative instrument higher?"}
{"_id": "q1a720ce0", "title": "", "text": "What is the 2019 net deferred tax assets?"}
{"_id": "q1a720254", "title": "", "text": "What are the broad categories of non-current assets in the table?"}
{"_id": "q1a7178a2", "title": "", "text": "Which years does the table provide information for the related party items included in Revenues?"}
{"_id": "q1a735000", "title": "", "text": "What was the percentage increase / (decrease) in Weighted average grant date fair value from 2018 to 2019?"}
{"_id": "q1a722e3c", "title": "", "text": "How much was the landholder duty on acquisition of APDC properties in 2019?"}
{"_id": "q1a722bd0", "title": "", "text": "In which year was cost of net revenue less than 150,000 thousands?"}
{"_id": "q1a719896", "title": "", "text": "What was the Restricted cash in 2017?"}
{"_id": "q1a713392", "title": "", "text": "What is the difference in the ending balances between 2018 and 2019?"}
{"_id": "q1a7364fa", "title": "", "text": "What is the value of the amortized costs of  the corporate bonds as a percentage of the total amortized cost?"}
{"_id": "q1a71a89a", "title": "", "text": "How is Basic net earnings per common share calculated"}
{"_id": "q1a719012", "title": "", "text": "Which foreign jurisdictions had the greatest effect on the provision for income taxes?"}
{"_id": "q1a737076", "title": "", "text": "How is external revenue detailed?"}
{"_id": "q1a716628", "title": "", "text": "Which year had a greater Over 2 months overdue past due but not impaired receivables?"}
{"_id": "q1a72c3a6", "title": "", "text": "What is the disclosure of Cash and cash equivalents, accounts receivable, and accounts payable?"}
{"_id": "q1a72be1a", "title": "", "text": "How much did sales and marketing expenses increase by for year ended 2019 compared to year ended 2018?"}
{"_id": "q1a71bd12", "title": "", "text": "What was the discount rate used to state?"}
{"_id": "q1a723094", "title": "", "text": "What is the reason for the common stock being delisted from NASDAQ capital market?"}
{"_id": "q1a731bb2", "title": "", "text": "What was the Restricted stock unit issuances in 2019?"}
{"_id": "q1a723be8", "title": "", "text": "What was the change in domestic income between 2017 and 2018?"}
{"_id": "q1a72b172", "title": "", "text": "What is the goodwill for  Digital in 2019?"}
{"_id": "q1a71c960", "title": "", "text": "What is the amount of royalties in 2019?"}
{"_id": "q1a73a5fa", "title": "", "text": "What is the total number of exercisable shares excluded for 2019 and 2018 altogether?"}
{"_id": "q1a72cbbc", "title": "", "text": "What was the income tax benefit related to share-based compensation in 2019?"}
{"_id": "q1a73bc8e", "title": "", "text": "What was the change in mark-to-market interest rate swaps valuation between 2018 and 2019?"}
{"_id": "q1a7342ae", "title": "", "text": "What were the main drivers for the overall increase in operating expenses in 2019? "}
{"_id": "q1a74093c", "title": "", "text": "What is the Long-term debt, less current maturities average?"}
{"_id": "q1a73f744", "title": "", "text": "What was the change in projects in process between 2018 and 2019?"}
{"_id": "q1a71e602", "title": "", "text": "What does the data centre services revenue consist of?"}
{"_id": "q1a7228ec", "title": "", "text": "What do Research and development expenses consist primarily of?"}
{"_id": "q1a71598a", "title": "", "text": "What was the total stock-based compensation expense amount in 2018?"}
{"_id": "q1a7178d4", "title": "", "text": "What were the software services in 2019?"}
{"_id": "q1a719be8", "title": "", "text": "What is the topic of this note?"}
{"_id": "q1a7279e6", "title": "", "text": "What was constant currency revenue in 2019?"}
{"_id": "q1a72d8fa", "title": "", "text": "What was the percentage change in net loan receivables between 2018 and 2019?"}
{"_id": "q1a72be42", "title": "", "text": "How much did sales and marketing expenses increase by for year ended 2018 compared to year ended 2017?"}
{"_id": "q1a71f70a", "title": "", "text": "In which year was the amount of interest received larger?"}
{"_id": "q1a72702c", "title": "", "text": "What was the difference between total operating lease obligations and total purchase obligations?"}
{"_id": "q1a740892", "title": "", "text": "What are the conditions for repurchase of capital stock by the company?"}
{"_id": "q1a725cb8", "title": "", "text": "What is the change in costs of FinTech and Business Services revenue between the fourth quarter of 2018 and 2019?"}
{"_id": "q1a73295e", "title": "", "text": "What is the total amount of dividends paid in cash in 2019?"}
{"_id": "q1a73cbca", "title": "", "text": "For how long after product purchase does the company's warranty obligation provide repair or replacement of defective product?"}
{"_id": "q1a7233aa", "title": "", "text": "What is the increase/ (decrease) in Total inventories from 2018 to 2019?"}
{"_id": "q1a723e18", "title": "", "text": "In 2019, what was the decrease in cash flow from investing activities?"}
{"_id": "q1a73e2c2", "title": "", "text": "What was the segment operating income of Blizzard in 2019?"}
{"_id": "q1a72a056", "title": "", "text": "What is the total number of subscribers for Television and Local residential telephone services in 2019?"}
{"_id": "q1a72db8e", "title": "", "text": "What is the percentage of furniture and equipment in 2019 as a total of all the assets in 2019??"}
{"_id": "q1a73b3ce", "title": "", "text": "What is the percentage change in the number of shares forfeited during the period from 2018 to 2019?"}
{"_id": "q1a723b34", "title": "", "text": "Which years does the table provide information for Income before income taxes?"}
{"_id": "q1a7176ea", "title": "", "text": "What percentage of the decrease in total revenue is from the loss in Zyla (Oxaydo)?"}
{"_id": "q1a741ac6", "title": "", "text": "What would the amount of inventories be if the FIFO method of inventory had been used instead of the LIFO method?"}
{"_id": "q1a7258bc", "title": "", "text": "Which financial reporting standards is this prepared based on?"}
{"_id": "q1a722496", "title": "", "text": "What is the total operating leases due within 3 years?"}
{"_id": "q1a739ace", "title": "", "text": "What was the difference in the total between Loan Receivables and Financed service contracts?"}
{"_id": "q1a737698", "title": "", "text": "When was the dividend declared in 2019?"}
{"_id": "q1a713bd0", "title": "", "text": "What was the percentage change in acquisition-related costs between 2018 and 2019?"}
{"_id": "q1a726cda", "title": "", "text": "What is the percentage change in the total gross carrying amount of intangible assets from 2018 to 2019?"}
{"_id": "q1a729f98", "title": "", "text": "What products are winning customers over with leading product and programing innovations?"}
{"_id": "q1a717b0e", "title": "", "text": "What is the principal amount for the loan agreement for the acquisition of an excavator on November  2016?"}
{"_id": "q1a73eaec", "title": "", "text": "What was the amount of Dividend and interest income in 2019?"}
{"_id": "q1a73b734", "title": "", "text": "What was the total credit facility in 2019?"}
{"_id": "q1a72b956", "title": "", "text": "What was the Carrying Value (Denominated Currency) of the Kenya Debt in 2019?"}
{"_id": "q1a72e32c", "title": "", "text": "What is the amount of Stock options for fiscal year 2017?"}
{"_id": "q1a739f60", "title": "", "text": "What was the revenue in North America in 2019?"}
{"_id": "q1a71e6e8", "title": "", "text": "What was the sum of total revenue and total other income for FY19?"}
{"_id": "q1a736e6e", "title": "", "text": "What was the early debt redemption costs during 2019?"}
{"_id": "q1a73483a", "title": "", "text": "What is the change in the average general administrative expenses between 2017-2018, and 2018-2019?"}
{"_id": "q1a71d964", "title": "", "text": "What was the amount of  expenses for long-term remuneration components in FY2019?"}
{"_id": "q1a71a674", "title": "", "text": "How many years did Accounts receivable exceed $50,000 thousand?"}
{"_id": "q1a7121d6", "title": "", "text": "What are the types of earnings/(loss) per share provided in the table?"}
{"_id": "q1a713edc", "title": "", "text": "What is the average Net Loss for December 31, 2018 and 2019?"}
{"_id": "q1a7124ba", "title": "", "text": "What is the change in balance between 2017 and 2018 at January 1?"}
{"_id": "q1a72ad30", "title": "", "text": "What was the change in Rest of World in 2019 from 2018?"}
{"_id": "q1a73ef60", "title": "", "text": "What was The fair value of performance-based stock awards that vested in fiscal 2019, 2018 and 2017 respectively?"}
{"_id": "q1a71fb60", "title": "", "text": "How much was the unearned revenue for 2019?"}
{"_id": "q1a734f74", "title": "", "text": "What was the risk free interest rate in 2019?"}
{"_id": "q1a72d3b4", "title": "", "text": "What was the percentage change in Dividend shares awarded in 2019 from 2018?"}
{"_id": "q1a7284ea", "title": "", "text": "What is the percentage change in the value of raw materials in 2019 compared to 2018?"}
{"_id": "q1a73be82", "title": "", "text": "What is the realization of the net deferred tax assets ultimately dependent upon?"}
{"_id": "q1a716c22", "title": "", "text": "In which year was Provision for (benefit from) income taxes negative?"}
{"_id": "q1a73ed44", "title": "", "text": "What was the pro forma revenue in 2019?"}
{"_id": "q1a712258", "title": "", "text": "What was the percentage change in the Weighted average number of shares outstanding incl. dilutive effect of share options from 2018 to 2019?"}
{"_id": "q1a735faa", "title": "", "text": "What is the company's total operating expenses in 2019? "}
{"_id": "q1a729fd4", "title": "", "text": "What is the percentage change in BCE retail subscribers for Wireless?"}
{"_id": "q1a741094", "title": "", "text": "What is the incentive compensation received by Messrs Richard, Robert and Bruce Leeds respectively?"}
{"_id": "q1a7388d6", "title": "", "text": "How much was the long-term accounts receivable, net of allowance for doubtful accounts, as of June 30, 2018?"}
{"_id": "q1a717410", "title": "", "text": "How many years did total assets exceed $2,000,000 thousand?"}
{"_id": "q1a72c324", "title": "", "text": "What is the percentage increase / (decrease) in the carrying value of Note payable?"}
{"_id": "q1a737cce", "title": "", "text": "Who was the largest customer in 2019, 2018 and 2017?"}
{"_id": "q1a7154d0", "title": "", "text": "Why was there a reduction in property and equipment in 2018 and 2019?"}
{"_id": "q1a7347e0", "title": "", "text": "What is the average general and administrative expenses for 2018 and 2019?"}
{"_id": "q1a71837e", "title": "", "text": "What is the percentage of capital expenditures for Bell Wireline out of the BCE capital expenditures in 2019?"}
{"_id": "q1a722144", "title": "", "text": "What caused the increase in research and development expense?"}
{"_id": "q1a71656a", "title": "", "text": "What are the types of past due but not impaired receivables?"}
{"_id": "q1a724b4c", "title": "", "text": "In which year was the deferred income larger?"}
{"_id": "q1a713e28", "title": "", "text": "How much was the restricted stock awards excluded from the computation of diluted earnings per share for the fiscal year ended 2019?"}
{"_id": "q1a73df8e", "title": "", "text": "What is the Gross Profit in 2019, 2018 and 2017 respectively?"}
{"_id": "q1a72b5aa", "title": "", "text": "What was the Cash used to settle the obligation in 2017?"}
{"_id": "q1a72af9c", "title": "", "text": "How many years did servicing liabilities exceed $3,000 thousand?"}
{"_id": "q1a726a28", "title": "", "text": "What is the increase in total revenue attributed to?"}
{"_id": "q1a7393a8", "title": "", "text": "In which year was the amount of non-current assets in Asia Pacific larger?"}
{"_id": "q1a72cc16", "title": "", "text": "What was the total unrecognized compensation cost related to non-vested RSAs and PSAs in 2019?"}
{"_id": "q1a713108", "title": "", "text": "What was the gross profit in May 2019?"}
{"_id": "q1a72070e", "title": "", "text": "In which years were the share-based payments for the Share Incentive Plan ('SIP') accounted for?"}
{"_id": "q1a714be8", "title": "", "text": "What is the respective revenue from Europe in 2018 and 2019?"}
{"_id": "q1a71b10a", "title": "", "text": "What was the reason for the increase in Selling and Marketing expenses?"}
{"_id": "q1a7163e4", "title": "", "text": "What was the change in the percentage of plan assets for Equity Securities between 2018 and 2019?"}
{"_id": "q1a73d64c", "title": "", "text": "What is the date where shares issued is the greatest?"}
{"_id": "q1a726a82", "title": "", "text": "What is the value of revenue from subscription and returns as a percentage of the 2018 total revenue?"}
{"_id": "q1a723ef4", "title": "", "text": "What was the increase / (decrease) in the Net change in cash and cash equivalent from discontinued operations from 2018 to 2019?"}
{"_id": "q1a72e0f2", "title": "", "text": "What was the revenue from Canada in 2017?"}
{"_id": "q1a725010", "title": "", "text": "What is the average number of convertible senior notes between 2017 and 2019?"}
{"_id": "q1a71d504", "title": "", "text": "What was the change in the balance of minimum pension liability between 2017 and 2018?"}
{"_id": "q1a7325da", "title": "", "text": "Which countries are sales outside United States principally to?"}
{"_id": "q1a723382", "title": "", "text": "What is the increase/ (decrease) in Other finished goods and merchandise from 2018 to 2019?"}
{"_id": "q1a7351c2", "title": "", "text": "What were the Proceeds from issuance of shares in 2017?"}
{"_id": "q1a7336d8", "title": "", "text": "What does the company's investment commitments represent?"}
{"_id": "q1a719c4c", "title": "", "text": "What is included in the line item \"financing cash flows\"?"}
{"_id": "q1a725290", "title": "", "text": "If the other associated cost related to sharebased compensation expense was included, what is the other associated costs for 2018?"}
{"_id": "q1a7140ee", "title": "", "text": "What does the share of net earnings in other affiliates represent?"}
{"_id": "q1a7186da", "title": "", "text": "What is the percentage change in Net recognized amounts of identifiable assets acquired and liabilities assumed between 2018 and 2019?"}
{"_id": "q1a73030c", "title": "", "text": "What was the gross carrying value of other intangible assets as a percentage of the total gross carrying value?"}
{"_id": "q1a741148", "title": "", "text": "What is the total percentage net sales allocated under the 2019 Plan for Barry Litwin and Thomas Clark?"}
{"_id": "q1a722dd8", "title": "", "text": "What were the significant expense items, that The Group identified, which had impacted the financial performance for the year?"}
{"_id": "q1a711eac", "title": "", "text": "What caused the decrease in capital expenditure in cable in 2019?"}
{"_id": "q1a73c698", "title": "", "text": "What drove the change in product revenues in 2019?"}
{"_id": "q1a72db02", "title": "", "text": "What was the depreciation expense in fiscal 2017?"}
{"_id": "q1a721a28", "title": "", "text": "What was the revenue from Access & Aggregation for Network Solutions?"}
{"_id": "q1a73b342", "title": "", "text": "What is the number of outstanding shares at the beginning of the period in 2019?"}
{"_id": "q1a7251fa", "title": "", "text": "What does the table show?"}
{"_id": "q1a71fe1c", "title": "", "text": "What was the change in Net income per weighted-average share attributable to VMware, Inc. common stockholders, diluted for Classes A and B between Q2 and Q3 2020?"}
{"_id": "q1a739ce0", "title": "", "text": "What is the purpose of the company's policy?"}
{"_id": "q1a717686", "title": "", "text": "What is the decrease in licensing revenue from Zyla (Oxaydo) from 2018 to 2019?"}
{"_id": "q1a73ff14", "title": "", "text": "What is the nominal difference for Sales between F19 and F18?"}
{"_id": "q1a713752", "title": "", "text": "What did capital purchase obligations represent?"}
{"_id": "q1a726c80", "title": "", "text": "What was the accumulated amortization of fiscal years 2018 and 2019, respectively? "}
{"_id": "q1a73730a", "title": "", "text": "What is the status of the group's financial position?"}
{"_id": "q1a71e0b2", "title": "", "text": "How much cash was attributed to intercompany balances in connection with the Inotera Acquisition?"}
{"_id": "q1a732990", "title": "", "text": "What are dividends?"}
{"_id": "q1a726532", "title": "", "text": "What is the change in total income from 2017 to 2018?"}
{"_id": "q1a719044", "title": "", "text": "What was the combined provision for income taxes for China and Mexico in 2019?"}
{"_id": "q1a7196e8", "title": "", "text": "What was the percentage change in impairment of investment in Golar Partners?"}
{"_id": "q1a7383b8", "title": "", "text": "What are the respective voyage expenses in 2018 and 2019?"}
{"_id": "q1a726ffa", "title": "", "text": "What was the difference between total debt obligations and purchase obligations?"}
{"_id": "q1a71dbda", "title": "", "text": "What was the movement in total revenue in 2019?"}
{"_id": "q1a7272ac", "title": "", "text": "Which 3 levels are shown in the table?"}
{"_id": "q1a736964", "title": "", "text": "What was the change in the amount of Other assets between 2018 and 2019?"}
{"_id": "q1a723bb6", "title": "", "text": "How many years did Foreign income exceed $5,000 thousand?"}
{"_id": "q1a72f04c", "title": "", "text": "What was the change in net income (loss) between 2018 and 2019?"}
{"_id": "q1a7193d2", "title": "", "text": "What was the average PSAs granted for 2017-2019?"}
{"_id": "q1a712dde", "title": "", "text": "What is Gregory S. Clark's base salary?"}
{"_id": "q1a719f44", "title": "", "text": "In which year was the dividend paid per ordinary share in € the largest?"}
{"_id": "q1a736bd0", "title": "", "text": "What are the expected operating fiscal gains in fiscal 2020 and 2021 and thereafter, respectively, based on the company’s forecasts of the timing of recognition of the underlying hedged items?"}
{"_id": "q1a72c982", "title": "", "text": "What was the Net cash flow from operating activities in 2019?"}
{"_id": "q1a73bf36", "title": "", "text": "What is the percentage change in the net operating loss carry forward from 2018 to 2019?"}
{"_id": "q1a73fc58", "title": "", "text": "What is the average FY19 NEO annual salary?"}
{"_id": "q1a732bde", "title": "", "text": "What caused the increase in the prepaid expenses?"}
{"_id": "q1a7260f0", "title": "", "text": "What was the total amount of key management compensation in 2019?"}
{"_id": "q1a73670c", "title": "", "text": "What is the change in revenue between 2018 and 2019?"}
{"_id": "q1a7339ee", "title": "", "text": "How many geographical segments did external revenue exceed $1,000,000 thousand?"}
{"_id": "q1a7133ec", "title": "", "text": "What is the percentage change of the ending balance from 2017 to 2018?"}
{"_id": "q1a712a50", "title": "", "text": "How much is the level 1 FVPL as at 31 December 2019?"}
{"_id": "q1a71f44e", "title": "", "text": "How much did Medical segment loss from operations increased in fiscal 2018 compared to fiscal 2017?"}
{"_id": "q1a73c9e0", "title": "", "text": "What is the average annual total compensation for the Board of directors in fiscal years ended June 30, 2017, 2018 and 2019?"}
{"_id": "q1a7180c2", "title": "", "text": "What is the percentage change in the number of on-net customer connections between 2017 and 2018?"}
{"_id": "q1a724b1a", "title": "", "text": "What are the types of deferred income in the table?"}
{"_id": "q1a7314dc", "title": "", "text": "What is the average percentage of net revenues for the period December 31, 2019 and 2018?"}
{"_id": "q1a724656", "title": "", "text": "What is the remaining weighted-average useful life of intangible assets acquired?"}
{"_id": "q1a728e04", "title": "", "text": "What was the percentage change prices in the amount for Gold in 2019 from 2018?"}
{"_id": "q1a728d14", "title": "", "text": "What are the Cost of sales and gross margin are subject to?"}
{"_id": "q1a727d1a", "title": "", "text": "What is the change in Products and Licensing revenue between December 31, 2018 and 2019?"}
{"_id": "q1a73acbc", "title": "", "text": "What was the percentage change in total inventories between 2018 and 2019?"}
{"_id": "q1a73055a", "title": "", "text": "What was the depreciation expense in 2017?"}
{"_id": "q1a72d864", "title": "", "text": "What was the volume of channel partner financing in fiscal 2019?"}
{"_id": "q1a73e8da", "title": "", "text": "What was the other expense (income) in 2017?"}
{"_id": "q1a7288be", "title": "", "text": "What is the increase/ (decrease) in wireless revenue from 2017 to 2018?"}
{"_id": "q1a71ad72", "title": "", "text": "What was the amount of equity raising done by the Group in 2018?"}
{"_id": "q1a7301c2", "title": "", "text": "What was the gross carrying value of computer software?"}
{"_id": "q1a71b862", "title": "", "text": "What can cash reserves be used for?"}
{"_id": "q1a71e666", "title": "", "text": "What was the total revenue in FY19?"}
{"_id": "q1a72f290", "title": "", "text": "What were the components making up Total Restructuring Reserves in the table?"}
{"_id": "q1a73aa78", "title": "", "text": "What is the difference in the total share-based compensation expense between 2018 and 2019?"}
{"_id": "q1a71f41c", "title": "", "text": "What was the net sales in 2018?"}
{"_id": "q1a73a2a8", "title": "", "text": "What is the amount of reimbursements for the cost of annual physical examinations and related travel for Mr. Post?"}
{"_id": "q1a737f62", "title": "", "text": "What are the components of Accrued expenses and other payables?"}
{"_id": "q1a72647e", "title": "", "text": "What was the income from United States in 2019?"}
{"_id": "q1a712712", "title": "", "text": "What are the plans under remuneration measure?"}
{"_id": "q1a72d2ce", "title": "", "text": "What was the weighted average market value per ordinary share for DABP options exercised in 2019?"}
{"_id": "q1a733728", "title": "", "text": "What is the percentage constitution of purchase obligations among the total contractual obligations in 2020?"}
{"_id": "q1a740e00", "title": "", "text": "In 2019, what was the pension settlement charge recognized?"}
{"_id": "q1a73af6e", "title": "", "text": "How many % does provisions make up out of the total deferred tax assets?"}
{"_id": "q1a723666", "title": "", "text": "What are the various non-GAAP measures used for?"}
{"_id": "q1a73268e", "title": "", "text": "What is the percentage change in the international sales from 2017 to 2018?"}
{"_id": "q1a73641e", "title": "", "text": "What is the value of the company's marketable securities as of December 31, 2019?"}
{"_id": "q1a733fb6", "title": "", "text": "How did Inotera sell DRAM products to Micron in the periods presented in the table through December 2016?"}
{"_id": "q1a72597a", "title": "", "text": "What is the impact of tax on the group share of associates' profits in 2018, in terms of % change?"}
{"_id": "q1a730bae", "title": "", "text": "What is the percentage change in the company's net owned property and equipment between September 2018 and September 2019?"}
{"_id": "q1a732e9a", "title": "", "text": "What is the number of stock options included in the calculation of the Weighted-Average Exercise Price of Outstanding Options, Warrants and Rights?"}
{"_id": "q1a721000", "title": "", "text": "How much is the core beginning balance as at June 30, 2019?"}
{"_id": "q1a72240a", "title": "", "text": "What is the total long-term debt due for payment?"}
{"_id": "q1a711c36", "title": "", "text": "What is the difference between the Restructuring costs and other reserves in fiscal year 2019 and 2018?"}
{"_id": "q1a73d3ea", "title": "", "text": "What is the increase / (decrease) in the customers from USA from 2018 to 2019?"}
